<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Struts: la vista</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Struts y JSF" src="images/baner_j2ee_der.gif" title="Struts y JSF"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Struts y JSF</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">JSF y Struts</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="JSF y Struts">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-jsf-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-jsf-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="roadmap-jsf.html">Roadmap JSF</a>
</div>
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 3</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 4</div>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-jsf-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-jsf-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 4</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion02-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Struts: la vista</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#ActionForms">ActionForms</a>
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n">Introducci&oacute;n</a>
</li>
<li>
<a href="#El+ciclo+de+vida+de+un+ActionForm">El ciclo de vida de un ActionForm</a>
</li>
<li>
<a href="#Declarar+un+ActionForm+%28en+el+fichero+de+configuraci%C3%B3n%29">Declarar un ActionForm (en el fichero de configuraci&oacute;n)</a>
</li>
<li>
<a href="#Declarar+la+clase+java+del+ActionForm">Declarar la clase java del ActionForm</a>
</li>
</ul>
</li>
<li>
<a href="#Las+librer%C3%ADas+de+etiquetas+de+Struts">Las librer&iacute;as de etiquetas de Struts</a>
<ul class="minitoc">
<li>
<a href="#Las+etiquetas+para+formularios">Las etiquetas para formularios</a>
</li>
<li>
<a href="#Mostrar+los+errores">Mostrar los errores</a>
</li>
</ul>
</li>
</ul>
</div>

<p>En este tema trataremos el interfaz entre la vista y las acciones en Struts: los denominados <span class="codefrag">ActionForms</span> y la implementaci&oacute;n de la vista mediante las librer&iacute;as de etiquetas incluidas en Struts.</p>

<a name="N10012"></a><a name="ActionForms"></a>
<h2 class="underlined_10">ActionForms</h2>
<div class="section">
<a name="N10018"></a><a name="Introducci%C3%B3n"></a>
<h3 class="underlined_5">Introducci&oacute;n</h3>
<p>Aunque los datos introducidos en formularios pueden obtenerse dentro del c&oacute;digo de las acciones directamente  de la petici&oacute;n HTTP (como hemos visto en los ejemplos del tema anterior), Struts ofrece un mecanismo alternativo que proporciona distintas ventajas: los <strong>ActionForm</strong>s. Empleando ActionForms podemos conseguir:</p>
<ul>
  
<li>
<strong>Recolecci&oacute;n autom&aacute;tica de datos</strong> a partir de los incluidos en la petici&oacute;n HTTP.</li>
  
<li>
<strong>Validaci&oacute;n de datos modular</strong> (realizada separadamente a la acci&oacute;n), y en caso de utilizar el plugin <em>Validator</em>, validaci&oacute;n autom&aacute;tica seg&uacute;n lo especificado en un fichero de configuraci&oacute;n.</li>
  
<li>
<strong>Recuperaci&oacute;n de los datos</strong> para volver a rellenar formularios. De esta forma se evita el t&iacute;pico problema de que el usuario tenga que volver a rellenar un formulario entero porque uno de los datos es incorrecto.</li>

</ul>
<p>Podemos considerar un ActionForm como si fuera un JavaBean que captura los datos de un formulario. Los datos se pueden extraer, validar, cambiar y volver a colocar en otro formulario. No obstante, no tiene por qu&eacute; haber una correspondencia uno a uno entre un ActionForm y un formulario HTML, de manera que se puede utilizar el mismo ActionForm para englobar varios formularios separados en distintas p&aacute;ginas (caso t&iacute;pico de un asistente). Tambi&eacute;n se puede reutilizar el mismo ActionForm en distintos formularios que compartan datos (por ejemplo, para dar de alta o modificar los datos de un usuario registrado).</p>
<p>En Struts se pueden definir b&aacute;sicamente dos tipos distintos de ActionForms</p>
<ul>
  
<li>Clases descendientes de la clase base <strong>ActionForm</strong>. Deben incorporar m&eacute;todos Java para obtener/cambiar cada uno de los datos (al estilo JavaBeans), cuya definici&oacute;n puede resultar tediosa. Desde Struts 1.1 las propiedades se pueden almacenar en un Map, con lo que solo es necesario definir un &uacute;nico m&eacute;todo para acceso a todas las propiedades, pasando como par&aacute;metro el nombre de la deseada.</li>
  
<li>Instancias de la clase <strong>DynaActionForm</strong> o descendientes de &eacute;sta. Permiten definir los campos en el fichero <span class="codefrag">struts-config.xml</span>, de manera que se pueden a&ntilde;adir o modificar campos minimizando la necesidad de recompilar c&oacute;digo. Mediante la clase <strong>DynaValidatorForm</strong> se puede incluso validar datos de manera autom&aacute;tica, seg&uacute;n las reglas especificadas en un fichero de configuraci&oacute;n aparte.</li>

</ul>
<a name="N10055"></a><a name="El+ciclo+de+vida+de+un+ActionForm"></a>
<h3 class="underlined_5">El ciclo de vida de un ActionForm</h3>
<p>La generaci&oacute;n y procesamiento de un ActionForm pasa por varias etapas:</p>
<ol>
  
<li>El controlador recibe la petici&oacute;n del usuario, y chequea si la acci&oacute;n asociada utiliza un ActionForm. De ser as&iacute;, crea el objeto</li>
  
<li>Se llama al m&eacute;todo <span class="codefrag">reset()</span> del objeto, que el desarrollador puede sobreescribir para "limpiar" sus campos. Esto tiene sentido si el ActionForm persiste m&aacute;s all&aacute; de la petici&oacute;n actual (lo cual se puede especificar al definirlo).</li>
  
<li>El ActionForm se almacena en el &aacute;mbito especificado en su definici&oacute;n (petici&oacute;n, sesi&oacute;n o aplicaci&oacute;n)</li>
  
<li>Los datos del ActionForm se rellenan con los que contiene la petici&oacute;n HTTP. Cada par&aacute;metro HTTP se asocia con el dato del mismo nombre del ActionForm. Un punto importante es que en HTTP los par&aacute;metros son cadenas, con lo que en principio las propiedades del ActionForm deben ser Strings, aunque los valores booleanos se convierten a boolean. No obstante, m&aacute;s all&aacute; de esta conversi&oacute;n b&aacute;sica no hay conversi&oacute;n autom&aacute;tica de tipos.</li>
  
<li>Se validan los datos, llamando al m&eacute;todo <span class="codefrag">validate()</span>, que el desarrollador debe sobreescribir para implementar la validaci&oacute;n deseada.</li>
  
<li>Si se han producido errores de validaci&oacute;n, se efect&uacute;a una redirecci&oacute;n a la p&aacute;gina especificada para este caso. Si no, se llama al <span class="codefrag">execute()</span> de la acci&oacute;n y finalmente se muestra la vista asociada a esta.</li>
  
<li>Si en la vista se utilizan las <em>taglibs</em> de Struts para mostrar datos, aparecer&aacute;n los datos del ActionForm.</li>

</ol>
<a name="N10083"></a><a name="Declarar+un+ActionForm+%28en+el+fichero+de+configuraci%C3%B3n%29"></a>
<h3 class="underlined_5">Declarar un ActionForm (en el fichero de configuraci&oacute;n)</h3>
<p>Los ActionForm se definen dentro del fichero <span class="codefrag">struts-config.xml</span>, dentro de la secci&oacute;n <span class="codefrag">&lt;form-beans&gt;</span>. Cada ActionForm viene definido por un elemento <span class="codefrag">&lt;form-bean&gt;</span>. Por ejemplo, para definir un ActionForm con el nombre <span class="codefrag">FormLogin</span> y asociado a la clase Java <span class="codefrag">acciones.forms.FormLogin</span> har&iacute;amos:</p>
<pre class="code">
&lt;form-beans&gt;
   &lt;form-bean name="FormLogin" type="acciones.forms.FormLogin"&gt;
&lt;/form-beans&gt;
</pre>
<p>Para que los datos de un <span class="codefrag">ActionForm</span> sean accesibles a una acci&oacute;n, hay que definir una serie de atributos dentro del elemento <span class="codefrag">action</span> de <span class="codefrag">struts-config.xml</span>. Por ejemplo, para asociar un <span class="codefrag">ActionForm</span> de la clase <span class="codefrag">FormLogin</span> a la acci&oacute;n <span class="codefrag">login</span> de los ejemplos anteriores, se podr&iacute;a hacer:</p>
<pre class="code">
&lt;action path="/login" type="acciones.AccionLogin" 
<strong>        name="FormLogin" scope="session"
        validate="true" input="/index.jsp"&gt;</strong>
   &lt;forward name="OK" path="/personal.jsp"/&gt;
   &lt;forward name="errorUsuario" path="/error.html"/&gt;
&lt;/action&gt;
</pre>
<p>El atributo <span class="codefrag">name</span> indica el nombre simb&oacute;lico para el <span class="codefrag">ActionForm</span>. El <span class="codefrag">scope</span> tiene el mismo significado que cuando tratamos con JavaBeans. En caso de que se desee validar los datos, hay que especificar el atributo <span class="codefrag">validate=true</span> y utilizar el atributo <span class="codefrag">input</span> para designar la p&aacute;gina a la que se
volver&aacute; si se han producido errores de validaci&oacute;n.</p>
<a name="N100CE"></a><a name="Declarar+la+clase+java+del+ActionForm"></a>
<h3 class="underlined_5">Declarar la clase java del ActionForm</h3>
<p>Esta tarea es muy similar a definir un JavaBean. Hay que especificar m&eacute;todos get/set para cada campo, y colocar la l&oacute;gica de validaci&oacute;n en el m&eacute;todo <span class="codefrag">validate()</span>. Por ejemplo:</p>
<pre class="code">
package acciones.formularios;
import org.apache.struts.action.*;
import javax.servlet.http.HttpServletRequest;

public class FormLogin extends ActionForm {
   private String login;
   private String password;
   
   public void setLogin(String login) {
      this.login = login; 
   }
   public String getLogin() {
      return login;
   }
   
   public ActionErrors validate(ActionMapping mapping,
                                HttpServletRequest request) {
      if ((getlogin()==null)||(getLogin.equals("")))
         errores.add(ActionErrors.GLOBAL_ERROR
                     , new ActionError("error.requerido.usuario"));
      return errores; 
   }
}
</pre>
<p>El m&eacute;todo <span class="codefrag">validate()</span> debe devolver una colecci&oacute;n de errores (o null), representada por el objeto
<strong>ActionErrors</strong>.</p>
<p>Desde la versi&oacute;n 1.1 de Struts, se pueden utilizar ActionForms que almacenen internamente las propiedades en un objeto
Map. Para el acceso a/modificaci&oacute;n de cualquier propiedad solo ser&aacute; necesario implementar dos m&eacute;todos</p>
<pre class="code">
public void setValue(String clave, Object valor)
public Object getValue(String clave)
</pre>
<p>En formularios con muchos campos, resultar&aacute; tedioso definir m&eacute;todos <em>get/set</em> para cada uno de ellos. En su lugar, podemos utilizar <span class="codefrag">DynaActionForms</span>, en los que los campos se definen en el fichero de configuraci&oacute;n de Struts.
Por ejemplo:</p>
<pre class="code">
 &lt;form-bean name="FormLogin" type="org.apache.struts.action.DynaActionForm"&gt;
   &lt;form-property name="login" type="java.lang.String"/&gt;
   &lt;form-property name="password" type="java.lang.String"/&gt;
 &lt;/form-bean&gt;
</pre>
<p>Como se ve, en este caso la clase del ActionForm no la definimos nosotros sino que es propia de Struts. Para acceder a los campos del <span class="codefrag">DynaActionForm</span> esta clase define un m&eacute;todo gen&eacute;rico <strong>get</strong> al
que se pasa como par&aacute;metro el nombre del campo. Algo similar ocurre para cambiar el valor de un campo (m&eacute;todo <strong>set</strong>).</p>
<p>Si deseamos validar un <span class="codefrag">DynaActionForm</span>, tendremos que utilizar una clase propia que herede de &eacute;sta, y sobreescribir su m&eacute;todo <span class="codefrag">validate()</span>, o mejor a&uacute;n, podemos validar datos autom&aacute;ticamente utilizando el m&oacute;dulo de Struts denominado <strong>validator</strong>. No obstante el uso de validator queda fuera del &aacute;mbito de este tema, por lo que se aconseja la consulta de la documentaci&oacute;n de Struts o de alg&uacute;n libro de la bibliograf&iacute;a sobre el tema.</p>
</div>

<a name="N10115"></a><a name="Las+librer%C3%ADas+de+etiquetas+de+Struts"></a>
<h2 class="underlined_10">Las librer&iacute;as de etiquetas de Struts</h2>
<div class="section">
<p>Una vez se ha ejecutado la l&oacute;gica de negocio y el controlador ha pasado el control a la vista que corresponda, &eacute;sta debe mostrar los resultados de la acci&oacute;n. Si dichos resultados se han colocado en <em>beans</em>, ser&aacute; sencillo mostrarlos en la p&aacute;gina utilizando las etiquetas est&aacute;ndar de <span class="codefrag">&lt;jsp:useBean/&gt;</span> o las librer&iacute;as de etiquetas propias de Struts. Estas etiquetas est&aacute;n especialmente dise&ntilde;adas para trabajar con ActionForms, aunque pueden funcionar con cualquier <em>bean</em>. De este modo, se pueden mostrar los resultados de la acci&oacute;n en forma de texto o bien en forma de campo de formulario, para que el usuario pueda realizar modificaciones y el "ciclo de vida" del ActionForm comience de nuevo (los datos del ActionForm se rellenan con la petici&oacute;n HTTP, se validan, los procesa la acci&oacute;n...).</p>
<p>Struts viene con varias taglibs distintas, las principales son:</p>
<ul>
   
<li>beans: acceso a JavaBeans y sus propiedades, y definici&oacute;n de nuevos beans</li>
   
<li>html: para crear formularios y controles de formulario vinculados a ActionForms.</li>
   
<li>logic: control de flujo, condicionales y repetici&oacute;n</li>

</ul>
<p>La mayor parte de etiquetas propias de Struts han quedado obsoletas con la aparici&oacute;n de JSTL, por lo que nos centraremos en las dise&ntilde;adas para formularios, que no tienen equivalente en JSTL.</p>
<a name="N10139"></a><a name="Las+etiquetas+para+formularios"></a>
<h3 class="underlined_5">Las etiquetas para formularios</h3>
<p>Un grupo fundamental de etiquetas es el dedicado a controles de formulario, ya que a trav&eacute;s de ellos se muestra el contenido de los ActionForms y puede modificarse. Aunque estas etiquetas est&aacute;n dise&ntilde;adas expresamente para ActionForms pueden asociarse a cualquier bean. As&iacute;, estas etiquetas son similares a los componentes GUI que veremos que tiene JavaServer Faces, aunque no llegan a un nivel tan alto de sofisticaci&oacute;n. La siguiente tabla muestra algunas de estas etiquetas</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">

<tr>

<td colspan="1" rowspan="1">
<strong>Etiqueta Struts</strong>
</td>
<td colspan="1" rowspan="1">
<strong>Equivalente HTML</strong>
</td>
<td colspan="1" rowspan="1">
<strong>Uso</strong>
</td>

</tr>

<tr>

<td colspan="1" rowspan="1"><span class="codefrag">&lt;html:form&gt;</span></td>
<td colspan="1" rowspan="1"><span class="codefrag">&lt;form&gt;</span></td>
<td colspan="1" rowspan="1">Se pueden especificar atributos <span class="codefrag">name</span>,
<span class="codefrag">type</span> y <span class="codefrag">scope</span> para indicar el nombre,
clase y &aacute;mbito del bean del que se tomar&aacute;n los datos.
Si no se especifica nada, dichas propiedades se toman del
<span class="codefrag">action-mappings</span> en <span class="codefrag">struts-config.xml</span></td>

</tr>

<tr>

<td colspan="1" rowspan="1"><span class="codefrag">&lt;html:text/&gt;</span></td>
<td colspan="1" rowspan="1"><span class="codefrag">&lt;input type="text"&gt;</span></td>
<td colspan="1" rowspan="1">

<p>el atributo <span class="codefrag">property</span> especifica la propiedad del
<span class="codefrag">actionForm</span> a vincular. Con <span class="codefrag">name</span> se puede
especificar de qu&eacute; bean procede el dato</p>

</td>

</tr>

<tr>

<td colspan="1" rowspan="1"><span class="codefrag">&lt;html:radio/&gt;</span></td>
<td colspan="1" rowspan="1"><span class="codefrag">&lt;input type="radio"&gt;</span></td>
<td colspan="1" rowspan="1">

<p>
<span class="codefrag">property</span> idem al anterior. El atributo
<span class="codefrag">value</span> se compara con el valor de la propiedad del bean
para que el bot&oacute;n aparezca marcado o no</p>

<span class="codefrag">
&lt;html:radio property="estado" value="casado"/&gt;
</span></td>

</tr>

<tr>

<td colspan="1" rowspan="1"><span class="codefrag">&lt;html:checkbox/&gt;</span></td>
<td colspan="1" rowspan="1"><span class="codefrag">&lt;input type="radio"&gt;</span></td>
<td colspan="1" rowspan="1"><span class="codefrag">property</span> idem al anterior. El atributo
<span class="codefrag">value</span> se compara con el valor de la propiedad del bean
para que la casilla aparezca marcada o no</td>

</tr>

<tr>

<td colspan="1" rowspan="1"><span class="codefrag">&lt;html:password/&gt;</span></td>
<td colspan="1" rowspan="1"><span class="codefrag">&lt;input type="password"/&gt;</span></td>
<td colspan="1" rowspan="1">

<p>idem con <span class="codefrag">property</span>. El atributo
<span class="codefrag">redisplay</span> se utiliza para que el valor del campo no se
vuelva a rellenar.</p>

<span class="codefrag">
&lt;html:password property="password"
 redisplay="false"/&gt;
</span></td>

</tr>

<tr>

<td colspan="1" rowspan="1"><span class="codefrag">&lt;html:select/&gt;</span> y
<span class="codefrag">&lt;html:options/&gt;</span></td>
<td colspan="1" rowspan="1"><span class="codefrag">&lt;select&gt;</span> y grupo de
<span class="codefrag">&lt;option&gt;</span></td>
<td colspan="1" rowspan="1">

<p>idem con <span class="codefrag">property</span> para
<span class="codefrag">&lt;html:select/&gt;</span>. En el caso de
<span class="codefrag">&lt;html:options&gt;</span> puede ser una
<span class="codefrag">Collection</span>.</p>

<span class="codefrag">
&lt;html:select property="estadoCivil"&gt;
   &lt;html:options property="listaEstados"/&gt; 
&lt;/html:select&gt;
</span></td>

</tr>

</table>
<p>Para poder usar alguna de estas etiquetas en una p&aacute;gina JSP es necesario importar la <em>taglib</em> de HTML de Struts. Al principio de la p&aacute;gina habr&aacute; que poner:
</p>
<pre class="code">
   &lt;%@taglib uri="http://jakarta.apache.org/struts/tags-html" prefix="html" %&gt;
</pre>
<a name="N1022E"></a><a name="Mostrar+los+errores"></a>
<h3 class="underlined_5">Mostrar los errores</h3>
<p>La forma m&aacute;s sencilla de mostrar los errores generados durante el procesamiento de una acci&oacute;n es utilizar la etiqueta <span class="codefrag">&lt;html:errors/&gt;</span>. Esta etiqueta muestra los errores en el formato por defecto (letra con color rojo).</p>
<p>Si se desea mostrar &uacute;nicamente los errores asociados a una propiedad de un bean, entonces hay que a&ntilde;adir el atributo <span class="codefrag">property</span>
</p>
<pre class="code">
&lt;html:form&gt;
   &lt;html:text property="login"/&gt; &lt;html:errors property="login"/&gt;
   ...
&lt;/html:form&gt;
</pre>
<p>Para que esto funcione, la acci&oacute;n que ha generado el error debe haberlo a&ntilde;adido a la lista de errores asoci&aacute;ndolo a dicha propiedad:</p>
<pre class="code">
errors.add("login", new ActionError("error.requerido", "nombre de usuario"));
</pre>
</div>

<p class="pageBreakAfter"> 
</p>


</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
