<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Introducci&oacute;n a MVC y a Struts </title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Struts y JSF" src="images/baner_j2ee_der.gif" title="Struts y JSF"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Struts y JSF</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">JSF y Struts</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="JSF y Struts">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-jsf-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-jsf-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="roadmap-jsf.html">Roadmap JSF</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 3</div>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 4</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-jsf-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-jsf-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 4</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion01-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Introducci&oacute;n a MVC y a Struts </h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Arquitecturas+para+aplicaciones+web.+Modelo-Vista-Controlador">Arquitecturas para aplicaciones web. Modelo-Vista-Controlador</a>
<ul class="minitoc">
<li>
<a href="#Modelo+de+capas+en+una+aplicaci%C3%B3n+web">Modelo de capas en una aplicaci&oacute;n web</a>
</li>
<li>
<a href="#La+arquitectura+Modelo-Vista-Controlador">La arquitectura Modelo-Vista-Controlador</a>
</li>
</ul>
</li>
<li>
<a href="#MVC+en+Struts"> MVC en Struts</a>
</li>
<li>
<a href="#El+controlador+de+Struts">El controlador de Struts</a>
</li>
<li>
<a href="#Acciones+en+Struts">Acciones en Struts</a>
<ul class="minitoc">
<li>
<a href="#Asociar+el+controlador+a+las+acciones">Asociar el controlador a las acciones</a>
</li>
<li>
<a href="#Implementar+las+acciones">Implementar las acciones</a>
</li>
<li>
<a href="#Acciones+por+defecto">Acciones por defecto</a>
</li>
<li>
<a href="#Tratamiento+de+errores+en+las+acciones">Tratamiento de errores en las acciones</a>
</li>
</ul>
</li>
<li>
<a href="#Seguridad">Seguridad</a>
</li>
</ul>
</div>

<p>Hasta el momento hemos visto varios elementos y tecnolog&iacute;as que pueden combinarse para desarrollar una
aplicaci&oacute;n web: servlets, p&aacute;ginas JSP, JavaBeans, clases java convencionales... El objetivo de este tema es
proponer una arquitectura para nuestras aplicaciones que combine todos estos elementos de manera modular.</p>


<a name="N1000F"></a><a name="Arquitecturas+para+aplicaciones+web.+Modelo-Vista-Controlador"></a>
<h2 class="underlined_10">Arquitecturas para aplicaciones web. Modelo-Vista-Controlador</h2>
<div class="section">
<a name="N10015"></a><a name="Modelo+de+capas+en+una+aplicaci%C3%B3n+web"></a>
<h3 class="underlined_5">Modelo de capas en una aplicaci&oacute;n web</h3>
<p>El c&oacute;digo de una aplicaci&oacute;n web t&iacute;pica puede dividirse en varios m&oacute;dulos o <strong>capas</strong> bien diferenciados. Por ejemplo pensemos en una tienda web en la que un usuario hace un pedido con los productos que actualmente tiene en el carro. Parte del c&oacute;digo que procese este caso de uso se encargar&aacute; de la interfaz de usuario (o <strong>presentaci&oacute;n</strong>): mostrar el contenido del carro, permitir la introducci&oacute;n de la direcci&oacute;n de entrega y el medio de pago,... Otra parte se encargar&aacute; de realizar el pedido en s&iacute; (o <strong>"l&oacute;gica de negocio"</strong>): chequear que el producto est&aacute; en <em>stock</em>, calcular el n&ordm; de d&iacute;as estimados para la entrega, comunicar con la aplicaci&oacute;n de gesti&oacute;n de almac&eacute;n para poner el pedido en cola,... Finalmente, todas estas operaciones tienen que registrarse de modo permanente, t&iacute;picamente en una base de datos relacional (<strong>acceso a datos</strong>).</p>
<p>Evidentemente es conveniente separar en distintos m&oacute;dulos el c&oacute;digo que implemente las operaciones de presentaci&oacute;n, l&oacute;gica de negocio y acceso a datos. As&iacute; se consigue una mayor modularidad y mantenibilidad, facilitando los cambios y las pruebas aisladas en
cada m&oacute;dulo. Esto nos lleva a la idea de la divisi&oacute;n de las aplicaciones web en tres capas:</p>
<ul>

<li>
<strong>Presentaci&oacute;n:</strong> encapsula toda la
l&oacute;gica necesaria para presentar los datos en los clientes.
Recibe las peticiones de estos y env&iacute;a las respuestas. En
esta capa se utilizan tecnolog&iacute;as como los <em>servlets</em>
y las <em>p&aacute;ginas JSP</em>.</li>

<li>
<strong>Negocio:</strong> implementa los procesos que
constituyen el n&uacute;cleo de la aplicaci&oacute;n. En la capa de
negocio se emplean tecnolog&iacute;as como los <em>JavaBeans</em>, y en aplicaciones de tipo <em>enterprise</em> los <em>EJBs</em>.</li>

<li>
<strong>Integraci&oacute;n o Acceso a datos:</strong> permite
la comunicaci&oacute;n con los sistemas donde se almacenan los
datos. T&iacute;picamente emplea <em>JDBC</em> para acceso a bases
de datos o <em>JMS</em> y <em>conectores J2EE</em> para acceder a
sistemas no-java.</li>

</ul>
<p>Al hablar de capas en lugar de m&oacute;dulos se hace hincapi&eacute; en un principio b&aacute;sico que consiste en que cada capa se comunica
&uacute;nicamente con la que tiene inmediatamente arriba y abajo para reducir dependencias, y que el interfaz de comunicaci&oacute;n entre capas
debe aislar en lo posible del funcionamiento interno de las mismas.</p>
<a name="N1005E"></a><a name="La+arquitectura+Modelo-Vista-Controlador"></a>
<h3 class="underlined_5">La arquitectura Modelo-Vista-Controlador</h3>
<p>Las especificaciones de JSP hablan de dos enfoques distintos a la hora de construir aplicaciones con esta tecnolog&iacute;a: los
denominados <strong>modelo 1</strong> y <strong>modelo 2</strong>. En los dos enfoques se considera que la implementaci&oacute;n de la l&oacute;gica de negocio y el acceso a las fuentes de datos debe "sacarse fuera" de las p&aacute;ginas JSP y residir en <em>JavaBeans</em>.
No obstante, ambos enfoques difieren en qui&eacute;n lleva a cabo el procesamiento de la petici&oacute;n HTTP: en el modelo 1 lo
realizan los propios JSPs, mientras que en el modelo 2 hacen esta tarea los servlets. En la siguiente figura se muestra un esquema
de un sistema que utiliza la arquitectura modelo 1.</p>
<p>

<img alt="modelo 1" content-width="10cm" height="242" src="imagenes/modelo1.gif" width="497">
</p>
<p>El modelo 1 es apropiado solo para aplicaciones web peque&ntilde;as. Las p&aacute;ginas JSP deben ocuparse tanto de la presentaci&oacute;n como de la navegaci&oacute;n (en base a la petici&oacute;n HTTP decidir qu&eacute; operaci&oacute;n de l&oacute;gica de negocio hay que ejecutar y cu&aacute;l es el interfaz de usuario a mostrar). Esto hace que las aplicaciones grandes sean  dif&iacute;ciles de mantener.</p>
<p>El modelo 2 va un paso m&aacute;s all&aacute; y separa las responsabilidades de
control de las operaciones a ejecutar,implementaci&oacute;n de las mismas y
presentaci&oacute;n de resultados. En la siguiente figura se muestra un
esquema.</p>
<p>

<img alt="modelo 2 (MVC)" content-width="10cm" height="234" src="imagenes/modelo2.gif" width="512">
</p>
<p>En este modelo los servlets son los responsables de decidir, en
base a la petici&oacute;n HTTP, a qu&eacute; <em>beans</em> llamar, y las p&aacute;ginas
JSP se limitan a la presentaci&oacute;n de los datos obtenidos a trav&eacute;s de
dichos <em>beans</em>. Esto elimina gran parte del c&oacute;digo Java de las
p&aacute;ginas JSP, lo que permite que se puedan dividir las tareas: los
programadores Java implementan los servlets, mientras que los
desarrolladores web se ocupan de los JSP, que tienen un m&iacute;nimo de
c&oacute;digo Java o incluso ninguno si se utilizan <em>beans</em> y
<em>taglibs</em> propias o JSTL</p>
<p>El modelo 2 es un ejemplo de lo que se denomina gen&eacute;ricamente
<strong>arquitectura MVC</strong> (Modelo-Vista-Controlador). Esta
arquitectura es originaria del lenguaje Smalltalk en los a&ntilde;os 80 y se
ha usado en muchos sistemas y lenguajes desde entonces. </p>
<p>Los componentes de una arquitectura MVC son:</p>
<ul>

<li>
<strong>Modelo</strong>: tiene dos partes</li>

<li>

<ul>

<li>
<strong>Estado</strong>: o sea, los datos. Los implementaremos mediante
<em>beans</em>.</li>

<li>
<strong>Acciones</strong>: disparan la "l&oacute;gica de negocio". Se
suele utilizar una acci&oacute;n distinta por cada caso de uso de
nuestra aplicaci&oacute;n. En nuestro caso, para implementar las
acciones y la l&oacute;gica que hay tras ellas usaremos
<em>beans</em> y clases Java auxiliares.</li>

</ul>

</li>

<li>
<strong>Vista</strong>: es el interfaz de usuario, que muestra los datos
del modelo. Para implementar las vistas, utilizaremos JSPs.</li>

<li>
<strong>Controlador</strong>: recibe las peticiones del usuario,
desencadena las acciones adecuadas en el modelo y muestra la vista
correspondiente. Nuestro controlador se implementar&aacute;
mediante un servlet.</li>

</ul>
<p>Veremos con mucho m&aacute;s detalle la interacci&oacute;n entre todos estos
componentes cuando hablemos de Struts.</p>
<p>En la descripci&oacute;n anterior de MVC el controlador es el que dispara
la l&oacute;gica de negocio a trav&eacute;s de las acciones. Cabr&iacute;a otra posibilidad
y es que el controlador despachara directamente a la vista apropiada y
fuera la vista la que disparara la l&oacute;gica de negocio. Para casos en
los que dicha l&oacute;gica sea sencilla, este tambi&eacute;n puede ser un modelo
apropiado, si el c&oacute;digo Java se encapsula en <em>taglibs</em>
propias.</p>
<p>Como ya se ha comentado, MVC no s&oacute;lo se usa en la web. Sin ir m&aacute;s
lejos, la librer&iacute;a <strong>Swing</strong> de Java es un ejemplo de
este enfoque.No obstante, Swing es un ejemplo de MVC mucho m&aacute;s "fino",
ya que cualquier evento sobre la vista puede causar el disparo del
controlador para realizar una acci&oacute;n (por ejemplo, marcar una casilla
de verificaci&oacute;n). En aplicaciones web, la mayor&iacute;a de acciones sobre el
interfaz de usuario no causan una nueva petici&oacute;n HTTP, con lo que los
"eventos" son de "grano m&aacute;s grueso" que en una aplicaci&oacute;n
tradicional. La especificaci&oacute;n de <strong>JavaServer Faces</strong>,
que veremos en los temas 3 y 4, es un intento de (entre otras cosas)
extender este modelo de "grano fino" a las aplicaciones web.</p>
</div>


<a name="N100DE"></a><a name="MVC+en+Struts"></a>
<h2 class="underlined_10"> MVC en Struts</h2>
<div class="section">
<p>Struts es un <em>framework</em> para construir aplicaciones web Java basadas en la filosof&iacute;a MVC. Aunque existen muchos frameworks MVC para desarrollo de aplicaciones J2EE, Struts es el m&aacute;s extendido, hasta el punto de convertirse en un est&aacute;ndar "de facto" en el mundo J2EE. En los &uacute;ltimos tiempos se empieza a extender un <em>framework</em> para desarrollo de interfaces web basados en componentes denominado JavaServer Faces (JSF). Este se solapa en algunos aspectos con Struts, ya que tambi&eacute;n implementa MVC (aunque de modo distinto). No obstante, aunque JSF tiene las "bendiciones" de Sun y de gran parte de la industria (lo cual indica que podr&iacute;a convertirse en el <em>framework</em> predominante en algunos a&ntilde;os) por el momento Struts mantiene su presencia, con gran cantidad de entornos de desarrollo y herramientas que lo soportan.</p>
<p>Struts implementa de la siguiente forma cada uno de los
componentes de la arquitectura MVC:</p>
<ul>

<li>El <strong>controlador</strong> es un servlet, de una clase proporcionada por Struts. Ser&aacute; necesario configurar la aplicaci&oacute;n web (a trav&eacute;s del fichero <span class="codefrag">web.xml</span>) para que las peticiones del usuario se redirijan siempre al servlet.</li>

<li>El controlador despacha las peticiones del usuario a la clase adecuada para ejecutar la <strong>acci&oacute;n</strong>. En
struts, las clases que ejecuten las acciones deben <em>heredar de la clase <strong>Action</strong></em>.</li>

<li>La <strong>vista</strong> se implementar&aacute; normalmente mediante p&aacute;ginas JSP. Struts ofrece dos herramientas para
ayudar en la presentaci&oacute;n de datos: los <strong>ActionForm</strong>s son clases que capturan los datos
introducidos en formularios y permiten su validaci&oacute;n. Las <strong>librer&iacute;as de etiquetas</strong> permiten mostrar
errores y facilitar el trabajo con formularios.</li>

<li>La implementaci&oacute;n del <strong>modelo</strong> corre enteramente a cargo del desarrollador, ya que es propio de la capa
de negocio y no est&aacute; dentro del &aacute;mbito de Struts.</li>

</ul>
<p>En este primer tema de los dos dedicados a MVC y Struts trataremos la parte del controlador y las acciones. En el tema 2 trataremos de la vista.</p>
<p>El ciclo que se sigue cuando Struts procesa una petici&oacute;n
	HTTP aparece en la siguiente figura	</p>
<p>

<img alt="El ciclo de proceso de MVC en Struts" content-width="10cm" height="207" src="imagenes/struts.gif" width="496">
</p>
<ol>
	
<li>El cliente realiza la <strong>petici&oacute;n</strong>, que recibe el controlador de Struts. Todas las peticiones pasan por &eacute;l, ya que la petici&oacute;n no es una URL f&iacute;sica (no es un servlet o un JSP) sino que es un nombre simb&oacute;lico para una <strong>acci&oacute;n</strong>.</li>
	
<li>El controlador <strong>despacha la petici&oacute;n</strong>,	identificando la acci&oacute;n y disparando la l&oacute;gica de negocio apropiada.</li>
	
<li>La l&oacute;gica de negocio <strong>actualiza el modelo</strong> y obtiene datos del mismo, almacen&aacute;ndolos en beans.</li>
	
<li>En funci&oacute;n del valor devuelto por la l&oacute;gica de negocio, el controlador elige la <strong>siguiente vista</strong> a mostrar.</li>
	
<li>
<strong>La vista toma los datos</strong> obtenidos por la l&oacute;gica de negocio.</li>
	
<li>
<strong>La vista muestra los datos</strong> en el cliente</li>

</ol>
</div>


<a name="N10155"></a><a name="El+controlador+de+Struts"></a>
<h2 class="underlined_10">El controlador de Struts</h2>
<div class="section">
<p>La instalaci&oacute;n de Struts es sencilla. Basta con colocar en la carpeta <span class="codefrag">WEB-INF/lib</span> de nuestra aplicaci&oacute;n web las librer&iacute;as (ficheros .jar) que vienen con la distribuci&oacute;n est&aacute;ndar de Struts. Si utilizamos alguna de las etiquetas propias de Struts (ver tema 2), necesitaremos incluir tambi&eacute;n el correspondiente descriptor (fichero .tld).</p>
<p>Como se ha comentado, el controlador en Struts es un servlet que recibe las peticiones del usuario y las redirige a las clases Java que las van a tratar. Salvo que tengamos necesidades muy especiales, podemos usar como controlador directamente la clase <span class="codefrag">org.apache.struts.action.ActionServlet</span>, que ya viene implementada en la distribuci&oacute;n de Struts. Para que todas las peticiones del usuario se redirijan a este servlet habr&aacute; que modificar el fichero <strong>web.xml</strong>, como en el
siguiente ejemplo</p>
<pre class="code">

<strong>&lt;!-- servlet que hace de controlador --&gt;</strong>
 &lt;servlet&gt;
 &lt;servlet-name&gt;controlador&lt;/servlet-name&gt;
 &lt;servlet-class&gt;org.apache.struts.action.ActionServlet&lt;/servlet-class&gt;
 &lt;/servlet&gt;
 <strong>&lt;!-- redirigir ciertas peticiones al controlador --&gt;</strong>
 &lt;servlet-mapping&gt;
 &lt;servlet-name&gt;controlador&lt;/servlet-name&gt;
 &lt;url-pattern&gt;*.do&lt;/url-pattern&gt;
 &lt;/servlet-mapping&gt;
</pre>
<p>En el ejemplo anterior, todas las peticiones que sigan el patr&oacute;n <span class="codefrag">*.do</span> se redirigir&aacute;n al controlador de Struts. Por ejemplo la petici&oacute;n <span class="codefrag">login.do</span> ser&aacute; capturada por Struts y redirigida a la acci&oacute;n de nombre <span class="codefrag">login</span>.</p>
</div>



<a name="N10181"></a><a name="Acciones+en+Struts"></a>
<h2 class="underlined_10">Acciones en Struts</h2>
<div class="section">
<p>Las acciones son clases Java, uno de cuyos m&eacute;todos se ejecutar&aacute; en respuesta a una petici&oacute;n HTTP del cliente. Hay que asociar las peticiones con las acciones que disparar&aacute;n e implementar la l&oacute;gica de negocio dentro de las acciones.</p>
<a name="N1018A"></a><a name="Asociar+el+controlador+a+las+acciones"></a>
<h3 class="underlined_5">Asociar el controlador a las acciones</h3>
<p>Una vez el controlador recibe la petici&oacute;n debe despacharla a las clases Java que implementan la l&oacute;gica de negocio.La asociaci&oacute;n entre el nombre simb&oacute;lico de la acci&oacute;n y la clase Java que la procesa se realiza en el fichero de configuraci&oacute;n <span class="codefrag">struts-config.xml</span> (que se colocar&aacute; en <span class="codefrag">/WEB-INF</span>). A lo largo de estos dos temas iremos viendo los
distintos elementos de este fichero de configuraci&oacute;n.</p>
<p>El mapeado entre acciones y clases se realiza dentro del elemento <span class="codefrag">&lt;action-mappings&gt;</span> y cada uno de ellos
constituye un <span class="codefrag">&lt;action&gt;</span>. Por ejemplo, supongamos que la encargada de procesar la acci&oacute;n <span class="codefrag">login</span> en el ejemplo anterior es nuestra clase Java <span class="codefrag">acciones.AccionLogin</span>. El fichero <span class="codefrag">struts-config.xml</span> quedar&iacute;a:</p>
<pre class="code">
&lt;?xml version = "1.0" encoding = "ISO-8859-1"?&gt;
&lt;!DOCTYPE struts-config PUBLIC "-//Apache Software Foundation//DTD Struts
 Configuration 1.1//EN" "http://jakarta.apache.org/struts/dtds/struts-config_1_1.dtd"&gt;
&lt;struts-config&gt;
&lt;!--definici&oacute;n de otros elementos del fichero de configuraci&oacute;n --&gt;
   ...
   ...
&lt;!--definici&oacute;n de acciones --&gt;
&lt;action-mappings&gt;
   &lt;!-- hacer login --&gt;
   <strong>&lt;action path="/login" type="acciones.AccionLogin"&gt;
       &lt;forward name="OK" path="/personal.jsp"/&gt;
       &lt;forward name="errorUsuario" path="/error.html"/&gt;
   &lt;/action&gt;</strong>
   &lt;!-- definici&oacute;n de otras acciones --&gt;
   ...
&lt;/action-mappings&gt;
&lt;/struts-config&gt;
</pre>
<p>Como se ve en el ejemplo, los atributos b&aacute;sicos de un <span class="codefrag">action</span> son su <span class="codefrag">path</span> (la URL que la
identifica, sin el elemento com&uacute;n a todas las acciones - en nuestro caso sin el <span class="codefrag">.do</span> -) y la clase Java que la
procesa (<span class="codefrag">type</span>). As&iacute;, cuando el cliente haga una petici&oacute;n <span class="codefrag">login.do</span> la acci&oacute;n ejecutada ser&aacute; una instancia de la clase <span class="codefrag">acciones.AccionLogin</span>.</p>
<p>Una vez terminada la l&oacute;gica de negocio, el controlador debe elegir la siguiente
vista a mostrar. Esto se hace en funci&oacute;n del resultado devuelto por la acci&oacute;n. Una acci&oacute;n ejecutada puede tener diversos resultados (por ejemplo, un login puede ser correcto o no, dependiendo de la contrase&ntilde;a). Cada uno de ellos se especifica mediante un elemento <span class="codefrag">&lt;forward&gt;</span>, en el que se define un nombre simb&oacute;lico para el resultado de la acci&oacute;n (<span class="codefrag">name</span>) y la URL de la p&aacute;gina que contiene la vista asociada (<span class="codefrag">path</span>).</p>
<a name="N101D4"></a><a name="Implementar+las+acciones"></a>
<h3 class="underlined_5">Implementar las acciones</h3>
<p>Las clases encargadas de ejecutar las acciones deben descender de la clase abstracta <span class="codefrag">org.apache.struts.action.Action</span>,proporcionada por Struts. Cuando se ejecuta una acci&oacute;n lo que hace Struts es llamar a su m&eacute;todo <span class="codefrag">execute</span>, que debemos sobreescribir para que realice la tarea deseada. Por ejemplo, para el caso de la acci&oacute;n login:</p>
<pre class="code">
package acciones;
import javax.servlet.http.*;
import org.apache.struts.action.*;
public class AccionLogin <strong>extends Action</strong> 
   <strong>public ActionForward execute(ActionMapping mapping,
	                ActionForm form,
			HttpServletRequest request,
			HttpServletResponse response) 
			throws Exception {</strong>
	boolean usuarioOK;
	//obtener login y password y autentificar al usuario
	//si es correcto, poner usuarioOK a 'true'
	...
	//dirigirnos a la vista adecuada seg&uacute;n el resultado
	if (usuarioOK)
	   return <strong>mapping.findForward("OK")</strong>;
	else
	   return <strong>mapping.findForward("errorUsuario")</strong>;
   }
}
</pre>
<p>Hay que destacar varias cosas del c&oacute;digo de la
	acci&oacute;n:</p>
<ul>
	
<li>Como se ha dicho, una acci&oacute;n debe heredar de la clase <strong>Action</strong>
</li>
	
<li>El m&eacute;todo <span class="codefrag">execute</span> recibe como <strong>par&aacute;metros</strong> la petici&oacute;n y la respuesta HTTP, lo que nos permite interactuar con ellas. No obstante, tambi&eacute;n tenemos accesibles los datos incluidos en la petici&oacute;n (normalmente a trav&eacute;s de formularios) mediante el objeto <span class="codefrag">ActionForm</span>, si es que hemos asociado un objeto de esta clase a la acci&oacute;n. El uso de <span class="codefrag">ActionForm</span> lo trataremos en el tema 2.</li>
	
<li>El m&eacute;todo execute debe <strong>devolver</strong> un objeto de la clase <span class="codefrag">ActionForward</span>, que especifica la siguiente vista a mostrar.</li>
	
<li>Normalmente la vista se especifica mediante un nombre simb&oacute;lico, que se corresponder&aacute; con el <span class="codefrag">name</span> especificado en la etiqueta <span class="codefrag">forward</span> de <span class="codefrag">struts-config.xml</span>. El <strong>par&aacute;metro</strong> de
		tipo <span class="codefrag">ActionMapping</span> nos permite acceder a la asociaci&oacute;n entre nombre de acci&oacute;n y clase que la implementa definida en el fichero. As&iacute;, su m&eacute;todo <span class="codefrag">findForward</span> hace posible encontrar la vista asociada a un nombre simb&oacute;lico.</li>

</ul>
<a name="N1022C"></a><a name="Acciones+por+defecto"></a>
<h3 class="underlined_5">Acciones por defecto</h3>
<p>Struts incorpora una serie de acciones con comportamientos predefinidos, que son de uso com&uacute;n en muchas aplicaciones. Por ejemplo, para dirigir al usuario desde la p&aacute;gina de login hacia la de registro de nuevo usuario, podr&iacute;amos en principio utilizar simplemente un enlace, pero esto ir&iacute;a "contra la filosof&iacute;a" de MVC, en la que todas las peticiones pasan por el controlador. En su lugar, podemos utilizar una acci&oacute;n de la clase <span class="codefrag">org.apache.struts.action.ForwardAction</span>, que redirige una petici&oacute;n hacia una vista, especificada mediante el atributo <span class="codefrag">parameter</span>. Por ejemplo:</p>
<pre class="code">
&lt;action path="/inicioRegistro" type="org.apache.struts.actions.ForwardAction"
    parameter="/registro.jsp"&gt;
&lt;/action&gt; 
</pre>
<p>De esta manera, la petici&oacute;n a la URL <span class="codefrag">inicioRegistro.do</span>, se redigir&iacute;a a la p&aacute;gina <span class="codefrag">registro.jsp</span>. As&iacute; se puede cambiar el flujo de navegaci&oacute;n sin tener que cambiar directamente los enlaces de las p&aacute;ginas.</p>
<a name="N10249"></a><a name="Tratamiento+de+errores+en+las+acciones"></a>
<h3 class="underlined_5">Tratamiento de errores en las acciones</h3>
<p>La ejecuci&oacute;n de la acci&oacute;n puede generar uno o varios errores que deseamos mostrar al usuario. En Struts, el tratamiento de errores requiere una serie de acciones:</p>
<ul>
  
<li>Crear una lista de errores vac&iacute;a. Esta lista se modela con el objeto <span class="codefrag">ActionErrors</span>.</li>
  
<li>A&ntilde;adir errores a la lista. Cada error es un objeto <span class="codefrag">ActionError</span>.</li>
  
<li>Finalmente, si la lista contiene alg&uacute;n error
  <ul>
    
<li>Guardar la lista en la petici&oacute;n HTTP para que no se pierda. Para ello se utiliza el m&eacute;todo <span class="codefrag">saveErrors</span>.</li>
    
<li>Devolver un resultado que indique que se ha producido un error.</li>
  
</ul>
</li>

</ul>
<p>Por ejemplo, el siguiente c&oacute;digo realiza los pasos antes descritos:</p>
<pre class="code">

<strong>//crear una lista de errores vac&iacute;a</strong>
ActionErrors errores = new ActionErrors();
try {
   //c&oacute;digo que ejecuta la l&oacute;gica de negocio. 
   ...   
}
catch(Exception e) {
   <strong>//a&ntilde;adir errores a la lista</strong>
   errores.add(ActionErrors.GLOBAL_ERROR,
               new ActionError("error.bd");
}
<strong>//comprobar si la lista de errores est&aacute; vac&iacute;a</strong>
if (!errores.empty()) {
<strong>   //guardar los errores en la petici&oacute;n HTTP</strong>
   saveErrors(request, errors);
   <strong>//devolver un resultado que indique error. En struts-config.xml
   //estar&aacute; definida la p&aacute;gina jsp asociada a este resultado</strong>
   return mapping.findForward("error");
}
</pre>
<p>El constructor de un <span class="codefrag">ActionError</span> requiere como m&iacute;nimo un argumento: el mensaje de error. Los mensajes de error no son directamente cadenas, sino claves dentro de un fichero de texto del tipo <span class="codefrag">properties</span>. Por ejemplo, la clave "<span class="codefrag">error.bd</span>" significar&aacute; que debe haber un fichero <span class="codefrag">.properties</span> en el que se especifique algo como:</p>
<pre class="code">
error.bd = se ha producido un error con la base de datos
</pre>
<p>Para indicar a struts c&oacute;mo encontrar el fichero <span class="codefrag">.properties</span>, utilizamos el fichero de configuraci&oacute;n <span class="codefrag">struts-config.xml</span>, mediante el elemento <span class="codefrag">&lt;message-resources&gt;</span> (que se pone detr&aacute;s de la etiqueta &lt;action-mappings&gt;). Por ejemplo:</p>
<pre class="code">
 &lt;message-resources parameter="util.recursos"/&gt;
</pre>
<p>Indicar&iacute;a a struts que busque un fichero <strong>recursos.properties</strong> dentro de la carpeta <span class="codefrag">util</span>. Normalmente, se toma como base de la b&uacute;squeda la carpeta <span class="codefrag">/WEB_INF/classes</span>, por lo que el fichero buscado
ser&aacute; finalmente<span class="codefrag">/WEB-INF/classes/util/recursos.properties</span>.</p>
<p>Las claves de error pueden utilizar hasta 4 par&aacute;metros. Por ejemplo supongamos que se desea mostrar un error indicando que
hay un campo requerido para el que el usuario no ha introducido valor. Ser&iacute;a demasiado tedioso hacer un mensaje distinto para cada campo: ("login requerido", "password requerido", etc). Es m&aacute;s f&aacute;cil definir un mensaje con par&aacute;metros:</p>
<pre class="code">
error.requerido = Es necesario especificar un valor para el campo {0}
</pre>
<p>Como se ve, los par&aacute;metros son simplemente n&uacute;meros entre <span class="codefrag">{}</span>. El constructor de la clase <span class="codefrag">ActionError</span> permite especificar los par&aacute;metros (como se ha dicho, hasta 4) adem&aacute;s de la clave de error</p>
<pre class="code">
ActionError error = new ActionError("error.requerido", "login");
</pre>
<p>Como se ha visto en el ejemplo anterior, para a&ntilde;adir los errores a la lista se emplea el m&eacute;todo <span class="codefrag">add</span> de la clase <span class="codefrag">ActionErrors</span>. Este m&eacute;todo admite como primer par&aacute;metro una cadena que indica el tipo de error (lo m&aacute;s t&iacute;pico es usar la constante <span class="codefrag">ActionErrors.GLOBAL_ERROR</span>) y como segundo par&aacute;metro el propio objeto <span class="codefrag">ActionError</span>. Si en el tipo de error utilizamos el nombre de una propiedad de un bean, quedar&aacute; asociado a esta y podremos mostrarlo espec&iacute;ficamente en la p&aacute;gina HTML (como veremos en las <em>taglibs</em> de Struts).</p>
<pre class="code">
errors.add("password", new ActionError("error.passwordcorto"));
</pre>
<p>Para mostrar la lista de errores en la vista, se puede usar una etiqueta de las <em>taglibs</em> que vienen con Struts: la etiqueta 	<span class="codefrag">&lt;html:errors/&gt;</span>. Dicha etiqueta se sustituye en tiempo de ejecuci&oacute;n por una lista no numerada (&lt;ul&gt;) en color rojo con los errores guardados desde la acci&oacute;n. Como dicha etiqueta pertenece a la <em>taglib</em> HTML de Struts es necesario importarla poniendo al principio del JSP:</p>
<pre class="code">
   &lt;%@taglib uri="http://jakarta.apache.org/struts/tags-html" prefix="html" %&gt;
</pre>
<p>Veremos con m&aacute;s detalle otras etiquetas de las <em>taglibs</em> de Struts en el tema siguiente.</p>
</div>

<a name="N102F9"></a><a name="Seguridad"></a>
<h2 class="underlined_10">Seguridad</h2>
<div class="section">
<p>La versi&oacute;n 1.1 de Struts introdujo la seguridad basada en acciones. Esto quiere decir que podemos combinar los mecanismos est&aacute;ndar de seguridad en aplicaciones web J2EE con el funcionamiento de nuestra aplicaci&oacute;n Struts. Para cada acci&oacute;n especificaremos qu&eacute; rol o roles pueden ejecutarla, mediante el atributo <span class="codefrag">roles</span>, por ejemplo en <span class="codefrag">struts-config.xml</span> podr&iacute;a aparecer algo similar a lo siguiente:</p>
<pre class="code">
&lt;action <strong>roles="admin,manager"</strong>
        path="/admin/borrarUsuario"
        ...
&lt;/action&gt;
</pre>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
