<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Ejercicios de la sesi&oacute;n JDBC 3</title>
                
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
         
  <link rel="stylesheet" href="../../../apuntes.css" type="text/css">
</head>
 <body bgcolor="#ffffff" text="#000000">
<h1>Movimientos y restricciones en la consulta</h1>
<p>Vamos a realizar una clase que nos permita movernos y actualizar el <b>ResultSet. 
  </b>Para ello, realizaremos un men&uacute; que permita consultar, reservar y 
  anular vuelos. Haced uso de la plantilla <i>EjJDBC3.java</i>. Los pasos a seguir 
  ser&aacute;n los siguientes:</p>
<ul>
  <li>Lo primero a realizar es la consulta. Implementad el m&eacute;todo <i>consultaDisp</i>. 
    Este m&eacute;todo va a mostrar los datos de los vuelos junto con la disponibilidad 
    de plazas. Deb&eacute;is crear un men&uacute; que permita ir avanzando de 
    uno en uno por los vuelos. El men&uacute; debe permitir avanzar, retroceder, 
    ir al &uacute;ltimo registro e ir al primero. La creaci&oacute;n del objeto 
    <b>Statement</b> debe configurarse para qu permita el movimiento por el <b>ResultSet</b>. 
    Una vez le&iacute;do un registro, si se intenta volver a leer dar&aacute; 
    una excepci&oacute;n: debemos realizar un <i>next</i> seguido de un <i>previous</i> 
    (por ejemplo). La informaci&oacute;n a mostrar ser&aacute;: n&uacute;mero 
    de vuelo, aeropuerto inicio y destino, fecha y hora de inicio y final, la 
    clase y las plazas disponibles.<br>
  </li>
</ul>
<ul>
  <li>En el m&eacute;todo <i>muestraTray</i> se pedir&aacute; al usuario que introduzca 
    el apellido del cliente. A continuaci&oacute;n mostrar&aacute; todos los trayectos 
    de ese usuario, mostrando para cada trayecto los vuelos parciales reservados. 
    Realizar&eacute;is tambi&eacute;n un men&uacute; como el anterior para moverse 
    por todos los registros. Aqu&iacute; deb&eacute;is realizar dos consultas. 
    La primera para sacar todos los trayectos del cliente. Esta consulta ser&aacute; 
    por la que nos movamos. La otra consulta ser&aacute; para mostrar los vuelos 
    parciales de ese trayecto (legs). La informaci&oacute;n a mostrar ser&aacute;: 
    Nombre y apellidos del cliente, una l&iacute;nea por cada vuelo parcial, mostrando 
    el aeropuerto de inicio, el de destino y la fecha y hora de salida.<br>
  </li>
</ul>
<ul>
  <li>El m&eacute;todo <i>modificaCliente</i> primero hace una consulta a la tabla 
    <i>usuario</i> mostrando todos los datos del primer cliente. Ten&eacute;is 
    que hacer un men&uacute; para moveros por el <b>ResultSet</b> y permitir modificar 
    los datos del cliente que se muestra en ese momento. Si seleccionamos modificar 
    los datos del cliente nos ir&aacute; pidiendo los datos y por &uacute;ltimo 
    se actualizar&aacute; la fila correspondiente <br>
    <br>
  </li>
  <li>El &uacute;ltimo m&eacute;todo a implementar, <i>anulaTray</i>, mostrar&aacute; 
    la informaci&oacute;n de trayectos de un usuario particular. Para ello podemos 
    hacer uso del m&eacute;todo anterior, a&ntilde;adiendo una nueva opci&oacute;n 
    que ser&aacute; la de anular reserva. Esta opci&oacute;n se a&ntilde;adir&aacute; 
    en el men&uacute; y cuando la seleccionemos borrar&aacute; todos los vuelos 
    parciales (legs) que se correspondan con el trayecto actual. Deb&eacute;is 
    realizar dos cosas: eliminar los legs y actualizar la tabla disponibilidad, 
    pues al eliminar un leg dispondremos de una plaza m&aacute;s. </li>
</ul>
<blockquote>&nbsp;</blockquote>
   
</body>
            </html>
