<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Ejercicios de la sesi&oacute;n JDBC 2</title>
                
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
         
  <link rel="stylesheet" href="../../../apuntes.css" type="text/css">
</head>
 <body>
<h1>Metadatos y sentencias preparadas</h1>
<p>En el primer ejercicio de esta sesi&oacute;n vamos a realizar una clase que 
  nos permita copiar la estructura de tablas y los datos de un SGBD a otro (en 
  nuestro caso, de MySQL a PostGres). Para ello vamos a seguir los siguientes 
  pasos:</p>
<ul>
  <li>Cread una nueva clase de conexi&oacute;n que nos permita conectarnos con 
    PostGres. Pod&eacute;is basaros en la realizada en la anterior sesi&oacute;n, 
    modificando los datos de conexi&oacute;n. </li>
</ul>
<ul>
  <li>Cread una clase que copie la estructura de tablas desde MySQL a PostGres. 
    La BD ya est&aacute; creada en PostGres con el nombre Viajes. La clase a desarrollar 
    contendr&aacute; un m&eacute;todo <i>crear</i> que obtendr&aacute; los metadatos 
    de MySQL y ejecutar&aacute; un comando CREATE TABLE para cada tabla. <br>
    <br>
  </li>
  <li>Una vez creadas todas las tablas procedemos a copiar los datos. Para ello, 
    creamos un nuevo m&eacute;todo dentro de la anterior clase que realizar&aacute; 
    una consulta a la BD en MySQL e insertar&aacute; dichos datos a la correspondiente 
    en PostGres. Para simplificar os fij&aacute;is en los tipos de los campos. 
    En este m&eacute;todo lo correcto ser&iacute;a utilizar el m&eacute;todo <b>executeBatch</b> 
    con el correspondiente <b>addBatch</b>, tal como hemos visto en teor&iacute;a. 
    Sin embargo, el driver de PostGres no tiene implementados estos m&eacute;todos. 
    Realizad un <b>executeUpdate</b> por cada INSERT.<br>
    <br>
  </li>
  <li>Una vez copiados comprobad si la clase desarrollada en la sesi&oacute;n 
    anterior funciona con PostGres. Simplemente cambiad la clase de conexi&oacute;n 
    a la nueva creada para PostGres, compil&aacute;is y ejecut&aacute;is.</li>
</ul>
<p>En el siguiente ejercicio se trata de hacer uso de las sentencias preparadas. 
  Utilizad el ejercicio desarrollado en la sesi&oacute;n anterior. Modificad el 
  m&eacute;todo <i>MuestraTray</i> para que trabaje con sentencias preparadas. 
  En este m&eacute;todo se realizan dos consultas. La segunda consulta se repite 
  muchas veces cambiando s&oacute;lo los datos de la consulta. Este tipo de consulta 
  son las ideales para hacerlas preparadas. Cread la sentencia preparada en el 
  constructor de la clase y asignar los par&aacute;metros tal como hemos visto 
  en teor&iacute;a.<br>
</p>
</body>
            </html>
