<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Desarrollo y configuraci&oacute;n de aplicaciones web</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores Web" src="images/baner_j2ee_der.gif" title="Servidores Web"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores Web</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores Web</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Servidores Web">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 2</div>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion02-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Desarrollo y configuraci&oacute;n de aplicaciones web</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Desarrollo+de+aplicaciones+web">Desarrollo de aplicaciones web</a>
<ul class="minitoc">
<li>
<a href="#Construcci%C3%B3n+de+la+aplicaci%C3%B3n">Construcci&oacute;n de la aplicaci&oacute;n</a>
</li>
<li>
<a href="#Despliegue+de+la+aplicaci%C3%B3n">Despliegue de la aplicaci&oacute;n</a>
</li>
</ul>
</li>
<li>
<a href="#Configuraci%C3%B3n+de+Tomcat">Configuraci&oacute;n de Tomcat</a>
<ul class="minitoc">
<li>
<a href="#Formas+de+cambiar+la+configuraci%C3%B3n">Formas de cambiar la configuraci&oacute;n</a>
</li>
<li>
<a href="#Configurar+el+host">Configurar el host</a>
</li>
</ul>
</li>
<li>
<a href="#Configuraci%C3%B3n+de+aplicaciones+web">Configuraci&oacute;n de aplicaciones web</a>
<ul class="minitoc">
<li>
<a href="#Configuraci%C3%B3n+desde+Tomcat%3A+el+contexto">Configuraci&oacute;n desde Tomcat: el contexto</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+desde+Tomcat%3A+los">Configuraci&oacute;n desde Tomcat: los valves</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+desde+la+aplicaci%C3%B3n%3A+el+descriptor+de+despliegue">Configuraci&oacute;n desde la aplicaci&oacute;n: el descriptor de despliegue</a>
</li>
</ul>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Desarrollo+de+aplicaciones+web"></a>
<h2 class="underlined_10">Desarrollo de aplicaciones web</h2>
<div class="section">
<a name="N10012"></a><a name="Construcci%C3%B3n+de+la+aplicaci%C3%B3n"></a>
<h3 class="underlined_5">Construcci&oacute;n de la aplicaci&oacute;n</h3>
<p>Cuando iniciamos el servidor web, autom&aacute;ticamente carga en el <span class="codefrag">CLASSPATH</span> del servidor lo necesario para trabajar con servlets y p&aacute;ginas JSP, y tambi&eacute;n carga las clases que haya en los directorios <span class="codefrag">WEB-INF/classes</span> y <span class="codefrag">WEB-INF/lib</span> de las aplicaciones, para que sepan d&oacute;nde encontrarlas. </p>
<p>Sin embargo, para poder construir una aplicaci&oacute;n (implementar y compilar los servlets y p&aacute;ginas JSP que la componen), necesitaremos tambi&eacute;n tener estos datos configurados, pues de lo contrario no conseguiremos compilar. Veremos ahora qu&eacute; pasos hay que seguir para esto. </p>
<p>
<strong>Directorio de trabajo</strong>
</p>
<p>Primero debemos crear un directorio de trabajo donde colocar nuestras aplicaciones Web. Es recomendable que dicho directorio quede fuera del directorio de instalaci&oacute;n del servidor. </p>
<p>Para que la aplicaci&oacute;n est&eacute; disponible tendremos que instalarla dentro del servidor de aplicaciones, por lo que tendremos que copiar la aplicaci&oacute;n de nuestro directorio de desarrollo al directorio del servidor web. Este proceso es lo que se conoce como despliegue, y lo estudiaremos con mayor detalle m&aacute;s adelante. </p>
<p>Podemos estructurar el directorio de desarrollo de la siguiente forma:</p>
<ul>
			
<li>
<strong><span class="codefrag">src</span></strong>: C&oacute;digo fuente (servlets y otras clases)</li>
			
<li>
<strong><span class="codefrag">web</span></strong> (o <span class="codefrag">WebContent</span>): Elementos que no necesitan ser compilados (recursos est&aacute;ticos, JSPs, <span class="codefrag">WEB-INF/web.xml</span>, librer&iacute;as)</li>
			
<li>
<strong><span class="codefrag">build</span></strong>: Aplicaci&oacute;n completa tal como se instalar&aacute; en el servidor</li>
			
<li>
<strong><span class="codefrag">dist</span></strong>: Aplicaci&oacute;n empaquetada (fichero WAR)</li>
		
</ul>
<p>De esta forma separamos las clases Java de nuestra aplicaci&oacute;n, que deben ser compiladas antes de desplegar la aplicaci&oacute;n, del resto de elementos de la aplicaci&oacute;n.</p>
<p>
<strong>Establecer el CLASSPATH</strong>
</p>
<p>Tenemos que a&ntilde;adir al <span class="codefrag">CLASSPATH</span> el lugar donde se encuentran las APIs de servlets y JSP. Cada servidor proporciona mediante unos ficheros JAR estas librer&iacute;as, que deberemos a&ntilde;adir. En el caso de Tomcat, tenemos los ficheros <strong><span class="codefrag">servlet-api.jar</span></strong> para poder compilar nuestros servlets. Las p&aacute;ginas requieren otras librer&iacute;as, como <strong><span class="codefrag">jsp-api.jar</span></strong>. Todos estos ficheros se encuentran localizados en el directorio <strong><span class="codefrag">common/lib</span></strong>. Normalmente s&oacute;lo necesitamos a&ntilde;adir el fichero <span class="codefrag">servlet-api.jar</span>, puesto que las p&aacute;ginas JSP las compila autom&aacute;ticamente el servidor si no lo est&aacute;n, y &eacute;l ya encuentra solo los JAR. </p>
<p>Tambi&eacute;n deberemos a&ntilde;adir los directorios y ficheros JAR de otras clases que necesitemos y no formen parte de la API de Java (incluyendo librer&iacute;as del directorio <span class="codefrag">WEB-INF/classes</span> o <span class="codefrag">WEB-INF/lib</span> de la aplicaci&oacute;n). </p>
<p>La herramienta <em>ant</em> nos facilitar&aacute; esta tarea, ya que podremos introducir en el <em>classpath</em> todas las librer&iacute;as que incluye Tomcat de forma sencilla. Podemos incluir la librer&iacute;as necesarias como se muestra a continuaci&oacute;n:</p>
<pre class="code">&lt;path id="compile.classpath"&gt;  
	&lt;pathelement location="<strong>${catalina.home}/common/classes</strong>"/&gt;  
	&lt;fileset dir="<strong>${catalina.home}/common/endorsed</strong>"&gt;    
		&lt;include name="*.jar"/&gt;  
	&lt;/fileset&gt;  
	&lt;fileset dir="<strong>${catalina.home}/common/lib</strong>"&gt;    
		&lt;include name="*.jar"/&gt;  
	&lt;/fileset&gt;  
	&lt;pathelement location="<strong>${catalina.home}/shared/classes</strong>"/&gt;  
	&lt;fileset dir="<strong>${catalina.home}/shared/lib</strong>"&gt;    
		&lt;include name="*.jar"/&gt;  
	&lt;/fileset&gt;
&lt;/path&gt;</pre>
<p>Donde <span class="codefrag">${catalina.home}</span> ser&aacute; la ruta donde tengamos instalado Tomcat. </p>
<p>
<strong>Construcci&oacute;n de la aplicaci&oacute;n</strong>
</p>
<p>Deberemos escribir todo el c&oacute;digo fuente de las clases Java de nuestra aplicaci&oacute;n en el subdirectorio <span class="codefrag">src</span> del directorio de desarrollo, y generar el resto de recursos en el subdirectorio <span class="codefrag">web</span> (siempre ser&aacute; necesario tener al menos el descriptor de despliegue <span class="codefrag">/WEB-INF/web.xml</span> para que la aplicaci&oacute;n funcione).</p>
<p>Una vez hemos desarrollado los componentes de nuestra aplicaci&oacute;n, deberemos construir la aplicaci&oacute;n. Construiremos la aplicaci&oacute;n final en el subdirectorio <span class="codefrag">build</span>, seg&uacute;n la organizaci&oacute;n descrita anteriormente. </p>
<p>Una vez construida, podemos empaquetarla de forma opcional en un fichero WAR para facilitar su distribuci&oacute;n. Este fichero WAR lo generaremos dentro del directorio <span class="codefrag">dist</span>.</p>
<p>Para construir la aplicaci&oacute;n seguiremos los siguientes pasos:</p>
<p>
<strong>1. Preparaci&oacute;n</strong>
</p>
<p>En esta fase deberemos construir en el directorio <span class="codefrag">build</span> la estructura b&aacute;sica de la aplicaci&oacute;n web. Crearemos los directorios <span class="codefrag">/WEB-INF</span>, <span class="codefrag">/WEB-INF/lib</span> y <span class="codefrag">/WEB-INF/classes</span> y copiaremos todo el contenido que no necesita ser compilado (directorio <span class="codefrag">web</span>) a este directorio <span class="codefrag">build</span>.</p>
<p>Podemos utilizar <em>ant</em> para realizar esta tarea. Podemos hacerlo como se muestra a continuaci&oacute;n:</p>
<pre class="code">&lt;target name="prepare"&gt;  
	&lt;mkdir dir="<strong>${build.home}</strong>"/&gt;  
	&lt;mkdir dir="<strong>${build.home}/WEB-INF</strong>"/&gt;  
	&lt;mkdir dir="<strong>${build.home}/WEB-INF/classes</strong>"/&gt;  
	&lt;mkdir dir="<strong>${build.home}/WEB-INF/lib</strong>"/&gt;  
	&lt;copy todir="<strong>${build.home}</strong>"&gt;    
		&lt;fileset dir="<strong>${web.home}</strong>"/&gt;  
	&lt;/copy&gt;
&lt;/target&gt;</pre>
<p>
<strong>2. Compilaci&oacute;n</strong>
</p>
<p>Hasta ahora tenemos en <span class="codefrag">build</span> todo el contenido de la aplicaci&oacute;n web que no necesita ser compilado, y la estructura de directorios de <span class="codefrag">/WEB-INF</span> creada. </p>
<p>Ahora ya podemos compilar todas las clases Java que hayamos desarrollado en <span class="codefrag">src</span>. El c&oacute;digo compilado resultante lo guardaremos en el directorio <span class="codefrag">/WEB-INF/classes</span> dentro de <span class="codefrag">build</span>, que es donde se deben ubicar estas clases Java. Para la compilaci&oacute;n deberemos tener establecido el <em>classpath</em> con todas las librer&iacute;as necesarias, tal como hemos visto en el punto anterior.</p>
<p>Utilizando <em>ant</em> podemos realizar esta compilaci&oacute;n de la siguiente forma:</p>
<pre class="code">&lt;target name="compile" depends="prepare" 
        description="Compila los fuentes Java"&gt;  
	&lt;javac srcdir="<strong>${src.home}</strong>" 
	       destdir="<strong>${build.home}/WEB-INF/classes</strong>" 
	       debug="${compile.debug}" 
	       deprecation="${compile.deprecation}" 
	       optimize="${compile.optimize}"&gt;    
	 	&lt;classpath refid="<strong>compile.classpath</strong>"/&gt;  
	&lt;/javac&gt;
&lt;/target&gt;</pre>
<p>
<strong>3. Empaquetamiento</strong>
</p>
<p>Por &uacute;ltimo, y de forma opcional, podemos empaquetar la aplicaci&oacute;n en un fichero WAR para facilitar su distribuci&oacute;n. En alg&uacute;n caso este paso puede ser obligatorio, ya que para desplegar las aplicaciones algunos servidores de aplicaciones nos fuerzan a utilizar un fichero WAR.</p>
<p>Deberemos utilizar la herramienta JAR para empaquetar todo el contenido del directorio <span class="codefrag">build</span> en un fichero con extensi&oacute;n WAR. Este fichero lo guardaremos en el directorio <span class="codefrag">dist</span>. </p>
<p>Podemos hacer esto con <em>ant</em> de la siguiente forma:</p>
<pre class="code">&lt;target name="dist" depends="compile" 
        description="Crea el fichero WAR de la aplicacion"&gt;  
	&lt;mkdir dir="${dist.home}"/&gt;  
	&lt;jar jarfile="<strong>${dist.home}/${war.name}</strong>" basedir="<strong>${build.home}</strong>"/&gt;
&lt;/target&gt;</pre>
<a name="N10140"></a><a name="Despliegue+de+la+aplicaci%C3%B3n"></a>
<h3 class="underlined_5">Despliegue de la aplicaci&oacute;n</h3>
<p>Una vez hemos construido la aplicaci&oacute;n deberemos <strong>desplegarla</strong> en el servidor de aplicaciones para que dicha aplicaci&oacute;n est&eacute; disponible al acceder al servidor desde la web. Este proceso es conocido como despliegue o <em>deployment</em>. Cada servidor de aplicaciones tiene sus propios m&eacute;todos para desplegar las aplicaciones. Por ejemplo, casi siempre tenemos disponible una interfaz web a trav&eacute;s de la cual podemos subir y desplegar una aplicaci&oacute;n en el servidor.</p>
<p>Vamos a ver las posibles formas en las que el servidor web Tomcat nos permite desplegar las aplicaciones, pero antes veremos d&oacute;nde se almacenan las aplicaciones desplegadas en Tomcat. </p>
<p>Tomcat tiene un directorio <span class="codefrag">webapps</span> (<span class="codefrag">${tomcat.home}/webapps</span>) donde est&aacute;n todas las aplicaciones web instaladas en el servidor. Cada aplicaci&oacute;n web est&aacute; contenida dentro de un subdirectorio de <span class="codefrag">webapps</span>, y este subdirectorio contendr&aacute; toda la estructura de directorios y ficheros correspondiente a la aplicaci&oacute;n web. Por ejemplo, podremos tener:</p>
<pre class="code">${tomcat.home}/webapps/aplic/
${tomcat.home}/webapps/aplic/index.htm
${tomcat.home}/webapps/aplic/WEB-INF/
${tomcat.home}/webapps/aplic/WEB-INF/web.xml
${tomcat.home}/webapps/aplic/WEB-INF/classes/
${tomcat.home}/webapps/aplic/WEB-INF/lib/</pre>
<p>De esta forma tendremos un contexto (aplicaci&oacute;n web) <span class="codefrag">aplic</span> instalado en Tomcat. Por defecto Tomcat asigna como ruta de cada contexto el mismo nombre del directorio del mismo, por lo que para acceder a esta aplicaci&oacute;n <span class="codefrag">aplic</span> anterior deberemos introducir la siguiente URL:</p>
<pre class="code">http://localhost:8080/aplic/index.htm</pre>
<p>Considerando que tenemos Tomcat instalado en nuestra m&aacute;quina local y atendiendo en el puerto <span class="codefrag">8080</span> (es el puerto por defecto de Tomcat). </p>
<p>M&aacute;s adelante veremos c&oacute;mo podemos configurar Tomcat para asignar a cada contexto la ruta que queramos. Al instalar Tomcat encontramos una aplicaci&oacute;n instalada por defecto en un directorio <span class="codefrag">ROOT</span> (<span class="codefrag">${tomcat.home}/webapps/ROOT</span>). Esta aplicaci&oacute;n tiene asignada la ruta <span class="codefrag">/</span>, por lo que cuando accedamos a la URL:</p>
<pre class="code">http://localhost:8080/</pre>
<p>Ser&aacute; esta la aplicaci&oacute;n a la que se estar&aacute; accediendo, que nos muestra la p&aacute;gina de bienvenida de Tomcat y enlaces a documentaci&oacute;n y a la aplicaci&oacute;n de gesti&oacute;n del servidor. </p>
<p>Si copiamos recursos a este directorio <span class="codefrag">ROOT</span>, podremos acceder a ellos a partir de esta URL ra&iacute;z del servidor. Por ejemplo, si copiamos la siguiente p&aacute;gina HTML:</p>
<pre class="code">${tomcat.home}/webapps/ROOT/pagina.htm</pre>
<p>Podremos acceder a ella utilizando la siguiente URL:</p>
<pre class="code">http://localhost:8080/pagina.htm</pre>
<p>Tambi&eacute;n podremos configurar Tomcat para que sea cualquier otra de las aplicaciones instaladas la que tenga asignada esta ruta ra&iacute;z, simplemente cambiando la ruta asignada a cada contexto como se ver&aacute; m&aacute;s adelante.</p>
<p>Una vez hemos visto c&oacute;mo se almacenan las aplicaciones desplegadas en Tomcat, vamos a ver c&oacute;mo desplegarlas. Una forma sencilla de hacerlo es simplemente crear el directorio de la aplicaci&oacute;n en <span class="codefrag">webapps</span> y copiar ah&iacute; todo su contenido. Esto a veces nos fuerza a reiniciar el servidor para que la nueva aplicaci&oacute;n sea reconocida correctamente por Tomcat. Por esta raz&oacute;n, existen otras formas de despliegue de forma din&aacute;mica, sin necesidad de reiniciar Tomcat, a trav&eacute;s de una aplicaci&oacute;n instalada en Tomcat llamada <em>manager</em>. Tendremos disponible tanto una versi&oacute;n HTML del <em>manager</em>, con la que podremos desplegar aplicaciones desde un navegador, como una versi&oacute;n basada en comandos que ser&aacute; utilizada por una serie de tareas de <em>ant</em> con las que podremos realizar el despliegue. </p>
<p>A continuaci&oacute;n veremos con detalle cada una de estas formas de despliegue.</p>
<p>
<strong>1. Copiar al directorio de aplicaciones</strong>
</p>
<p>Esta forma de despliegue es la m&aacute;s sencilla. Simplemente copiamos el contenido de nuestra aplicaci&oacute;n, que habremos generado en el directorio <span class="codefrag">build</span> de nuestro directorio de desarrollo, al directorio <span class="codefrag">webapps</span> de Tomcat. Esta copia la podemos hacer utilizando tareas de <em>ant</em> como se muestra a continuaci&oacute;n:</p>
<pre class="code">&lt;target name="deploy" depends="compile" 
        description="Despliega la aplicacion"&gt;  
	&lt;mkdir dir="<strong>${catalina.home}/${app.name}</strong>"/&gt;  
	&lt;copy todir="<strong>${catalina.home}/${app.name}</strong>"&gt;    
		&lt;fileset dir="<strong>${build.home}</strong>"/&gt;  
	&lt;/copy&gt;
&lt;/target&gt;</pre>
<p>Tambi&eacute;n podremos copiar directamente el fichero WAR con la aplicaci&oacute;n al directorio <span class="codefrag">webapps</span> de Tomcat. En este caso, cuando reiniciemos Tomcat, &eacute;ste desempaquetar&aacute; el fichero WAR creando la estructura de directorios de la aplicaci&oacute;n bajo <span class="codefrag">webapps</span>. Esto es el comportamiento por defecto, pero podremos configurar Tomcat para que no desempaquete los WAR, sino que acceda a la aplicaci&oacute;n usando directamente el fichero WAR como veremos m&aacute;s adelante.</p>
<p>Este m&eacute;todo tiene el inconveniente de que deberemos reiniciar el servidor para que Tomcat reconozca las nuevas aplicaciones que hayamos instalado. En las &uacute;ltima versiones de Tomcat se suelen reconocer correctamente las aplicaciones que se instalan en tiempo de ejecuci&oacute;n, sin necesidad de reiniciar el servidor, pero en algunos casos ser&aacute; necesario reiniciarlo para asegurarnos de que ha actualizado correctamente la informaci&oacute;n sobre las aplicaciones instaladas.</p>
<p>Para evitar tener que reiniciar el servidor, tenemos una aplicaci&oacute;n instalada en Tomcat llamada <span class="codefrag">manager</span>, que nos permitir&aacute; desplegar y gestionar las aplicaciones web instaladas en el servidor en tiempo de ejecuci&oacute;n. Con el <em>manager</em> podremos subir y desplegar una aplicaci&oacute;n, ver la lista de aplicaciones desplegadas, y detener, recargar, reanudar o desinstalar estas aplicaciones.</p>
<p>
<strong>2. Utilizar la interfaz HTML del manager</strong>
</p>
<p>El manager de Tomcat cuenta con una interfaz HTML desde la cual podremos desplegar aplicaciones y gestionar las aplicaciones instaladas. Para acceder a esta interfaz HTML del manager introduciremos la siguiente URL en cualquier navegador:</p>
<pre class="code">http://localhost:8080/manager/html</pre>
<p>Para poder acceder al manager necesitaremos contar con un usuario con rol <span class="codefrag">manager</span> registrado en Tomcat. Si no tenemos ning&uacute;n usuario con estos permisos deberemos crear uno. Para ello editaremos el fichero <span class="codefrag">${tomcat.home}/conf/tomcat-users.xml</span> e introduciremos las siguientes l&iacute;neas:</p>
<pre class="code">&lt;role rolename="<strong>manager</strong>"/&gt;
&lt;user username="<strong>admin</strong>" password="<strong>j2ee</strong>" roles="<strong>manager</strong>"/&gt;</pre>
<p>Con esto ya podremos acceder al manager con nuestro usuario. En este caso el usuario tendr&aacute; el nombre <span class="codefrag">admin</span> y el password <span class="codefrag">j2ee</span>.</p>
<p>Una vez accedamos al manager veremos una p&aacute;gina como la que se muestra a continuaci&oacute;n:</p>
<p>
<img alt="Vista del manager de Tomcat" content-width="10cm" height="353" src="imagenes/manager1.gif" width="500"></p>
<p>Aqu&iacute; podemos ver las aplicaciones instaladas en el servidor y podemos gestionarlas. Podemos detener (<em>Stop</em>) las aplicaciones para que dejen de estar disponibles, pero sin borrarlas del servidor, y posteriormente reanudar su ejecuci&oacute;n con <em>Start</em>. Tambi&eacute;n podemos recargar las aplicaciones con <em>Reload</em>. Esto ser&aacute; &uacute;til cuando hayamos modificado la aplicaci&oacute;n y queramos que Tomcat reconozca estos cambios, por ejemplo si hemos cambiado la configuraci&oacute;n de la aplicaci&oacute;n (<span class="codefrag">web.xml</span>) o hemos a&ntilde;adido o modificado clases Java. Por &uacute;ltimo, con <em>Remove</em> podremos desinstalar la aplicaci&oacute;n del servidor. Al hacer esto se eliminar&aacute;n todos los ficheros de la aplicaci&oacute;n y ya no podr&aacute; reanudarse.</p>
<p>En la parte inferior de esta p&aacute;gina encontramos los siguientes formularios:</p>
<p>
<img alt="" content-width="10cm" height="216" src="imagenes/manager2.gif" width="500"></p>
<p>Desde aqu&iacute; podremos desplegar aplicaciones web en el servidor. Con el formulario superior podremos desplegar una aplicaci&oacute;n que ya se encuentre en un directorio de la m&aacute;quina en la que est&aacute; el servidor. </p>
<p>Con el formulario inferior ser&aacute; muy sencillo desplegar una aplicaci&oacute;n web. Simplemente necesitamos tener el fichero WAR de la aplicaci&oacute;n en nuestra m&aacute;quina. Pulsamos sobre <em>Examinar...</em> para buscar y seleccionar este fichero WAR, y una vez seleccionado pulsaremos sobre <em>Install</em> para que suba y despliegue la aplicaci&oacute;n al servidor web. </p>
<p>
<strong>3. Utilizar tareas de ant</strong>
</p>
<p>Adem&aacute;s de la interfaz HTML, el manager de Tomcat cuenta con una interfaz en forma de servicio, con la que podremos utilizar la funciones del manager enviando comandos en la misma URL. </p>
<p>Tomcat proporciona una serie de tareas adicionales de <em>ant</em> que utilizan estos servicios del manager para realizar las tareas de despliegue y gesti&oacute;n de la aplicaciones web. De esta forma podremos desplegar aplicaciones directamente utilizando tareas de <em>ant</em>. Esta librer&iacute;a de tareas de <em>ant</em> est&aacute; contenida en el fichero <span class="codefrag">catalina-ant.jar</span> ubicado en:</p>
<p>
<span class="codefrag">${tomcat.home}/server/lib/catalina-ant.jar</span>
</p>
<p>Por lo tanto, para poder utilizar estas tareas de ant necesitaremos tener este fichero en el <em>classpath</em>. Si estamos utilizando la versi&oacute;n de <em>ant</em> incluida en Eclipse deberemos configurarlo para que incluya esta librer&iacute;a al ejecutar <em>ant</em>. Para ello nos vamos a <em>Window &gt; Preferences</em> e introducimos este fichero en el <em>classpath</em> de <em>ant</em>:</p>
<p>
<img alt="" content-width="10cm" height="370" src="imagenes/eclipse.gif" width="500"></p>
<p>Una vez tenemos esta librer&iacute;a de tareas en el <em>classpath</em>, deberemos declarar estas tareas dentro de nuestro fichero <span class="codefrag">build.xml</span> para poder utilizarlas. Las tareas disponibles son:</p>
<pre class="code">&lt;taskdef name="<strong>deploy</strong>" 
         classname="org.apache.catalina.ant.DeployTask"/&gt;
&lt;taskdef name="<strong>install</strong>" 
         classname="org.apache.catalina.ant.InstallTask"/&gt;
&lt;taskdef name="<strong>list</strong>" 
         classname="org.apache.catalina.ant.ListTask"/&gt;
&lt;taskdef name="<strong>reload</strong>" 
         classname="org.apache.catalina.ant.ReloadTask"/&gt;
&lt;taskdef name="<strong>remove</strong>" 
         classname="org.apache.catalina.ant.RemoveTask"/&gt;
&lt;taskdef name="<strong>resources</strong>" 
         classname="org.apache.catalina.ant.ResourcesTask"/&gt;
&lt;taskdef name="<strong>roles</strong>" 
         classname="org.apache.catalina.ant.RolesTask"/&gt;
&lt;taskdef name="<strong>start</strong>" 
         classname="org.apache.catalina.ant.StartTask"/&gt;
&lt;taskdef name="<strong>stop</strong>" 
         classname="org.apache.catalina.ant.StopTask"/&gt;
&lt;taskdef name="<strong>undeploy</strong>" 
         classname="org.apache.catalina.ant.UndeployTask"/&gt;</pre>
<p>Vamos a ver ahora como utilizar las tareas principales de Tomcat.</p>
<p>
<strong><em>Despliegue</em></strong>
</p>
<p>Para desplegar una aplicaci&oacute;n podemos utilizar la tarea <span class="codefrag">deploy</span> como se muestra a continuaci&oacute;n:</p>
<pre class="code">&lt;target name="deploy" depends="dist" description="Despliega la aplicacion"&gt;  
	&lt;deploy <strong>url</strong>="${manager.url}"
	        <strong>username</strong>="${manager.nombre}"
	        <strong>password</strong>="${manager.passwd}"
	        <strong>path</strong>="${app.path}"
	        <strong>war</strong>="file:${dist.home}/${war.name}"/&gt;
&lt;/target&gt;</pre>
<p>Donde <span class="codefrag">${manager.url}</span> es la direcci&oacute;n en la que se encuentra el manager de Tomcat. Normalmente esta URL ser&aacute; la siguiente:</p>
<pre class="code">http://localhost:8080/manager</pre>
<p>Si tenemos el servidor en nuestra m&aacute;quina local en el puerto <span class="codefrag">8080</span>. Para poder acceder a este manager debemos indicar tambi&eacute;n el nombre y el password de alg&uacute;n usuario con el rol <span class="codefrag">manager</span>, ya que no se debe permitir que cualquier usuario pueda desplegar y modificar las aplicaciones del servidor. Si no contamos con este usuario deberemos crearlo como vimos en el punto anterior.</p>
<p>Sobre la aplicaci&oacute;n que vamos a desplegar, deberemos indicar la ruta que le vamos a asignar al contexto (<span class="codefrag">path</span>) y que la identificar&aacute; dentro del servidor, y adem&aacute;s deberemos proporcionar en <span class="codefrag">war</span> el fichero WAR que contiene la aplicaci&oacute;n web que vamos a desplegar.</p>
<p>
<strong><em>Eliminar la aplicaci&oacute;n</em></strong>
</p>
<p>Podemos eliminar de forma permanente una aplicaci&oacute;n instalada con la tarea <span class="codefrag">undeploy</span>. Con esta tarea se borrar&aacute;n del servidor todos los ficheros de la aplicaci&oacute;n.</p>
<pre class="code">&lt;target name="undeploy" description="Desinstala la aplicacion"&gt;  
	&lt;undeploy <strong>url</strong>="${manager.url}"
	          <strong>username</strong>="${manager.nombre}"
	          <strong>password</strong>="${manager.passwd}"
	          <strong>path</strong>="${app.path}"/&gt;
&lt;/target&gt;</pre>
<p>En este caso, al igual que con la tarea anterior, debemos proporcionar la URL del manager y el nombre y el password de un usuario administrador que pueda gestionar las aplicaciones del servidor.</p>
<p>Adem&aacute;s tendremos que indicar la ruta de la aplicaci&oacute;n que queremos eliminar. Esta ruta, como hemos visto anteriormente, ser&aacute; la que identifique cada aplicaci&oacute;n, y por lo tanto deberemos proporcionarla siempre que queramos realizar alguna operaci&oacute;n con cualquiera de las aplicaciones, para indicar a qu&eacute; aplicaci&oacute;n nos referimos.</p>
<p>
<strong><em>Lista de aplicaciones</em></strong>
</p>
<p>Podemos obtener una lista de todas las aplicaciones instaladas en el servidor utilizando la tarea <span class="codefrag">list</span>. </p>
<pre class="code">&lt;target name="list" description="Lista las aplicaciones instaladas"&gt;  
	&lt;list <strong>url</strong>="${manager.url}"        
	      <strong>username</strong>="${manager.nombre}"
	      <strong>password</strong>="${manager.passwd}"/&gt;
&lt;/target&gt;</pre>
<p>Esta tarea mostrar&aacute; una lista de todas las aplicaciones y el estado de las mismas, adem&aacute;s de la ruta donde est&aacute;n instaladas en el servidor. </p>
<p>
<strong><em>Detener, reanudar y recargar</em></strong>
</p>
<p>Si queremos que una aplicaci&oacute;n deje de estar disponible al acceder al servidor desde la web, pero no queremos eliminarla, podemos detenerla utilizando la tarea <span class="codefrag">stop</span>:</p>
<pre class="code">&lt;target name="stop" description="Detiene la aplicacion"&gt;  
	&lt;stop <strong>url</strong>="${manager.url}"
	      <strong>username</strong>="${manager.nombre}"
	      <strong>password</strong>="${manager.passwd}"
	      <strong>path</strong>="${app.path}"/&gt;
&lt;/target&gt;</pre>
<p>Posteriormente podremos volver a reanudar su ejecuci&oacute;n para que la aplicaci&oacute;n vuelva a estar disponible con <span class="codefrag">start</span>:</p>
<pre class="code">&lt;target name="start" description="Reanuda la aplicacion"&gt;  
	&lt;start <strong>url</strong>="${manager.url}"
	       <strong>username</strong>="${manager.nombre}"
	       <strong>password</strong>="${manager.passwd}"
	       <strong>path</strong>="${app.path}"/&gt;
&lt;/target&gt;</pre>
<p>Cuando hayamos hecho cambios en la aplicaci&oacute;n, es posible que nos interese que Tomcat recargue la aplicaci&oacute;n para que se reflejen los cambios realizados. Podremos recargar una aplicaci&oacute;n con la tarea <span class="codefrag">reload</span>:</p>
<pre class="code">&lt;target name="reload" description="Recarga la aplicacion"&gt;  
	&lt;reload<strong> url</strong>="${manager.url}"
	        <strong>username</strong>="${manager.nombre}"            
	        <strong>password</strong>="${manager.passwd}"
	        <strong>path</strong>="${app.path}"/&gt;
&lt;/target&gt;</pre>
<p>
<strong><em>Instalaci&oacute;n temporal</em></strong>
</p>
<p>En lugar de desplegar una aplicaci&oacute;n, podemos instalarla de forma temporal. La diferencia es que si realizamos una instalaci&oacute;n temporal, la aplicaci&oacute;n estar&aacute; disponible en el servidor tras instalarla, como si hubiese sido desplegada, pero la pr&oacute;xima vez que se inicie el servidor esta aplicaci&oacute;n ya no estar&aacute;. </p>
<p>Para realizar esta instalaci&oacute;n temporal podemos utilizar la tarea <span class="codefrag">install</span>:</p>
<pre class="code">&lt;target name="install" depends="dist" description="Instala la aplicacion"&gt;  
	&lt;install <strong>url</strong>="${manager.url}"           
	         <strong>username</strong>="${manager.nombre}"
	         <strong>password</strong>="${manager.passwd}"
	         <strong>path</strong>="${app.path}"
	         <strong>war</strong>="file:${dist.home}/${war.name}"/&gt;
&lt;/target&gt;</pre>
<p>Para eliminar las aplicaciones instaladas de forma temporal, utilizaremos la tarea <span class="codefrag">remove</span>:</p>
<pre class="code">&lt;target name="remove" description="Desinstala la aplicacion"&gt;  
	&lt;remove <strong>url</strong>="${manager.url}"
	        <strong>username</strong>="${manager.nombre}"
	        <strong>password</strong>="${manager.passwd}"
	        <strong>path</strong>="${app.path}" /&gt;
&lt;/target&gt;</pre>
<p>
<strong><em>Ejemplo completo</em></strong>
</p>
<p>Vamos a ver a continuaci&oacute;n un ejemplo de un fichero <span class="codefrag">build.xml</span> completo que podremos utilizar para desarrollar nuestras aplicaciones.</p>
<pre class="code">&lt;project name="AplicWeb" default="compile" basedir="."&gt;  

&lt;!-- Propiedades --&gt;  

&lt;property name="catalina.home" value="/home/j2ee/jakarta-tomcat-4.1.29"/&gt;  
&lt;property name="manager.url" value="http://localhost:8080/manager"/&gt;  
&lt;property name="manager.nombre" value="admin"/&gt;  
&lt;property name="manager.passwd" value="j2ee"/&gt;  
&lt;property name="app.name" value="aplic"/&gt;  
&lt;property name="app.path" value="/${app.name}"/&gt;  
&lt;property name="app.home" value="${catalina.home}/webapps/${app.name}"/&gt;  
&lt;property name="war.name" value="${app.name}.war"/&gt;  
&lt;property name="build.home" value="${basedir}/build"/&gt;  
&lt;property name="dist.home" value="${basedir}/dist"/&gt;  
&lt;property name="docs.home" value="${basedir}/docs"/&gt;  
&lt;property name="src.home" value="${basedir}/src"/&gt;  
&lt;property name="web.home" value="${basedir}/web"/&gt;
&lt;property name="compile.debug" value="true"/&gt;
&lt;property name="compile.deprecation" value="false"/&gt;
&lt;property name="compile.optimize" value="true"/&gt;  

&lt;!-- Declaracion de tareas de Tomcat --&gt;  

&lt;taskdef name="deploy" 
         classname="org.apache.catalina.ant.DeployTask"/&gt;  
&lt;taskdef name="install" 
         classname="org.apache.catalina.ant.InstallTask"/&gt;  
&lt;taskdef name="list" 
         classname="org.apache.catalina.ant.ListTask"/&gt;  
&lt;taskdef name="reload" 
         classname="org.apache.catalina.ant.ReloadTask"/&gt;  
&lt;taskdef name="remove" 
         classname="org.apache.catalina.ant.RemoveTask"/&gt;  
&lt;taskdef name="resources" 
         classname="org.apache.catalina.ant.ResourcesTask"/&gt;  
&lt;taskdef name="roles" 
         classname="org.apache.catalina.ant.RolesTask"/&gt;  
&lt;taskdef name="start" 
         classname="org.apache.catalina.ant.StartTask"/&gt;  
&lt;taskdef name="stop" 
         classname="org.apache.catalina.ant.StopTask"/&gt;  
&lt;taskdef name="undeploy" 
         classname="org.apache.catalina.ant.UndeployTask"/&gt;  

&lt;!-- Classpath --&gt;  

&lt;path id="compile.classpath"&gt;    
	&lt;pathelement location="${catalina.home}/common/classes"/&gt;    
	&lt;fileset dir="${catalina.home}/common/endorsed"&gt;      
		&lt;include name="*.jar"/&gt;    
	&lt;/fileset&gt;    
	&lt;fileset dir="${catalina.home}/common/lib"&gt;      
		&lt;include name="*.jar"/&gt;    
	&lt;/fileset&gt;    
	&lt;pathelement location="${catalina.home}/shared/classes"/&gt;    
	&lt;fileset dir="${catalina.home}/shared/lib"&gt;      
		&lt;include name="*.jar"/&gt;    
	&lt;/fileset&gt;  
&lt;/path&gt;  

&lt;!-- Objetivos --&gt;  

&lt;target name="all" depends="clean,compile" description="Compila todo"/&gt;  
&lt;target name="clean" description="Borra directorios build, dist y docs"&gt;    
	&lt;delete dir="${build.home}"/&gt;    
	&lt;delete dir="${dist.home}"/&gt;    
	&lt;delete dir="${docs.home}"/&gt;  
&lt;/target&gt;  
&lt;target name="compile" depends="prepare" description="Compila los .java"&gt;
	&lt;javac srcdir="${src.home}" destdir="${build.home}/WEB-INF/classes"
	       debug="${compile.debug}"
	       deprecation="${compile.deprecation}"
	       optimize="${compile.optimize}"&gt;
		&lt;classpath refid="compile.classpath"/&gt;
	&lt;/javac&gt;  
&lt;/target&gt;  
&lt;target name="prepare"&gt;    
	&lt;mkdir dir="${build.home}"/&gt;    
	&lt;mkdir dir="${build.home}/WEB-INF"/&gt;    
	&lt;mkdir dir="${build.home}/WEB-INF/classes"/&gt;    
	&lt;mkdir dir="${build.home}/WEB-INF/lib"/&gt;    
	&lt;copy todir="${build.home}"&gt;      
		&lt;fileset dir="${web.home}"/&gt;    
	&lt;/copy&gt;  
&lt;/target&gt;  
&lt;target name="dist" depends="compile" 
        description="Crea el fichero WAR de la aplicacion"&gt;    
	&lt;mkdir dir="${dist.home}"/&gt;    
	&lt;jar jarfile="${dist.home}/${war.name}" basedir="${build.home}"/&gt;  
&lt;/target&gt;  
&lt;target name="javadoc" depends="compile" 
        description="Genera documentacion Javadoc"&gt;    
	&lt;mkdir dir="${docs.home}"/&gt;    
	&lt;javadoc sourcepath="${src.home}" destdir="${docs.home}"
	         packagenames="*"&gt;      
		&lt;classpath refid="compile.classpath"/&gt;    
	&lt;/javadoc&gt;  
&lt;/target&gt;  
&lt;target name="deploy" depends="dist" description="Despliega la aplicacion"&gt;    
	&lt;deploy url="${manager.url}" 
	        username="${manager.nombre}" 
	        password="${manager.passwd}"            
	        path="${app.path}"            
	        war="file:${dist.home}/${war.name}"/&gt;  
&lt;/target&gt;  
&lt;target name="undeploy" description="Desinstala la aplicacion"&gt;    
	&lt;undeploy url="${manager.url}"
	          username="${manager.nombre}"
	          password="${manager.passwd}"
	          path="${app.path}"/&gt;  
&lt;/target&gt;
&lt;target name="list" description="Lista las aplicaciones instaladas"&gt;    
	&lt;list url="${manager.url}"          
	      username="${manager.nombre}"
	      password="${manager.passwd}"/&gt;  
&lt;/target&gt;
&lt;/project&gt;</pre>
</div>

<a name="N103AB"></a><a name="Configuraci%C3%B3n+de+Tomcat"></a>
<h2 class="underlined_10">Configuraci&oacute;n de Tomcat</h2>
<div class="section">
<a name="N103B1"></a><a name="Formas+de+cambiar+la+configuraci%C3%B3n"></a>
<h3 class="underlined_5">Formas de cambiar la configuraci&oacute;n</h3>
<p>La configuraci&oacute;n de Tomcat est&aacute; almacenada en cuatro ficheros que se encuentran en el directorio <strong><span class="codefrag">conf</span></strong>. Tres de ellos est&aacute;n en formato XML y el cuarto es un fichero de pol&iacute;ticas de seguridad en el formato est&aacute;ndar de Java:</p>
<ul>
			
<li>
<span class="codefrag">server.xml</span>: el fichero principal de configuraci&oacute;n.</li>
			
<li>
<span class="codefrag">web.xml</span>: es un fichero en el formato est&aacute;ndar para aplicaciones web con servlets, que contiene la configuraci&oacute;n global a todas las aplicaciones.</li>
			
<li>
<span class="codefrag">tomcat-users.xml</span>: lista de usuarios y contrase&ntilde;as para autentificaci&oacute;n.</li>
			
<li>
<span class="codefrag">catalina.policy</span>: pol&iacute;ticas de seguridad para la ejecuci&oacute;n del servidor.</li>
		
</ul>
<p>Adem&aacute;s se puede cambiar gran parte de la configuraci&oacute;n a trav&eacute;s de la aplicaci&oacute;n de administraci&oacute;n.</p>
<a name="N103D9"></a><a name="Configurar+el+host"></a>
<h3 class="underlined_5">Configurar el host</h3>
<p>Mediante el elemento <span class="codefrag">Host</span> se define la configuraci&oacute;n para un host o host virtual</p>
<pre class="code">&lt;Host name="localhost" debug="0" appBase="webapps" u
      npackWARs="true" autoDeploy="true"&gt;...</pre>
<p>Algunos de los principales atributos de este elemento son los siguientes:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
			
<tr>
	      		
<th colspan="1" rowspan="1"><strong>Atributo</strong></th>
	      		<th colspan="1" rowspan="1"><strong>Significado</strong></th>
	      		<th colspan="1" rowspan="1"><strong>Valor por defecto</strong></th>
	    	
</tr>
	    	
<tr>
	      		
<td colspan="1" rowspan="1"><span class="codefrag">name</span></td>
	      		<td colspan="1" rowspan="1">nombre del host o host virtual</td>
	      		<td colspan="1" rowspan="1">ninguno</td>
	    	
</tr>
	    	
<tr>
	      		
<td colspan="1" rowspan="1"><span class="codefrag">debug</span></td>
	      		<td colspan="1" rowspan="1">nivel de mensajes de depuraci&oacute;n</td>
	      		<td colspan="1" rowspan="1">0</td>
	    	
</tr>
	    	
<tr>
	      		
<td colspan="1" rowspan="1"><span class="codefrag">appBase</span></td>
	      		<td colspan="1" rowspan="1">directorio donde se instalar&aacute;n las aplicaciones de este host (si es relativa, la ruta se supone con respecto al directorio de Tomcat)</td>
	      		<td colspan="1" rowspan="1">ninguno</td>
	    	
</tr>
	    	
<tr>
	      		
<td colspan="1" rowspan="1"><span class="codefrag">unpackWARs</span></td>
	      		<td colspan="1" rowspan="1">si es <span class="codefrag">true</span>, las aplicaciones empaquetadas en WAR se desempaquetan antes de ejecutarse</td>
	      		<td colspan="1" rowspan="1"><span class="codefrag">true</span></td>
	    	
</tr>
	    	
<tr>
	      		
<td colspan="1" rowspan="1"><span class="codefrag">autoDeploy</span></td>
	      		<td colspan="1" rowspan="1">si es <span class="codefrag">true</span>, se utiliza el despliegue autom&aacute;tico de aplicaciones</td>
	      		<td colspan="1" rowspan="1"><span class="codefrag">true</span></td>
	    	
</tr>
	    	
<tr>
	      		
<td colspan="1" rowspan="1"><span class="codefrag">liveDeploy</span></td>
	      		<td colspan="1" rowspan="1">si es <span class="codefrag">true</span>, se utiliza despliegue autom&aacute;tico sin necesidad de rearrancar Tomcat </td>
	      		<td colspan="1" rowspan="1"><span class="codefrag">true</span></td>
	    	
</tr>
		
</table>
<p>El despliegue autom&aacute;tico de aplicaciones es una interesante caracter&iacute;stica que permite instalarlas sin m&aacute;s que dejar el WAR o la estructura de directorios de la aplicaci&oacute;n dentro del directorio <span class="codefrag">appBase</span>. Esta caracter&iacute;stica se puede desactivar poniendo <span class="codefrag">autoDeploy</span> y <span class="codefrag">liveDeploy</span> a <span class="codefrag">false</span>. Veremos m&aacute;s sobre ello en el punto siguiente.</p>
</div>

<a name="N10493"></a><a name="Configuraci%C3%B3n+de+aplicaciones+web"></a>
<h2 class="underlined_10">Configuraci&oacute;n de aplicaciones web</h2>
<div class="section">
<a name="N10499"></a><a name="Configuraci%C3%B3n+desde+Tomcat%3A+el+contexto"></a>
<h3 class="underlined_5">Configuraci&oacute;n desde Tomcat: el contexto</h3>
<p>Aunque el comportamiento interno de cada aplicaci&oacute;n se define desde su propio fichero <span class="codefrag">web.xml</span>, se pueden especificar tambi&eacute;n sus caracter&iacute;sticas a nivel global.</p>
<p>
<strong>D&oacute;nde configurar la aplicaci&oacute;n</strong>
</p>
<p>Para configurar una aplicaci&oacute;n web en Tomcat se puede:</p>
<ul>
			
<li>Crear un nuevo elemento <span class="codefrag">Context</span> dentro del fichero de configuraci&oacute;n <span class="codefrag">server.xml</span>
</li>
			
<li>
				
<p>Utilizar el despliegue autom&aacute;tico de aplicaciones, en cuyo caso se puede configurar la aplicaci&oacute;n:</p>
				
<ul>
    				
<li>Definiendo un elemento <span class="codefrag">Context</span> en un fichero XML independiente dentro del directorio <span class="codefrag">conf/Catalina/nombre_del_host/</span> (en nuestro caso el nombre ser&aacute; localhost).</li>
					
<li>Dejando un WAR con la aplicaci&oacute;n o bien la estructura de directorios que la componen en el mismo directorio <span class="codefrag">appBase</span>. En este caso, Tomcat despliega de manera autom&aacute;tica la aplicaci&oacute;n, y sus propiedades se tomar&aacute;n del elemento <span class="codefrag">DefaultContext</span> del fichero de configuraci&oacute;n <span class="codefrag">server.xml</span>.</li>
				
</ul>
				
<p>Cuando se instala una aplicaci&oacute;n con el <em>manager</em>, si est&aacute; activado el despliegue autom&aacute;tico es simplemente como si hubi&eacute;ramos dejado manualmente la aplicaci&oacute;n en el directorio <span class="codefrag">appBase</span>. Si se desactiva el despliegue autom&aacute;tico (poniendo <span class="codefrag">liveDeploy</span> y <span class="codefrag">autoDeploy</span> a false en el <span class="codefrag">Host</span>), entonces el <em>manager</em> crea un <span class="codefrag">Context</span> en el <span class="codefrag">server.xml </span>o bien lo toma del fichero XML que le indiquemos.</p>
			
</li>
		
</ul>
<p>
<strong>El elemento "Context"</strong>
</p>
<p>Como ya se ha comentado, un elemento <span class="codefrag">Context</span> representa una aplicaci&oacute;n web. Cada una de ellas debe tener un path &uacute;nico, definido mediante el atributo <span class="codefrag">path</span>. Adem&aacute;s, se debe definir un contexto con <span class="codefrag">path</span> vac&iacute;o que se considera la aplicaci&oacute;n web por defecto, utilizada para resolver aquellas peticiones que no encajen con ninguno de los otros contextos.</p>
<p> A continuaci&oacute;n se muestran algunos de sus atributos principales:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
		    
<tr>
		      
<th colspan="1" rowspan="1"><strong>Atributo</strong></th>
		      <th colspan="1" rowspan="1"><strong>Significado</strong></th>
		      <th colspan="1" rowspan="1"><strong>Valor por defecto</strong></th>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">crossContext</span></td>
		      <td colspan="1" rowspan="1">indica si la aplicaci&oacute;n web puede comunicarse con otras</td>
		      <td colspan="1" rowspan="1"><span class="codefrag">false</span> (por razones de seguridad)</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">debug</span></td>
		      <td colspan="1" rowspan="1">nivel de mensajes de depuraci&oacute;n</td>
		      <td colspan="1" rowspan="1">0</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">docBase</span></td>
		      <td colspan="1" rowspan="1">directorio donde est&aacute; la aplicaci&oacute;n, bien especificado de modo absoluto o con respecto al <span class="codefrag">appBase</span> del Host</td>
		      <td colspan="1" rowspan="1">ninguno</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">path</span></td>
		      <td colspan="1" rowspan="1"><em>path</em> de esta aplicaci&oacute;n, que se hace coincidir con la URL de la petici&oacute;n para ver qu&eacute; aplicaci&oacute;n debe servirla.</td>
		      <td colspan="1" rowspan="1">ninguno</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">reloadable</span></td>
		      <td colspan="1" rowspan="1">permite monitorizar los cambios de clases en <span class="codefrag">/WEB-INF/classes</span> y <span class="codefrag">/WEB-INF/lib </span>para que no sea necesario reiniciar Tomcat </td>
		      <td colspan="1" rowspan="1"><span class="codefrag">false</span> (se suele poner a <span class="codefrag">true</span> durante el desarrollo)</td>
		    
</tr>
		
</table>
<a name="N1058D"></a><a name="Configuraci%C3%B3n+desde+Tomcat%3A+los"></a>
<h3 class="underlined_5">Configuraci&oacute;n desde Tomcat: los valves</h3>
<p>Un <strong>valve</strong> es un componente que se inserta en el ciclo de procesamiento de la petici&oacute;n. As&iacute;, se pueden filtrar peticiones "sospechosas" de ser ataques, no aceptar peticiones salvo que sean de determinados <em>hosts</em>, etc. Esto se puede hacer a nivel global (dentro del <span class="codefrag">engine</span>), para un host en concreto (dentro de <span class="codefrag">host</span>) o para una &uacute;nica aplicaci&oacute;n (dentro de <span class="codefrag">context</span>). Tomcat viene con varios <em>valves</em> predefinidos (que no son m&aacute;s que clases Java) , aunque el usuario puede escribir los suyos propios.</p>
<p>
<strong>Registro de accesos (<em>access log valve</em>)</strong>
</p>
<p>Crea un registro o <em>log</em> de accesos en el formato "est&aacute;ndar" para servidores web. Este <em>log</em> puede ser luego analizado con alguna herramienta para chequear el n&uacute;mero de accesos, el tiempo que permanece cada usuario en el sitio, etc. Para crear un registro de accesos, introducir en el <span class="codefrag">server.xml</span> un elemento similar al siguiente:</p>
<pre class="code">&lt;Valve className="org.apache.catalina.valves.AccessLogValve"
       directory="logs" prefix="localhost_access_log." suffix=".txt"
       pattern="common" resolveHosts="false"/&gt;</pre>
<p>Seg&uacute;n el nivel en el que se introduzca, se pueden registrar los accesos en todo el <span class="codefrag">host</span> o bien solo dentro de una aplicaci&oacute;n (<span class="codefrag">context</span>). Los atributos son los siguientes:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
		    
<tr>
		      
<th colspan="1" rowspan="1"><strong>Atributo</strong></th>
		      <th colspan="1" rowspan="1"><strong>Significado</strong></th>
		      <th colspan="1" rowspan="1"><strong>Valor por defecto</strong></th>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">className</span></td>
		      <td colspan="1" rowspan="1">clase Java que implementa el <em>valve</em>. En este caso debe ser <span class="codefrag">org.apache.catalina.valves.AccessLogValve</span></td>
		      <td colspan="1" rowspan="1">ninguno</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">directory</span></td>
		      <td colspan="1" rowspan="1">trayectoria absoluta o relativa donde se guardan los ficheros de <em>log</em>. Si es relativa, se interpreta con respecto al directorio donde est&aacute; instalado Tomcat.</td>
		      <td colspan="1" rowspan="1"><span class="codefrag">logs</span> (relativo al dir. de instalaci&oacute;n)</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">pattern</span></td>
		      <td colspan="1" rowspan="1">formato del <em>log</em>. Se puede utilizar las palabras clave <span class="codefrag">common</span> o <span class="codefrag">combined</span> o bien poner un conjunto de especificadores de formato</td>
		      <td colspan="1" rowspan="1">ninguno</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">prefix</span></td>
		      <td colspan="1" rowspan="1">prefijo a&ntilde;adido al nombre del fichero de <em>log</em></td>
		      <td colspan="1" rowspan="1"><span class="codefrag">access_log</span></td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">resolveHosts</span></td>
		      <td colspan="1" rowspan="1">poner a true para registrar el nombre del host que hace la petici&oacute;n adem&aacute;s de su IP</td>
		      <td colspan="1" rowspan="1"><span class="codefrag">?</span></td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">suffix</span></td>
		      <td colspan="1" rowspan="1">sufijo a&ntilde;adido al nombre del fichero de log</td>
		      <td colspan="1" rowspan="1">ninguno</td>
		    
</tr>
		
</table>
<p>el nombre del fichero de <em>log</em> se compone con el prefijo asignado a trav&eacute;s del atributo <span class="codefrag">prefix</span>, la fecha del sistema en el formato <span class="codefrag">aaaa-mm-dd </span>y el sufijo elegido con el atributo <span class="codefrag">suffix</span>. Cuando cambia la fecha autom&aacute;ticamente se crea un nuevo fichero de <em>log</em>.</p>
<p>La informaci&oacute;n que aparece en el <em>log</em> es configurable. Si en el atributo <span class="codefrag">pattern</span> se especifica el valor <span class="codefrag">common</span>, se utiliza el formato est&aacute;ndar, t&iacute;pico de otros servidores web como Apache. Al especificar el valor <span class="codefrag">combined</span>, a la informaci&oacute;n anterior se a&ntilde;ade el valor de los campos <span class="codefrag">User-agent </span>y <span class="codefrag">Referer</span> de la petici&oacute;n HTTP. Si estos formatos no cubren nuestras necesidades, se puede hacer uno "a medida" empleando los c&oacute;digos de formato que aparecen en la tabla siguiente:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
		    
<tr>
		      
<th colspan="1" rowspan="1"><strong>C&oacute;digo</strong></th>
		      <th colspan="1" rowspan="1"><strong>Significado</strong></th>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%a</span></td>
		      <td colspan="1" rowspan="1">direcci&oacute;n IP de la m&aacute;quina remota</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%A</span></td>
		      <td colspan="1" rowspan="1">direcci&oacute;n IP de la m&aacute;quina local</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%b</span></td>
		      <td colspan="1" rowspan="1">bytes enviados en el cuerpo de la respuesta (o "-" si son 0)</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%B</span></td>
		      <td colspan="1" rowspan="1">bytes enviados en el cuerpo de la respuesta</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%h</span></td>
		      <td colspan="1" rowspan="1">nombre del host remoto (o IP si el atributo <span class="codefrag">resolveHost</span> es <span class="codefrag">false</span>)</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%H</span></td>
		      <td colspan="1" rowspan="1">protocolo de la petici&oacute;n (casi siempre, <span class="codefrag">http</span>)</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%l</span></td>
		      <td colspan="1" rowspan="1">Nombre l&oacute;gico del usuario remoto</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%m</span></td>
		      <td colspan="1" rowspan="1">M&eacute;todo de petici&oacute;n (<span class="codefrag">GET</span>, <span class="codefrag">POST</span>, etc)</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%p</span></td>
		      <td colspan="1" rowspan="1">puerto local de la petici&oacute;n</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%q</span></td>
		      <td colspan="1" rowspan="1">Par&aacute;metros de la petici&oacute;n (precedidos de un s&iacute;mbolo "<span class="codefrag">?</span>"). <span class="codefrag">null</span> si no hay par&aacute;metros</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%r</span></td>
		      <td colspan="1" rowspan="1">primera l&iacute;nea de la petici&oacute;n</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%s</span></td>
		      <td colspan="1" rowspan="1">c&oacute;digo de estado de la respuesta</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%t</span></td>
		      <td colspan="1" rowspan="1">fecha y hora</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%u</span></td>
		      <td colspan="1" rowspan="1">usuario remoto, si se conoce</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%U</span></td>
		      <td colspan="1" rowspan="1">URL pedida</td>
		    
</tr>
		    
<tr>
		      
<td colspan="1" rowspan="1"><span class="codefrag">%v</span></td>
		      <td colspan="1" rowspan="1">nombre del servidor local</td>
		    
</tr>
		
</table>
<p>
<strong>Filtro de hosts y de peticiones(<em>remote host filter</em> y <em>remote address filter valve</em>)</strong>
</p>
<p>Sirven para permitir o bloquear el acceso desde determinados host o desde determinadas direcciones IP. El nombre de los hosts o rango de direcciones se puede especificar mediante expresiones regulares. Por ejemplo, para permitir el acceso a la aplicaci&oacute;n de administraci&oacute;n &uacute;nicamente desde el host local se introducir&iacute;a en el <span class="codefrag">server.xml </span>algo como</p>
<pre class="code">&lt;Context path="/admin" docBase="admin"&gt;
	...
	<strong>&lt;Valve className="org.apache.catalina.valves.RemoteAddrValve"
	       allow="127.0.0.1" /&gt;</strong>
	...
&lt;/Context&gt;</pre>
<p>El atributo <span class="codefrag">allow</span> sirve para especificar hosts o IPs permitidas y <span class="codefrag">deny</span> para especificar las prohibidas. En caso de no especificar valor para <span class="codefrag">allow</span>, se utilizar&aacute; el de <span class="codefrag">deny</span> para denegar peticiones y se aceptar&aacute; el resto. De manera similar, si no se especifica valor para deny, se permitir&aacute;n peticiones seg&uacute;n el valor de <span class="codefrag">allow</span> y se rechazar&aacute; el resto.</p>
<p>
<strong>Volcado de la petici&oacute;n (<em>request dumper valve</em>)</strong>
</p>
<p>Este valve se puede utilizar para depurar aplicaciones, ya que guarda toda la informaci&oacute;n de la petici&oacute;n HTTP del cliente. No utiliza m&aacute;s atributo que <span class="codefrag">className</span> para indicar el nombre de la clase que implementa este <em>valve</em>:</p>
<pre class="code">&lt;Valve className="org.apache.catalina.valves.RequestDumperValve" /&gt; </pre>
<p>
<strong><em>Autentificaci&oacute;n &uacute;nica (<em>single sign-on valve</em>)</em></strong>
</p>
<p>Se puede utilizar un Valve para que el usuario se identifique en una &uacute;nica aplicaci&oacute;n y autom&aacute;ticamente conserve la misma identidad en todas las aplicaciones del mismo host, sin necesidad de identificarse de nuevo (<em>single sign-on valve</em>). Basta con a&ntilde;adir a nivel de Host un Valve como:</p>
<pre class="code">&lt;Valve className="org.apache.catalina.authenticator.SingleSignOn" /&gt;</pre>
<a name="N107E9"></a><a name="Configuraci%C3%B3n+desde+la+aplicaci%C3%B3n%3A+el+descriptor+de+despliegue"></a>
<h3 class="underlined_5">Configuraci&oacute;n desde la aplicaci&oacute;n: el descriptor de despliegue</h3>
<p>Como hemos dicho anteriormente, el directorio <span class="codefrag">WEB-INF</span> de una aplicaci&oacute;n web con servlets y/o p&aacute;ginas JSP, debe haber un fichero descriptor de despliegue (llamado <strong><span class="codefrag">web.xml</span></strong>) que contenga la informaci&oacute;n relativa a la aplicaci&oacute;n.</p>
<p>Es un fichero XML, que comienza con una cabecera XML que indica la versi&oacute;n y la codificaci&oacute;n de caracteres, y un <span class="codefrag">DOCTYPE</span> que indica el tipo de documento, y la especificaci&oacute;n de servlets que se sigue. La etiqueta ra&iacute;z del documento XML es <strong><span class="codefrag">web-app</span></strong>. As&iacute;, un ejemplo de fichero podr&iacute;a ser:</p>
<pre class="code">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;!DOCTYPE web-app   PUBLIC 
 "-//Sun Microsystems, Inc.//DTD Web Application 2.3//EN"   
 "http://java.sun.com/dtd/web-app_2_3.dtd"&gt;
&lt;<strong>web-app</strong>&gt;  
	&lt;<strong>display-name</strong>&gt;
		Mi Aplicacion Web
	&lt;/<strong>display-name</strong>&gt;
	&lt;<strong>description</strong>&gt;
		Esta es una aplicacion web sencilla a modo de ejemplo
	&lt;/<strong>description</strong>&gt;
&lt;/<strong>web-app</strong>&gt;</pre>
<p>En este caso se utiliza la especificaci&oacute;n 2.3 de servlets o anteriores (para utilizar versiones posteriores habr&iacute;a que cambiar la especificaci&oacute;n en la l&iacute;nea de <span class="codefrag">DOCTYPE</span>). Algunos servidores permiten omitir la cabecera <span class="codefrag">xml</span> y el <span class="codefrag">DOCTYPE</span>, pero s&iacute; es una buena costumbre el ponerlas. </p>
<p>Dentro de la etiqueta ra&iacute;z <span class="codefrag">&lt;web-app&gt;</span> podemos colocar otros elementos que ayuden a establecer la configuraci&oacute;n de nuestra aplicaci&oacute;n web. Dichos elementos deben seguir un orden: podemos omitir los que no se necesiten, pero los que pongamos deben tener una colocaci&oacute;n adecuada en el documento. Veremos a continuaci&oacute;n algunos de ellos, en el orden en que deben aparecer si aparecen (existen otras etiquetas que no veremos aqu&iacute;, y que deb&eacute;is consultar el orden en que ponerlas). En algunos elementos profundizaremos un poco m&aacute;s, por tratarse de elementos gen&eacute;ricos de una aplicaci&oacute;n web (variables globales, etc). En otros (servlets, filtros, etc), simplemente se indicar&aacute; qu&eacute; elementos se tratan, pero su configuraci&oacute;n se explicar&aacute; en temas m&aacute;s espec&iacute;ficos. </p>
<p>
<strong>Orden en las etiquetas del fichero descriptor</strong>
</p>
<p>Se recomienda (y en versiones antiguas de servidores Web como Tomcat es obligatorio) que las etiquetas que pongamos en el fichero descriptor sigan este orden:</p>
<p>
<strong>1. Informaci&oacute;n general de la aplicaci&oacute;n</strong>
</p>
<p>Primero tenemos etiquetas con informaci&oacute;n general: </p>
<ul>
			
<li>
<strong><span class="codefrag">&lt;display-name&gt;</span></strong>: nombre con que deben utilizar las aplicaciones gr&aacute;ficas para referenciar a la aplicaci&oacute;n</li>
			
<li>
<strong><span class="codefrag">&lt;description&gt;</span></strong>: texto descriptivo de la aplicaci&oacute;n</li>
		
</ul>
<p>
<em><strong>Variables globales</strong></em>
</p>
<p>Podemos tener varias etiquetas: </p>
<ul>
			
<li>
				
<p>
<strong><span class="codefrag">&lt;context-param&gt;</span></strong>: para declarar las variables globales a toda la aplicaci&oacute;n web, y sus valores. Dentro tiene dos subetiquetas:</p>
				
<ul>
					
<li>
<strong><span class="codefrag">&lt;param-name&gt;</span></strong>: nombre de la variable o par&aacute;metro</li>
					
<li>
<strong><span class="codefrag">&lt;param-value&gt;</span></strong>: valor de la variable o par&aacute;metro</li>
				
</ul>
			
</li>
		
</ul>
<p>Un ejemplo:</p>
<pre class="code">&lt;context-param&gt;	
	&lt;param-name&gt;param1&lt;/param-name&gt;	
	&lt;param-value&gt;valor1&lt;/param-value&gt;
&lt;/context-param&gt;</pre>
<p>Estos par&aacute;metros pueden leerse desde servlets con el m&eacute;todo <strong><span class="codefrag">getInitParameter</span></strong> del objeto <span class="codefrag">ServletContext</span>.</p>
<p>
<strong>2. Filtros</strong>
</p>
<p>Para el tratamiento de filtros se tienen las etiquetas: </p>
<ul>
			
<li>
<strong><span class="codefrag">&lt;filter&gt;</span></strong>: para asociar un nombre identificativo con la clase que implementa el filtro</li>
			
<li>
<strong><span class="codefrag">&lt;filter-mapping&gt;</span></strong>: para asociar un nombre identificativo de filtro con una URL o patr&oacute;n de URL</li>
		
</ul>
<p>Se pueden tener varias de estas etiquetas, cada una para un filtro.</p>
<p>
<strong>3. Oyentes</strong>
</p>
<p>Se tiene la etiqueta: </p>
<ul>
			
<li>
<strong><span class="codefrag">&lt;listener&gt;</span></strong>: para definir una clase oyente que responde ante eventos en sesiones y contextos (al iniciar, al cerrar, al modificar).</li>
		
</ul>
<p>
<strong>4. Servlets</strong>
</p>
<p>Para definir los servlets en nuestro fichero de configuraci&oacute;n, se tienen las etiquetas:</p>
<ul>
			
<li>
<strong><span class="codefrag">&lt;servlet&gt;</span></strong>: asocia un nombre identificativo con una clase Java que implementa un servlet</li>
			
<li>
<strong><span class="codefrag">&lt;servlet-mapping&gt;</span></strong>: asocia un nombre identificativo de servlet con una URL o patr&oacute;n de URL.</li>
		
</ul>
<p>Se pueden tener varias de estas etiquetas, cada una para un servlet.</p>
<p>
<strong>5. Configuraci&oacute;n de sesi&oacute;n</strong>
</p>
<p>Se tiene la etiqueta: </p>
<ul>
			
<li>
<strong><span class="codefrag">&lt;session-config&gt;</span></strong>: para indicar par&aacute;metros de configuraci&oacute;n de las sesiones.</li>
		
</ul>
<p>Por ejemplo, podemos indicar el tiempo (en minutos) que le damos a una sesi&oacute;n de usuario antes de que el servidor la finalice:</p>
<pre class="code">&lt;session-config&gt;	
	&lt;session-timeout&gt;30&lt;/session-timeout&gt;
&lt;/session-config&gt;</pre>
<p>
<strong>6. P&aacute;ginas de inicio</strong>
</p>
<p>Se tiene la etiqueta: </p>
<ul>
			
<li>
				
<p>
<strong><span class="codefrag">&lt;welcome-file-list&gt;</span></strong>: para indicar qu&eacute; p&aacute;ginas debe buscar Tomcat como p&aacute;ginas de inicio en el caso de que en la URL se indique el directorio, pero no la p&aacute;gina, como por ejemplo:</p>
				
<pre class="code">http://localhost:8080/unadireccion/dir/</pre>
				
<p>Para ello, esta etiqueta tiene una o varias subetiquetas <strong><span class="codefrag">&lt;welcome-file&gt;</span> </strong>para indicar cada una de las posibles p&aacute;ginas</p>
			
</li>
		
</ul>
<p>Por ejemplo, podemos indicar que las p&aacute;ginas por defecto sean <span class="codefrag">index.html </span> o <span class="codefrag">index.jsp </span>con:</p>
<pre class="code">&lt;welcome-file-list&gt;	
	&lt;welcome-file&gt;index.html&lt;/welcome-file&gt;	
	&lt;welcome-file&gt;index.jsp&lt;/welcome-file&gt;
&lt;/welcome-file-list&gt;</pre>
<p>Las p&aacute;ginas se buscan en el orden en que se especifican en esta etiqueta.</p>
<p>
<strong>7. Librer&iacute;as de tags</strong>
</p>
<p>Se tiene la etiqueta: </p>
<ul>
			
<li>
<strong><span class="codefrag">taglib</span></strong>: para cargar una librer&iacute;a de tags para utilizar en p&aacute;ginas JSP. Podemos tener una o varias de estas etiquetas.</li>
		
</ul>
<p>
<strong>8. Seguridad</strong>
</p>
<p>Para gestionar la seguridad en las aplicaciones Web se tienen las etiquetas: </p>
<ul>
			
<li>
<strong><span class="codefrag">security-constraint</span></strong>: permite especificar qu&eacute; URLs de la aplicaci&oacute;n deben protegerse</li>
			
<li>
<strong><span class="codefrag">login-config</span></strong>: indica c&oacute;mo debe autorizar el servidor a los usuarios que quieran acceder a las URLs protegidas (indicadas con <span class="codefrag">security-constraint</span>)</li>
			
<li>
<strong><span class="codefrag">security-role</span></strong>: da una lista de roles en los que se encuadrar&aacute;n los usuarios que intenten acceder a recursos protegidos. </li>
		
</ul>
<p>Existen otras etiquetas internas, relacionadas con la seguridad, que no se encuentran detalladas aqu&iacute;.</p>
</div>


<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006 Depto. CCIA</div>
</div>
</body>
</html>
