<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Herramientas para aplicaciones web</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores Web" src="images/baner_j2ee_der.gif" title="Servidores Web"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores Web</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores Web</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Servidores Web">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 4</div>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion04-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Herramientas para aplicaciones web</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Desarrollo+y+despliegue+con+WebTools">Desarrollo y despliegue con WebTools</a>
<ul class="minitoc">
<li>
<a href="#Gesti%C3%B3n+de+servidores+web+con+WebTools">Gesti&oacute;n de servidores web con WebTools</a>
</li>
<li>
<a href="#Creaci%C3%B3n+y+desarrollo+de+una+aplicaci%C3%B3n+web+con+WebTools">Creaci&oacute;n y desarrollo de una aplicaci&oacute;n web con WebTools</a>
</li>
<li>
<a href="#Despliegue+de+aplicaciones+web+con+WebTools">Despliegue de aplicaciones web con WebTools</a>
</li>
</ul>
</li>
<li>
<a href="#Pooling+de+conexiones+en+Tomcat">Pooling de conexiones en Tomcat</a>
</li>
<li>
<a href="#Introducci%C3%B3n+a+las+pruebas+de+aplicaciones+web+con+Cactus">Introducci&oacute;n a las pruebas de aplicaciones web con Cactus</a>
<ul class="minitoc">
<li>
<a href="#Instalaci%C3%B3n+de+Cactus">Instalaci&oacute;n de Cactus</a>
</li>
<li>
<a href="#Cactus+y+Ant">Cactus y Ant</a>
</li>
</ul>
</li>
<li>
<a href="#Introducci%C3%B3n+al+logging+en+aplicaciones+web">Introducci&oacute;n al logging en aplicaciones web</a>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Desarrollo+y+despliegue+con+WebTools"></a>
<h2 class="underlined_10">Desarrollo y despliegue con WebTools</h2>
<div class="section">
<p>WebTools es un plugin ya integrado con Eclipse, que permite gestionar aplicaciones web como proyectos, teni&eacute;ndolo todo integrado y a mano para poder empaquetar, probar y desplegar la aplicaci&oacute;n de forma c&oacute;moda. Para ello, desde WebTools podremos, entre otras cosas:</p>
<ul>
		
<li>Gestionar el servidor web sobre el que queremos desplegar y/o probar la aplicaci&oacute;n, pudiendo editar su configuraci&oacute;n, y pararlo y reanudarlo cuando lo necesitemos, desde el propio Eclipse</li>
		
<li>Crear y desarrollar las aplicaciones web que vayamos a desplegar. Para cada una, Eclipse nos organizar&aacute; los ficheros seg&uacute;n la estructura que digamos (carpeta de fuentes Java, carpeta WEB-INF, librer&iacute;as, etc)</li>
		
<li>Desplegar y testear las aplicaciones sobre el servidor tantas veces como queramos, manteniendo siempre el control sobre su ejecuci&oacute;n desde Eclipse</li>
	
</ul>
<p>Para trabajar con este tipo de elementos, trabajaremos desde la perspectiva J2EE de Eclipse. Veremos c&oacute;mo realizar estas tareas a continuaci&oacute;n.</p>
<a name="N10024"></a><a name="Gesti%C3%B3n+de+servidores+web+con+WebTools"></a>
<h3 class="underlined_5">Gesti&oacute;n de servidores web con WebTools</h3>
<p>Para dar de alta en Eclipse el servidor web sobre el que queremos trabajar, vamos a <em>Window - Show View - Servers</em>, para abrir la vista de Servidores, y despu&eacute;s, pinchando sobre ella con el bot&oacute;n derecho, vamos a <em>New - Server</em>. Podemos llegar igualmente desde el men&uacute; <em>Window - Preferences</em>, yendo a la opci&oacute;n <em>Server - Installed Runtimes</em>, y luego pulsando <em>Add</em> para a&ntilde;adir el nuevo servidor. Despu&eacute;s, en la ventana que aparece, simplemente rellenamos los datos del nombre del host (por defecto, <em>localhost</em>), y el tipo de servidor web que usamos.</p>
<p>
<img alt="Configuracion del servidor web en WebTools" content-width="10cm" height="519" src="imagenes/wtserver.jpg" width="513"></p>
<p>Es posible, si no detecta la instalaci&oacute;n, que en un paso posterior nos pida que indiquemos el directorio de instalaci&oacute;n de dicho servidor.</p>
<p>Despu&eacute;s, en la vista <em>Servers</em> ya tendremos a&ntilde;adido el nuevo servidor. Haciendo click con el bot&oacute;n derecho sobre &eacute;l, accedemos a las opciones para pararlo, reanudarlo, asociarle aplicaciones, etc</p>
<p>
<img alt="Gesti&oacute;n del servidor incorporado" content-width="6cm" height="354" src="imagenes/wtserver2.jpg" width="323"></p>
<a name="N10059"></a><a name="Creaci%C3%B3n+y+desarrollo+de+una+aplicaci%C3%B3n+web+con+WebTools"></a>
<h3 class="underlined_5">Creaci&oacute;n y desarrollo de una aplicaci&oacute;n web con WebTools</h3>
<p>Para crear un proyecto de aplicaci&oacute;n web desde WebTools, vamos al men&uacute; <em>File - New - Other - Web - Dynamic Web Project</em>
</p>
<p>
<img alt="Creaci&oacute;n del proyecto web" content-width="12cm" height="513" src="imagenes/wtproyecto.jpg" width="613"></p>
<p>En los siguientes pasos del asistente podemos elegir su configuraci&oacute;n, y las carpetas donde alojar contenido web y fuentes Java. La <strong>estructura de carpetas</strong> que mantendremos en nuestros proyectos web ser&aacute; la siguiente:</p>
<ul>
			
<li>Carpeta <strong>src</strong>: carpeta de fuentes, con todas las clases Java y paquetes que hagamos para nuestra aplicaci&oacute;n (clases auxiliares, servlets, etc)</li>
			
<li>Carpeta <strong>resources</strong>: ser&aacute; una carpeta de fuentes, pero con todos los ficheros auxiliares (por ejemplo, ficheros <span class="codefrag">.properties</span>) que queramos tener disponibles en el CLASSPATH).</li>
			
<li>Carpeta <strong>test</strong>: otra carpeta de fuentes, con las clases de prueba (JUnit) para las clases que tengamos en <span class="codefrag">src</span>. Los nombres de paquetes que tengamos aqu&iacute; ser&aacute;n los mismos que los utilizados en <span class="codefrag">src</span>, y las clases de prueba se llamar&aacute;n igual que las originales, pero acabadas en <span class="codefrag">...Test</span>.</li>
			
<li>
					Carpeta <strong>WebContent</strong>: con la estructura de la aplicaci&oacute;n web. En su carpeta ra&iacute;z podremos colocar las p&aacute;ginas HTML / JSP (organizadas en subcarpetas si queremos)
					<ul>
						
<li>Subcarpeta <strong>WebContent/WEB-INF</strong>: con el fichero descriptor de la aplicaci&oacute;n (<span class="codefrag">web.xml</span>)</li>
						
<li>Subcarpeta <strong>WebContent/WEB-INF/lib</strong>: con las librer&iacute;as JAR que necesite nuestra aplicaci&oacute;n</li>
						
<li>Subcarpeta <strong>WebContent/WEB-INF/classes</strong>: inicialmente vac&iacute;a, en ella se copiar&aacute;n despu&eacute;s autom&aacute;ticamente los ficheros fuente de <span class="codefrag">src</span>
</li>
					
</ul>
			
</li>
			
<li>Carpeta <strong>build</strong>: para dejar la aplicaci&oacute;n web integrada y lista para desplegarse, con los ficheros fuente ya copiados en <span class="codefrag">WEB-INF/classes</span>, y todos los ficheros y directorios ya organizados.</li>
			
<li>Carpeta <strong>dist</strong>: para guardar un fichero WAR con toda la aplicaci&oacute;n de la carpeta <span class="codefrag">build</span> ya empaquetada y lista para distribuirse.</li>
			
<li>Carpeta <strong>conf</strong>: para ficheros de configuraci&oacute;n adicionales de la aplicaci&oacute;n</li>
			
<li>Carpeta <strong>db</strong>: con los scripts y elementos para la base de datos</li>
			
<li>Carpeta <strong>doc</strong>: con ficheros de documentaci&oacute;n</li> 
		
</ul>
<p>Algunas de estas carpetas las crear&aacute; el propio asistente al terminar de crear el proyecto (como <span class="codefrag">src</span>, o <span class="codefrag">WebContent</span> y sus subcarpetas). Otras deberemos crearlas nosotros a mano. Una vez tengamos el proyecto creado, ya podemos irlo desarrollando.</p>
<p>
<strong>Interdependencias entre proyectos</strong>
</p>
<p>En ocasiones deberemos relacionar alg&uacute;n proyecto de clases Java que tengamos hecho, con un nuevo proyecto web que vayamos a hacer, para poder utilizar e incorporar las clases del proyecto Java en nuestro proyecto web. Para ello, vamos con el bot&oacute;n derecho del rat&oacute;n sobre el proyecto, y vamos a sus <em>Properties</em>. En ellas, vamos a <em>Project References</em>, y marcamos con el rat&oacute;n los proyectos que queramos asociar al actual:</p>
<p>
<img alt="Asociaciones entre proyectos" content-width="11cm" height="507" src="imagenes/wtproyectoref.jpg" width="574"></p>
<a name="N100F6"></a><a name="Despliegue+de+aplicaciones+web+con+WebTools"></a>
<h3 class="underlined_5">Despliegue de aplicaciones web con WebTools</h3>
<p>Una vez tengamos la aplicaci&oacute;n web lista para probar en el servidor web, tenemos dos alternativas para desplegarla y probarla:</p>
<ul>
			
<li>Utilizar las facilidades de despliegue sobre el servidor que ofrece WebTools. Esta opci&oacute;n la utilizaremos en fase de desarrollo y depuraci&oacute;n, para probar de forma c&oacute;moda y r&aacute;pida los cambios que vayamos haciendo sobre nuestra aplicaci&oacute;n.</li>
			
<li>Utilizar un fichero <span class="codefrag">build.xml</span> de Ant con las tareas necesarias para compilar, empaquetar y desplegar. Este m&eacute;todo se vio en la sesi&oacute;n 2 del m&oacute;dulo, y lo utilizaremos cuando tengamos la aplicaci&oacute;n ya probada, y queramos hacer el empaquetamiento y despliegue definitivo.</li>
		
</ul>
<p>Para poder desplegar la aplicaci&oacute;n utilizando WebTools, simplemente tenemos que pinchar con el bot&oacute;n derecho sobre el proyecto web y elegir la opci&oacute;n <em>Run As - Run on Server</em>. Inicialmente, ya le hemos asignado el servidor al proyecto, cuando lo creamos, as&iacute; que WebTools ya sabe sobre qu&eacute; servidor desplegar los cambios.</p>
</div>

<a name="N10113"></a><a name="Pooling+de+conexiones+en+Tomcat"></a>
<h2 class="underlined_10">Pooling de conexiones en Tomcat</h2>
<div class="section">
<p>Las aplicaciones web que acceden a una base de datos son muy frecuentes. Si la aplicaci&oacute;n es para uso particular, o para un uso muy reducido y poco concurrente, podemos configurar un acceso por JDBC simple desde las diferentes p&aacute;ginas y clases que la componen.</p>
<p>Sin embargo, si a la aplicaci&oacute;n va a poder acceder mucha gente concurrentemente, y lanzar consultas o modificaciones de la base de datos desde las p&aacute;ginas, es posible que el servidor falle ante la avalancha de peticiones, y no tenga conexiones preparadas a la base de datos para satisfacer todas las demandas.</p>
<p>Para ello, podemos introducir ciertos elementos de configuraci&oacute;n en ficheros XML de nuestra aplicaci&oacute;n, para preestablecer una bater&iacute;a de conexiones, de forma que Tomcat se encarga de gestionar las que est&aacute;n libres, asignarlas a nuevas peticiones, liberar las de las peticiones que ya no se usan, etc.</p>
<p>Para configurar este pool de conexiones en Tomcat, necesitamos crear/editar dos ficheros de configuraci&oacute;n XML:</p>
<ul>
		
<li>
				
<p>Primero, deberemos crear en una carpeta <strong><span class="codefrag">META-INF</span></strong> dentro de nuestra aplicaci&oacute;n web, un fichero llamado <strong><span class="codefrag">context.xml</span></strong>, con el siguiente contenido:</p>
				
<pre class="code">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;Context&gt;
    &lt;Resource
        name="<strong>miBD</strong>"
        type="javax.sql.DataSource"
        auth="Container"
        username="<strong>root</strong>"
        password="<strong>root</strong>"
        driverClassName="com.mysql.jdbc.Driver"
        url="<strong>jdbc:mysql://localhost:3306/bdprueba?autoReconnect=true</strong>"/&gt;
            
        &lt;ResourceParams name="miBD"&gt;
            
            &lt;parameter&gt;
                &lt;name&gt;maxActive&lt;/name&gt;
                &lt;value&gt;<strong>20</strong>&lt;/value&gt;
            &lt;/parameter&gt;
            
            &lt;parameter&gt;
                &lt;name&gt;maxIdle&lt;/name&gt;
                &lt;value&gt;<strong>5</strong>&lt;/value&gt;
            &lt;/parameter&gt;
            
            &lt;parameter&gt;
                &lt;name&gt;maxWait&lt;/name&gt;
                &lt;value&gt;<strong>10000</strong>&lt;/value&gt;
            &lt;/parameter&gt;
            
        &lt;/ResourceParams&gt;

&lt;/Context&gt;</pre>

			
<p>Se ha establecido as&iacute; un pool de conexiones a una base de datos MySQL. Partiendo de esta premisa, los elementos en negrita son modificables:</p>
			
<ul>
				
<li>
<strong>name:</strong> El atributo <span class="codefrag">name</span> de la etiqueta <span class="codefrag">Resource</span> indica el nombre que le queremos dar al pool de conexiones. Es arbitrario, y totalmente a nuestra elecci&oacute;n</li>
				
<li>
<strong>username y password:</strong> Estos atributos de <span class="codefrag">Resource</span> indican el usuario y password para acceso a la base de datos MySQL</li>
				
<li>
<strong>url:</strong> El atributo <span class="codefrag">url</span> de la etiqueta <span class="codefrag">Resource</span> especifica la URL de conexi&oacute;n a la base de datos. En general, la URL ser&aacute; casi igual que la del ejemplo, cambiando &uacute;nicamente el nombre de la base de datos (<em>bdprueba</em>) por el que nos interese</li>
				
<li>
					
<p>Hay una serie de par&aacute;metros adicionales de configuraci&oacute;n (<span class="codefrag">ResourceParams</span>) para especificar caracter&iacute;sticas del pooling:</p>
					
<ul>
						
<li>
<strong>maxActive:</strong> m&aacute;ximo n&uacute;mero de conexiones a la BD que se mantendr&aacute;n activas</li>
						
<li>
<strong>maxIdle:</strong> m&aacute;ximo n&uacute;mero de conexiones libres que habr&aacute; en el pool (poner 0 para no tener l&iacute;mite). Este par&aacute;metro permitir&aacute; limitar el m&aacute;ximo de conexiones activas en cada momento. Por ejemplo, si <span class="codefrag">maxActive</span> est&aacute; puesto a 100, pero s&oacute;lo tenemos 20 conexiones activas, y permitimos 5 desocupadas, en total habr&aacute; 25 conexiones en el pool en ese momento (luego se crear&aacute;n m&aacute;s si son necesarias)</li>
						
<li>
<strong>maxWait:</strong> tiempo en milisegundos que se deber&aacute; esperar como m&aacute;ximo para recibir una conexi&oacute;n libre (10 segundos, en el ejemplo)</li>
					
</ul>
					
<p>Notar que el atributo <span class="codefrag">name</span> del <span class="codefrag">ResourceParams</span> debe coincidir con el <span class="codefrag">name</span> que le asignamos al <span class="codefrag">Resource</span>, pues es una referencia a &eacute;l.</p>
				
</li>
			
</ul>
			
<p>Tambi&eacute;n es posible poner todos los atributos juntos dentro del <span class="codefrag">Resource</span>:</p>
				
<pre class="code">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;Context&gt;
    &lt;Resource
        name="<strong>miBD</strong>"
        type="javax.sql.DataSource"
        auth="Container"
        username="<strong>root</strong>"
        password="<strong>root</strong>"
        driverClassName="com.mysql.jdbc.Driver"
        url="<strong>jdbc:mysql://localhost:3306/bdprueba?autoReconnect=true</strong>"
        maxActive="20"
        maxIdle="5"
        maxWait="10000"/&gt;            
&lt;/Context&gt;
</pre>
			
		
</li>
		
<li>
				
<p>En segundo lugar, deberemos a&ntilde;adir un bloque a nuestro descriptor de despliegue (<strong><span class="codefrag">WEB-INF/web.xml</span></strong>), que utilice el recurso que hemos creado en el fichero anterior:</p>
				
<pre class="code">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;

&lt;web-app ....&gt;

	...
	
    &lt;resource-ref&gt;
        &lt;res-ref-name&gt;<strong>miBD</strong>&lt;/res-ref-name&gt;
        &lt;res-type&gt;javax.sql.DataSource&lt;/res-type&gt;
        &lt;res-auth&gt;Container&lt;/res-auth&gt;
    &lt;/resource-ref&gt;
    
    ...
    
&lt;/web-app&gt;
</pre>
		
</li>
	
</ul>
<p>Una vez hecho esto, ya podremos utilizar las conexiones de este pool en nuestra aplicaci&oacute;n web, accediendo por JNDI al nombre que le hemos dado al pool de conexiones (<em>miBD</em>, en el ejemplo). Veremos ejemplos de esto m&aacute;s adelante.</p>
</div>

<a name="N101D1"></a><a name="Introducci%C3%B3n+a+las+pruebas+de+aplicaciones+web+con+Cactus"></a>
<h2 class="underlined_10">Introducci&oacute;n a las pruebas de aplicaciones web con Cactus</h2>
<div class="section">
<p>Cactus es una librer&iacute;a de testeo de Jakarta muy &uacute;til para probar el funcionamiento de c&oacute;digo en el lado del servidor, utilizando para ello <em>JUnit</em>. Pensemos que es dif&iacute;cil probar el funcionamiento de una aplicaci&oacute;n que simplemente sirve datos a un cliente (o navegador), ya que para poder hacer las pruebas necesitar&iacute;amos regenerar una petici&oacute;n-respuesta HTTP, y ver c&oacute;mo interact&uacute;an con ella los m&eacute;todos del servidor que queramos probar.</p>
<p>Podemos encontrar m&aacute;s informaci&oacute;n sobre Cactus en: <a href="http://jakarta.apache.org/cactus">http://jakarta.apache.org/cactus</a>
</p>
<p>Cactus implementa una estrategia <em>dentro del contenedor</em>, es decir, las pruebas que se dise&ntilde;en con Cactus se ejecutan dentro del contenedor web en que est&eacute; desplegada la aplicaci&oacute;n web en prueba.</p>
<p>En cuanto a su composici&oacute;n, Cactus se divide en 3 grandes elementos:</p>
<ul>
		
<li>La estructura (framework) de Cactus: el n&uacute;cleo de Cactus, que proporciona la API para implementar las pruebas</li>
		
<li>Los m&oacute;dulos de integraci&oacute;n: aplicaciones y frameworks que facilitan el uso de la estructura principal (por ejemplo, scripts de Ant, plugin para Eclipse, etc)</li>
		
<li>Ejemplos: proyectos simples que demuestran c&oacute;mo escribir las pruebas de Cactus y c&oacute;mo usar los m&oacute;dulos de integraci&oacute;n.</li>
	
</ul>
<a name="N101F8"></a><a name="Instalaci%C3%B3n+de+Cactus"></a>
<h3 class="underlined_5">Instalaci&oacute;n de Cactus</h3>
<p>Como trabajaremos desde Eclipse, necesitamos tener Cactus integrado en &eacute;l. Aparte de eso, s&oacute;lo necesitamos tener instalada una m&aacute;quina virtual Java (1.2 o superior), y un servidor web para aplicaciones J2EE (que cumpla la especificaci&oacute;n 2.2 de servlets, o superior).</p>
<p>Para instalar Cactus, la instalaci&oacute;n se compone de 2 bloques: uno para la parte cliente (donde se forman las peticiones y se env&iacute;an al servidor), y otra para el servidor (donde se ejecutan las pruebas, realmente)</p>
<p>Para la parte del <strong>servidor</strong>, los pasos a seguir son:</p>
<ol>
			
<li>Colocar las librer&iacute;as de Cactus en el classpath (en una aplicaci&oacute;n web, las colocamos en la carpeta <span class="codefrag">WEB-INF/lib</span> de la aplicaci&oacute;n).</li>
			
<li>Colocar tanto las pruebas como las clases a probar tambi&eacute;n en el classpath del servidor (normalmente ir&aacute;n dentro de la subcarpeta <span class="codefrag">WEB-INF/classes</span> de la aplicaci&oacute;n web, en sus correspondientes paquetes).</li>
			
<li>
				
<p>Mapear las URLs de los redirectores de Cactus, dentro del fichero <span class="codefrag">web.xml</span>. Un ejemplo de mapeo podr&iacute;a ser el siguiente:</p>
				
<pre class="code">...
&lt;filter&gt;
	&lt;filter-name&gt;FilterRedirector&lt;/filter-name&gt;
	&lt;filter-class&gt;org.apache.cactus.server.FilterTestRedirector&lt;/filter-class&gt;
&lt;/filter&gt;
&lt;filter-mapping&gt;
	&lt;filter-name&gt;FilterRedirector&lt;/filter-name&gt;
	&lt;url-pattern&gt;/FilterRedirector&lt;/url-pattern&gt;
&lt;/filter-mapping&gt;
&lt;servlet&gt;
	&lt;servlet-name&gt;ServletRedirector&lt;/servlet-name&gt;
	&lt;servlet-class&gt;org.apache.cactus.server.ServletTestRedirector&lt;/servlet-class&gt;
&lt;/servlet&gt;
&lt;servlet&gt;
	&lt;servlet-name&gt;JspRedirector&lt;/servlet-name&gt;
	&lt;jsp-file&gt;/jspRedirector.jsp&lt;/jsp-file&gt;
&lt;/servlet&gt;
&lt;servlet-mapping&gt;
	&lt;servlet-name&gt;ServletRedirector&lt;/servlet-name&gt;
	&lt;url-pattern&gt;/ServletRedirector&lt;/url-pattern&gt;
&lt;/servlet-mapping&gt;
&lt;servlet-mapping&gt;
	&lt;servlet-name&gt;JspRedirector&lt;/servlet-name&gt;
	&lt;url-pattern&gt;/JspRedirector&lt;/url-pattern&gt;
&lt;/servlet-mapping&gt;</pre>
				
<p>Estas l&iacute;neas hacen que se redirijan las peticiones de prueba de filtros, servlets y p&aacute;ginas JSP, respectivamente, al m&oacute;dulo de Cactus adecuado para probarlas.</p>
			
</li>
		
</ol>
<p>Para la parte <strong>cliente</strong>, deberemos:</p>
<ol>
			
<li>Asegurarnos que las librer&iacute;as de Cactus est&eacute;n en el classpath (lo deberemos haber hecho as&iacute; ya para el servidor)</li>
			
<li>
				
<p>Colocar tambi&eacute;n en el classpath un fichero llamado <span class="codefrag">cactus.properties</span>, que indique la URL del contexto de la aplicaci&oacute;n web donde residen las pruebas (y los nombres de los redirectores, si son diferentes a los definidos en el fichero <span class="codefrag">web.xml</span>). Un ejemplo de fichero ser&iacute;a:</p>
				
<pre class="code">cactus.contextURL=http://localhost:8080/BibliotecaWeb</pre>
				
<p>Este fichero podemos colocarlo dentro de nuestra carpeta <span class="codefrag">WEB-INF/classes</span>. Para ello, lo colocaremos dentro de la carpeta de fuentes <span class="codefrag">resources</span>, de nuestro directorio de desarrollo visto antes, para que despu&eacute;s se vuelque autom&aacute;ticamente a <span class="codefrag">WEB-INF/classes</span>.</p>
			
</li>
		
</ol>
<a name="N10252"></a><a name="Cactus+y+Ant"></a>
<h3 class="underlined_5">Cactus y Ant</h3>
<p>Cactus ofrece una tarea Ant que realiza los siguientes pasos:</p>
<ol>
	    
<li>Despliega el WAR/EAR, que ya esta configurado para ejecutar las pruebas Cactus, en el contenedor de destino.</li>
	    
<li>Si el contenedor no esta arrancado, lo arranca. Sino, lo deja ejecutando.</li>
	    
<li>Ejecuta las pruebas Cactus</li>
	    
<li>Si el contenedor lo arranco esta tarea entonces lo para. Si ya estaba arrancado, lo deja funcionado.</li>
	
</ol>
<p>Por lo tanto, en la tarea vamos a definir:</p>
<ul>
	    
<li>donde se encuentra el archivo WAR/EAR</li>
	    
<li>cual y donde esta el contenedor a utilizar</li>
	    
<li>cuales son las pruebas (o suites) a ejecutar</li>
	
</ul>
<p>Un ejemplo de fichero <span class="codefrag">build.xml</span> con estas tareas ser&iacute;a:</p>
<pre class="code">
	...
	
	&lt;!-- Definimos la tarea de Cactus --&gt;
	&lt;taskdef resource="cactus.tasks"&gt;
	    &lt;classpath refid="project.classpath" /&gt;
	&lt;/taskdef&gt;
	
	&lt;target name="test" depends="dist"&gt;
	    &lt;cactus warfile="${dist.home}/${app.name}.war"
	        fork="yes" printsummary="yes" showoutput="yes"&gt;
	        &lt;classpath refid="project.classpath" /&gt;
	        &lt;containerset timeout="180000"&gt;
	            &lt;tomcat5x
	                dir="${tomcat.home}"
	                serverxml="conf/server.xml"
	                port="8080" /&gt;
	        &lt;/containerset&gt;
	        &lt;formatter type="plain" /&gt;
	        &lt;test name="es.ua.jtech.j2ee.dp.AllSuite" /&gt;
	        <em>&lt;!-- Otro modo de definir que pruebas queremos ejecutar
	        &lt;batchtest&gt;
	            &lt;fileset dir="."&gt;
	                &lt;include name="**/Test.java" /&gt;
	                &lt;include name="**/Suite.java" /&gt;
	                &lt;exclude name="**/Test*All.java" /&gt;
	            &lt;/fileset&gt;
	        &lt;/batchtest&gt;
	        --&gt;</em>
	    &lt;/cactus&gt;
	&lt;/target&gt;
	
	...</pre>
</div>


<a name="N10288"></a><a name="Introducci%C3%B3n+al+logging+en+aplicaciones+web"></a>
<h2 class="underlined_10">Introducci&oacute;n al logging en aplicaciones web</h2>
<div class="section">
<p>Las librer&iacute;as de logging vistas en m&oacute;dulos anteriores, como Log4J o commons-logging, pueden utilizarse de forma casi id&eacute;ntica en aplicaciones web J2EE. Para ello, tenemos que:</p>
<ul>
		
<li>A&ntilde;adir los ficheros JAR de las librer&iacute;as (<span class="codefrag">commons-logging-X.X.jar</span> y <span class="codefrag">log4j-X.X.X.jar</span>) en la carpeta <strong>WEB-INF/lib</strong> de nuestra aplicaci&oacute;n</li>
		
<li>
			Colocar en la carpeta <strong>WEB-INF/classes</strong> de nuestra aplicaci&oacute;n un fichero <strong>commons-logging.properties</strong> indicando que vamos a utilizar Log4J como librer&iacute;a subyacente:
			<pre class="code">org.apache.commons.logging.Log=org.apache.commons.logging.impl.Log4JLogger</pre>
		
</li>
		
<li>
			Colocar tambi&eacute;n en <strong>WEB-INF/classes</strong> un fichero <strong>log4j.properties</strong> con la configuraci&oacute;n de logging para Log4J. Por ejemplo:
			<pre class="code"># Coloca el nivel root del logger en DEBUG (muestra mensajes de DEBUG hacia arriba)
# A&ntilde;ade appender A1
log4j.rootLogger=DEBUG, A1

# A1 se redirige a la consola
log4j.appender.A1=org.apache.log4j.ConsoleAppender
log4j.appender.A1.Threshold=INFO

# A1 utiliza PatternLayout
log4j.appender.A1.layout=org.apache.log4j.PatternLayout
log4j.appender.A1.layout.ConversionPattern=%d{dd/MM/yyyy HH:mm:ss} - %p - %m %n</pre>
		
</li>
		
<li>Finalmente, s&oacute;lo queda en cada servlet o clase Java colocar los mensajes de log donde queramos. Veremos c&oacute;mo hacerlo en servlets y p&aacute;ginas JSP en el siguiente m&oacute;dulo</li>
	
</ul>
<p>Realmente, en nuestro directorio de desarrollo, no pondremos los ficheros <span class="codefrag">.properties</span> en <span class="codefrag">WEB-INF/classes</span>, sino que crearemos una carpeta fuente llamada <span class="codefrag">resources</span>, como se ha explicado en la estructura de directorios anterior, y dejaremos all&iacute; los ficheros. Despu&eacute;s, desde WebTools o desde Ant, nos encargaremos de copiar estos ficheros en <span class="codefrag">build/WEB-INF/classes</span>.</p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006 Depto. CCIA</div>
</div>
</body>
</html>
