<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Servidores de aplicaciones</title>
                                                   
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
                             
  <meta name="Author" content="Miguel">
                             
  <link rel="stylesheet" href="../../../apuntes.css" type="text/css">
</head>
  <body>
               
<h1>Despliegue de aplicaciones, creaci&oacute;n de usuarios y manejo de seguridad 
  y utilidades desde l&iacute;nea de comandos</h1>
               
<h3>Despliegue de aplicaciones</h3>
<p>Como primer ejercicio vais a desplegar la aplicaci&oacute;n <a href="benefits.war.zip">benefits.war</a>. 
  Realizad el despliegue en el servidor <i>serva</i>. Probad que el servidor responde 
  a la aplicaci&oacute;n (pod&eacute;is llamar a la aplicaci&oacute;n con /<i>benefits</i>). 
  Echad un vistazo a la aplicaci&oacute;n y eliminarla (<i>undeploy</i>). Volved 
  a probar que el servidor ha dejado de responder a la aplicaci&oacute;n.</p>
<h3>Manejo de seguridad b&aacute;sica</h3>
<p>Lo primero a realizar es la creaci&oacute;n de dos grupos de usuarios que contendr&aacute;n 
  los usuarios descritos a continuaci&oacute;n. Para simplificar pod&eacute;is 
  asignar la misma contrase&ntilde;a a todos los usuarios.</p>
<table width="300" border="1">
  <tr bgcolor="#999999"> 
    <td><b><font color="#000000">Nombre de usuario</font></b></td>
    <td><b><font color="#000000">Grupo</font></b></td>
  </tr>
  <tr> 
    <td>juan</td>
    <td>faqs</td>
  </tr>
  <tr> 
    <td>miguel</td>
    <td>faqs</td>
  </tr>
  <tr> 
    <td>antonio</td>
    <td>faqs</td>
  </tr>
  <tr> 
    <td>otto</td>
    <td>managers</td>
  </tr>
  <tr> 
    <td>francisco</td>
    <td>managers</td>
  </tr>
  <tr> 
    <td>javier</td>
    <td>managers</td>
  </tr>
  <tr>
    <td>patricia</td>
    <td>managers</td>
  </tr>
</table>
<p>Una vez creados todos los usuarios eliminad el usuario <i>otto</i>. </p>
<p>Ahora vais a desplegar una nueva aplicaci&oacute;n. La aplicaci&oacute;n se 
  encuentra en el fichero <a href="timeoff.zip">timeoff.zip</a>. Descomprimidlo 
  y cambiad los datos necesarios en los ficheros <i>web.xml</i> y <i>weblogic.xml</i> 
  dentro del directorio WEB-INF. La aplicaci&oacute;n se llama con el nombre <i>timeoff</i>. 
  Las URL a proteger son /managers/* y /<i>officeclosing</i>/* que son los servlets 
  a los que s&oacute;lo tienen acceso los miembros del grupo <i>managers.</i> 
  Deb&eacute;is asignar un nombre de rol (el que quer&aacute;is). En el fichero 
  <i>weblogic.xml</i> el rol definido antes se asigna a un grupo o usuario (es 
  preferible siempre asignarlo a un grupo). En nuestro caso lo hac&eacute;is para 
  el grupo <i>managers</i>.</p>
<p>Opcionalmente, desplegad la aplicaci&oacute;n <i>faqs</i> que hicisteis en 
  el m&oacute;dulo de servlets y configurar WebLogic para que funcione con esta 
  aplicaci&oacute;n. Deb&eacute;is tener en cuenta que el classpath de WebLogic 
  debe contener el driver para la conexi&oacute;n a la base de datos.</p>
<h3>Utilidades desde l&iacute;nea de comandos</h3>
<p>Utilizad todas llamadas desde l&iacute;nea de comandos para familiarizaros 
  con ellas: parad un servidor y volverlo a arrancar, eliminar una aplicaci&oacute;n 
  y volverla a desplegar y probad con todas las otras opciones.</p>
</body>
</html>