<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Dominios y servicios (II)</title>
<link type="text/css" href="../skin/highlight/shCore.css" rel="stylesheet">
<link type="text/css" href="../skin/highlight/shThemeEclipse.css" rel="stylesheet">
<script src="../skin/highlight/shCore.js" type="text/javascript"></script><script src="../skin/highlight/shAutoloader.js" type="text/javascript"></script>
<link type="text/css" href="../skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="../skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="../skin/print.css" rel="stylesheet">
<link type="text/css" href="../skin/profile.css" rel="stylesheet">
<script src="../skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="../skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="../skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="../index.html">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="jtech" src="../images/baner_j2ee_izq.gif" title="Especialista Universitario Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Groovy&amp;Grails: desarrollo r&aacute;pido de aplicaciones" src="../images/baner_j2ee_der.gif" title="Groovy&amp;Grails: desarrollo r&aacute;pido de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">Home</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Sesiones</a>
</li>
<li>
<a class="base-not-selected" href="../ejercicios/index.html">Ejercicios</a>
</li>
<li>
<a class="base-not-selected" href="../bibliografia/index.html">Bibliograf&iacute;a</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', '../skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('../skin/images/chapter_open.gif');">Sesiones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html" title="Introducci&oacute;n a Groovy">Sesi&oacute;n 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html" title="El lenguaje Groovy">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html" title="Aspectos avanzados en Groovy">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html" title="Librer&iacute;as propias en Groovy">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html" title="Introducci&oacute;n a Grails">Sesi&oacute;n 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html" title="Construir la interfaz de usuario (I)">Sesi&oacute;n 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html" title="Controladores">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html" title="Construir la interfaz de usuario (II)">Sesi&oacute;n 8</a>
</div>
<div class="menuitem">
<a href="sesion09-apuntes.html" title="Dominios y servicios (I)">Sesi&oacute;n 9</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesi&oacute;n 10</div>
</div>
<div class="menuitem">
<a href="sesion11-apuntes.html" title="Seguridad">Sesi&oacute;n 11</a>
</div>
<div class="menuitem">
<a href="sesion12-apuntes.html" title="Despliegue de aplicaciones">Sesi&oacute;n 12</a>
</div>
<div class="menuitem">
<a href="sesion13-apuntes.html" title="Web 2.0">Sesi&oacute;n 13</a>
</div>
<div class="menuitem">
<a href="sesion14-apuntes.html" title="AJAX">Sesi&oacute;n 14</a>
</div>
<div class="menuitem">
<a href="sesion15-apuntes.html" title="Dos horas para crear twitter">Sesi&oacute;n 15</a>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="../skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion10-apuntes.pdf"><img alt="PDF -icon" src="../skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Dominios y servicios (II)</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Interactuar+con+la+base+de+datos">Interactuar con la base de datos</a>
<ul class="minitoc">
<li>
<a href="#Consultas+din%C3%A1micas+de+GORM">Consultas din&aacute;micas de GORM</a>
</li>
<li>
<a href="#Consultas+HQL+de+Hibernate">Consultas HQL de Hibernate</a>
</li>
<li>
<a href="#Consultas+Criteria+de+Hibernate">Consultas Criteria de Hibernate</a>
</li>
</ul>
</li>
<li>
<a href="#Servicios">Servicios</a>
<ul class="minitoc">
<li>
<a href="#Servicio+de+mensajer%C3%ADa">Servicio de mensajer&iacute;a</a>
</li>
</ul>
</li>
</ul>
</div>
         

<p>
	En la primera sesi&oacute;n sobre Grails, ya vimos como crear una completa aplicaci&oacute;n web capaz incluso de persistir los datos en una base de datos, sin embargo, toda la informaci&oacute;n sobre como Grails se encarga de esta parte qued&oacute; muy en el aire, as&iacute; que en esta sesi&oacute;n vamos a ver como Grails es capaz de trabajar con las bases de datos. Se asumir&aacute;n algunos conocimientos m&iacute;nimos de lenguaje SQL, aunque tambi&eacute;n es posible trabajar con Grails sin tener apenas idea de SQL.
</p>

<p>
	Para empezar, veremos como Grails dispone de varias formas de acceder a una base de datos y realizar consultas sobre ellas. En primer lugar, repasaremos como realizar las simples operaciones CRUD (<span class="codefrag">create, read, update y delete()</span>). Posteriormente, veremos como GORM nos muestra la potencia de Groovy a la hora de crear DSL's para realizar consultas a la base de datos a partir de los nombres de los m&eacute;todos utilizados, tal y como vimos en la sesi&oacute;n anterior con el m&eacute;todo <span class="codefrag">findAllByTipoAndUsuario()</span>.
</p>

<p>
	Por &uacute;ltimo, comprobaremos como en ocasiones la &uacute;nica forma de realizar las consultas a la base de datos es utilizando el lenguaje propio de Hibernate (<em>HQL - Hibernate Query Language</em>).
</p>


<a name="N1001E"></a><a name="Interactuar+con+la+base+de+datos"></a>
<h2 class="underlined_10">Interactuar con la base de datos</h2>
<div class="section">
<p>
	Cuando interactuamos con una base de datos, lo primero que debemos conocer es como realizar las operaciones b&aacute;sicas en cualquier aplicaci&oacute;n (CRUD). Si echamos un vistazo al c&oacute;digo del controlador de la clase de dominio <em>Usuario</em>, detectaremos la presencia de los m&eacute;todos <span class="codefrag">get()</span>, <span class="codefrag">delete()</span> y <span class="codefrag">save()</span>. Tambi&eacute;n podemos comprobar como no existe ninguno de estos tres m&eacute;todos implementados en la clase de dominio <em>Usuario</em>. Entonces, &iquest;c&oacute;mo es capaz Grails de persistir la informaci&oacute;n en la base de datos si estos tres m&eacute;todos no existen?
</p>
<p>
	La respuesta es sencilla. Grails se encarga de interceptar las llamadas a estos m&eacute;todos y responder por ellos. Veamos un ejemplo de como funcionan estos tres m&eacute;todos implementando un nuevo test de integraci&oacute;n para la clase de dominio <em>Usuario</em>

</p>
<pre class="code">void testCRUDOperation() {
    //Creamos el nuevo usuario
    def usuarioTemp = new Usuario(login:'otrousuario',
    password: 'otropasswd',
    nombre: 'Otro',
    apellidos: 'Usuario',
    tipo: 'profesor',
    email: 'miemail@ua.es')

    //Tratamos de persistirlo en la base de datos
    <strong>usuarioTemp.save()</strong>

    //Comprobamos que el num&eacute;ro total de usuarios coincide
    //con lo que esperamos. Ten en cuenta que 
    //el m&eacute;todo setUp() ha a&ntilde;adido otro usuario
    assert Usuario.count()==7

    //Obtenemos el identificador del usuario recien creado
    def usuarioId = usuarioTemp.id

    //Tratamos de actualizar los datos del nuevo usuario
    usuarioTemp.password = 'nuevopasswd'

    //Comprobamos que se ha actualizado el password
    <strong>usuarioTemp = Usuario.get(usuarioId)</strong>
    assert "nuevopasswd" == usuarioTemp.password
    assert "Otro" == usuarioTemp.nombre

    //Ahora eliminamos el usuario
    <strong>usuarioTemp.delete()</strong>
    //Y comprobamos que se elimina correctamente
    assert null == Usuario.get(usuarioId)
    assert Usuario.count()==6
}</pre>
<p>
	Si ejecutamos ahora <span class="codefrag">grails test-app biblioteca.Usuario</span>, comprobaremos que el test funciona correctamente, con lo que los m&eacute;todos <span class="codefrag">get(), save() y delete()</span> funcionan tal y como esper&aacute;bamos.
</p>
<p>
	Ahora bien, con el m&eacute;todo <span class="codefrag">get()</span>, s&oacute;lo vamos a poder seleccionar un registro de la base de datos que concuerde con el identificador de la clase de dominio en cuesti&oacute;n. Por supuesto, necesitaremos m&aacute;s formas de obtener estos registros a partir de otras propiedades.
</p>
<p>
	Las diversas formas de realizar consultas a la base de datos son:
</p>
<ul>
	
<li>Consultas din&aacute;micas de GORM</li>
	
<li>Consultas HQL</li>
	
<li>Consultas Criteria de Hibernate</li>

</ul>
<a name="N10067"></a><a name="Consultas+din%C3%A1micas+de+GORM"></a>
<h3 class="underlined_5">Consultas din&aacute;micas de GORM</h3>
<p>
	Hasta el momento, para crear las operaciones b&aacute;sicas (CRUD) de cualquier aplicaci&oacute;n, no hemos necesitado m&aacute;s que recuperar los datos de una determinada instancia de una clase de dominio a partir de su identificador (clave primaria). Pero, creer que esto ser&iacute;a suficiente para desarrollar una completa aplicaci&oacute;n ser&iacute;a de ilusos, as&iacute; que vamos a profundizar en otro tipo de consultas a la base de datos.
</p>
<p>
	
<strong>Contadores</strong>

</p>
<p>
	Si deseamos conocer el n&uacute;mero total de registros de una clase de dominio, podemos utilizar el m&eacute;todo <span class="codefrag">count()</span>, tal y como ya hemos visto en el test de ejemplo anterior <span class="codefrag">assert Usuario.count()==7</span>. Pero, &iquest;qu&eacute; pasa si quisi&eacute;ramos saber cuantos usuarios de tipo <em>administrador</em> tenemos en nuestro sistema?
</p>
<p>
	GORM permite afinar el m&eacute;todo <span class="codefrag">count()</span> para devolver s&oacute;lo el n&uacute;mero total de registros que cumplen una determinada condici&oacute;n. Por ejemplo, para conocer cuantos administradores hay en el sistema podemos utilizar el m&eacute;todo <span class="codefrag">Usuario.countByTipo("administrador")</span>.
</p>
<p>
	Pero la potencia de GORM como lenguaje DSL para realizar consultas a la base de datos no se queda ah&iacute;, sino que va un paso m&aacute;s all&aacute; y permite anidar criterios de b&uacute;squeda de tipo <span class="codefrag">AND</span> y <span class="codefrag">OR</span>. Si por ejemplo, necesit&aacute;ramos conocer cuantos usuarios de tipo <em>administrador</em> y <em>bibliotecario</em> hay en nuestra aplicaci&oacute;n, podr&iacute;amos escribir <span class="codefrag">Usuario.countByTipoOrTipo("administrador","bibliotecario")</span>.
</p>
<p>
	No hace falta comentar, que al igual que el segundo criterio de b&uacute;squeda en el ejemplo anterior ha sido el <em>tipo</em>, podr&iacute;amos haber utilizado cualquier otro de entre las propiedades de la clase de dominio <em>Usuario</em> y que, de igual forma, tambi&eacute;n podr&iacute;amos haber empleado una b&uacute;squeda de tipo <span class="codefrag">AND</span> para buscar el n&uacute;mero de registros que cumplan ambas condiciones.
</p>
<p>
	
<strong>Consultas que devuelven un solo registro</strong>

</p>
<p>
	En cualquier aplicaci&oacute;n, es necesario mostrar la informaci&oacute;n de una determinada instancia de una clase de dominio que cumpla una serie una serie de condiciones. Con GORM esto es posible de dos formas que vamos a ver a continuaci&oacute;n. La primera de ellas es mediante el m&eacute;todo <span class="codefrag">findBy()</span>. Este m&eacute;todo, al igual que hac&iacute;amos con el m&eacute;todo <span class="codefrag">count()</span> permite a&ntilde;adir una serie de propiedades de la clase de dominio encadenadas por las palabras reservadas <span class="codefrag">AND</span> y <span class="codefrag">OR</span> para devolver un conjunto de registros.
</p>
<p>
	Siguiendo con el ejemplo anterior, si escribimos <span class="codefrag">Usuario.findByTipo("administrador")</span>, la aplicaci&oacute;n nos devolver&iacute;a el primer registro que cumpla que la propiedad <em>tipo</em> sea <em>administrador</em>.  &iquest;Y si quisi&eacute;ramos mostrar el administrador cuyo nombre sea <em>Francisco Jos&eacute;</em>? Pues siguiendo el mismo procedimiento que con el m&eacute;todo <span class="codefrag">count()</span>, podr&iacute;amos tener <span class="codefrag">Usuario.findByTipoAndNombre("administrador","Francisco Jos&eacute;")</span>.
</p>
<p>
	Este m&eacute;todo es muy &uacute;til, sobre todo si se desea mezclar criterios de b&uacute;squeda <span class="codefrag">AND</span> y <span class="codefrag">OR</span>, pero si necesitamos que en nuestra consulta se cumplan todos y cada uno de los criterios, podemos emplear el m&eacute;todo <span class="codefrag">findWhere()</span>, al cual se le pasa como par&aacute;metro un mapa con las propiedades de la clase de dominio sobre las que deseamos realizar las consultas y su valor. Para el ejemplo anterior podr&iacute;amos tener <span class="codefrag">Usuario.findWhere(["tipo":"administrador", "nombre":"Francisco Jos&eacute;"])</span>.
</p>
<p>
	El m&eacute;todo <span class="codefrag">findWhere()</span> puede ser especialmente &uacute;til en aquellos casos en los que nos sea devuelto un mapa de propiedades de una clase de dominio de cualquier llamada a otro procedimiento. De esta forma, simplemente tendr&iacute;amos que pasar el valor devuelto en esa llamada como par&aacute;metro al m&eacute;todo <span class="codefrag">findWhere()</span>.
</p>
<p>
	Recuerda que los m&eacute;todos <span class="codefrag">findBy()</span> y <span class="codefrag">findWhere()</span> s&oacute;lo devuelven un registro de la clase de dominio correspondiente.
</p>
<p>
	
<strong>Consultas que devuelven varios registros</strong>

</p>
<p>
	Con los m&eacute;todos anteriores <span class="codefrag">findBy()</span> y <span class="codefrag">findWhere()</span> simplemente &eacute;ramos capaces de obtener un registro de la clase de dominio implicada, lo cual no suele lo m&aacute;s com&uacute;n en las aplicaciones, donde normalmente se necesita obtener una serie de registros para posteriormente mostr&aacute;rselos al usuario. A continuaci&oacute;n, vamos a ver varias formas para la obtenci&oacute;n de este conjunto de registros.
</p>
<p>
	El m&eacute;todo <span class="codefrag">findAllBy()</span> es similar al m&eacute;todo <span class="codefrag">findBy()</span> con la &uacute;nica diferencia de que en este caso se devuelven todos los registros que cumplan las condiciones impuestas en el m&eacute;todo. Si necesit&aacute;ramos mostrar un listado con aquellos usuarios de tipo <em>socio</em> de nuestra aplicaci&oacute;n podr&iacute;amos escribir <span class="codefrag">Usuario.findAllByTipo("socio")</span>. 
</p>
<p>	
	De igual forma que con el m&eacute;todo <span class="codefrag">findBy()</span>, vamos a poder encadenar diferentes criterios para filtrar esa b&uacute;squeda de registros. Por ejemplo, si en un listado debemos mostrar aquellos usuarios de tipo <em>socio</em> y <em>profesor</em> de nuestro sistema, deber&iacute;amos escribir <span class="codefrag">Usuario.findAllByTipoOrTipo("socio","profesor")</span>.
</p>
<p>
	An&aacute;logamente al m&eacute;todo <span class="codefrag">findWhere()</span>, tambi&eacute;n disponemos del m&eacute;todo <span class="codefrag">findAllWhere()</span>, que nos devolver&aacute; todos los registros que cumplan las restricciones pasadas por par&aacute;metro en forma de mapa. Si quisi&eacute;ramos obtener todos los profesores de nuestro sistema que tengan como apellidos <em>Pica Piedra</em> podr&iacute;amos tener <span class="codefrag">Usuario.findAllWhere(["tipo":"profesor", "apellidos":"Pica Piedra"])</span>. Recuerda que, tanto en el m&eacute;todo <span class="codefrag">findWhere()</span> como en <span class="codefrag">findAllWhere()</span> todas las condiciones pasadas como par&aacute;metro deben cumplirse, con lo que <span class="codefrag">Usuario.findAllByTipoAndApellidos("profesor","Pica Piedra")</span> ser&iacute;a id&eacute;ntico al m&eacute;todo <span class="codefrag">Usuario.findAllWhere(["tipo":"profesor","apellidos":"Pica Piedra"])</span>.
</p>
<p>
	Sigamos conociendo nuevos m&eacute;todos para obtener varios registros. El siguiente m&eacute;todo que vamos a ver podr&iacute;amos decir que ser&iacute;a el an&aacute;logo al m&eacute;todo <span class="codefrag">get()</span> que ya vimos anteriormente. El m&eacute;todo <span class="codefrag">getAll()</span> acepta como par&aacute;metro una lista de valores para devolver aquellas instancias que tengan como identificador cualquiera de estos valores. Por ejemplo, si quisi&eacute;ramos obtener aquellos <em>usuarios</em> con identificador 1, 3 y 5 podr&iacute;amos escribir <span class="codefrag">Usuario.getAll([1,3,5])</span>.
</p>
<p>
	El siguiente m&eacute;todo que vamos a ver, nos permite obtener todas las instancias de una determinada clase de dominio. El m&eacute;todo <span class="codefrag">list()</span> es posiblemente el m&eacute;todo m&aacute;s b&aacute;sico de todos los que podemos encontrar en GORM. Para obtener todos los usuarios de nuestro sistema podr&iacute;amos tener <span class="codefrag">Usuario.list()</span>.
</p>
<p>
	El m&eacute;todo <span class="codefrag">list()</span> puede recibir una serie de par&aacute;metros para filtrar los registros devueltos y la forma en como se devuelven. Estos par&aacute;metros son:
</p>
<ul>
	
<li>
<span class="codefrag">max</span>, que permite indicar un n&uacute;mero m&aacute;ximo de registros devueltos</li>
	
<li>
<span class="codefrag">offset</span>, que indicar&aacute; que los registros devueltos empiecen desde una determinada posici&oacute;n. En combinaci&oacute;n con el par&aacute;metro <span class="codefrag">max</span> permitir&aacute; realizar paginaci&oacute;n sobre los resultados</li>
	
<li>
<span class="codefrag">sort</span>, indica una propiedad de la clase de dominio por la que ordenar los registros devueltos</li>
	
<li>
<span class="codefrag">order</span>, especifica un orden (ascendente o descendente) para los registros devueltos</li>

</ul>
<p>
	Podr&iacute;amos decir que el m&eacute;todo <span class="codefrag">list()</span> tiene otro m&eacute;todo mejorado que nos permite ordenar los registros devueltos por un determinado criterio. El m&eacute;todo <span class="codefrag">listOrderBy()</span> permite encadenar propiedades de la clase de dominio correspondiente para ordenar los registros devueltos. Si el listado anterior de todos los usuarios del sistema lo necesit&aacute;ramos ordenado por nombre, podr&iacute;amos tener <span class="codefrag">Usuario.listOrderByNombre()</span>. Este m&eacute;todo tambi&eacute;n acepta los par&aacute;metros indicados anteriormente para <span class="codefrag">list()</span> con la salvedad del par&aacute;metro <em>sort</em>, puesto que este valor ya se especifica en el propio nombre del m&eacute;todo.
</p>
<p>
	
<strong>Otros criterios de b&uacute;squeda</strong>

</p>
<p>
	Hasta el momento, en todos los m&eacute;todos que hemos visto que permit&iacute;an buscar registros entre las instancias de una clase de dominio deb&iacute;a coincidir literalmente el valor de la propiedad con el valor pasado por par&aacute;metro. Por ejemplo, en la llamada <span class="codefrag">Usuario.findAllByNombre("Francisco Jos&eacute;")</span>, el sistema busca aquellos usuarios que tengan como nombre <em>Francisco Jos&eacute;</em>. Pero, &iquest;c&oacute;mo podr&iacute;amos conseguir que el sistema nos devuelva todos los usuarios que tengan en su nombre la cadena <em>fran</em>?
</p>
<p>
	Para ello, GORM dispone de otras opciones de b&uacute;squeda que permiten afinarla. Por ejemplo, para mostrar todos los usuarios que tengan en su nombre la palabra <em>cisco</em>, podr&iacute;amos tener lo siguiente <span class="codefrag">Usuario.findAllByNombreLike("%cisco%")</span>. Pero a&uacute;n podr&iacute;amos afinar m&aacute;s esta b&uacute;squeda, obteniendo s&oacute;lo aquellos usuarios que tengan tambi&eacute;n en su apellidos la cadena <em>arc</em> de la siguiente forma <span class="codefrag">Usuario.findAllByNombreLikeAndApellidosLike("%cisco%", "%arc%")</span>.
</p>
<p>
	La siguiente tabla muestra todas los posibles m&eacute;todos de comparaci&oacute;n en la b&uacute;squeda de registros.
</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	
<tr>
		
<th colspan="1" rowspan="1">M&eacute;todo</th>
		<th colspan="1" rowspan="1">Descripci&oacute;n</th>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">InList</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada coincida con cualquiera de los elementos de la lista pasada por par&aacute;metro</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">LessThan</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada sea menor que el valor pasado por par&aacute;metro</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">LessThanEquals</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada sea menor o igual que el valor pasado por par&aacute;metro</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">GreaterThan</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada sea mayor que el valor pasado por par&aacute;metro</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">GreaterThanEquals</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada sea mayor o igual que el valor pasado por par&aacute;metro</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">Like</td>
		<td colspan="1" rowspan="1">Es equivalente a una expresi&oacute;n <em>LIKE</em> en una sentencia SQL</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">ILike</td>
		<td colspan="1" rowspan="1">Similar al m&eacute;todo <em>Like</em> salvo que en esta ocasi&oacute;n <em>case insensitive</em></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">NotEqual</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada no sea igual al valor pasado por par&aacute;metro</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">Between</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada se encuentre entre los dos valores pasados por par&aacute;metro. Necesita de dos par&aacute;metros.</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">IsNotNull</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada no sea nula. No se necesita ning&uacute;n argumento.</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">IsNull</td>
		<td colspan="1" rowspan="1">Devuelve aquellos registros en los que el valor de la propiedad dada sea nula</td>
	
</tr>	

</table>
<p>
	
<strong>Resumen de m&eacute;todos din&aacute;micos de GORM</strong>

</p>
<p>
	La tabla que se muestra es un resumen de los m&eacute;todos din&aacute;micos de los que dispone GORM para realizar la b&uacute;squeda de registros.
</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	
<tr>
		
<th colspan="1" rowspan="1">M&eacute;todo</th>
		<th colspan="1" rowspan="1">Descripci&oacute;n</th>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">count()</span></td>
		<td colspan="1" rowspan="1">Devuelve el n&uacute;mero total de registros de una determinada clase de dominio</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">countBy()</span></td>
		<td colspan="1" rowspan="1">Devuelve el n&uacute;mero total de registros de una determinada clase de dominio que cumplan una serie de requisitos encadenados tras el nombre del m&eacute;todo</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">findBy()</span></td>
		<td colspan="1" rowspan="1">Devuelve el primer registro encontrado de una determinada clase de dominio que cumpla una serie de requisitos encadenados tras el nombre del m&eacute;todo</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">findWhere()</span></td>
		<td colspan="1" rowspan="1">Devuelve el primer registro encontrado de una determinada clase de dominio que cumpla una serie de requisitos pasados por par&aacute;metro en forma de mapa</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">findAllBy()</span></td>
		<td colspan="1" rowspan="1">Devuelve todos los registros encontrados de una determinada clase de dominio que cumplan una serie de requisitos encadenados tras el nombre del m&eacute;todo</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">findAllWhere()</span></td>
		<td colspan="1" rowspan="1">Devuelve todos los registros encontrados de una determinada clase de dominio que cumplan una serie de requisitos pasados por par&aacute;metro en forma de mapa</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">getAll()</span></td>
		<td colspan="1" rowspan="1">Devuelve todos los registros de una determinada clase de dominio cuyo identificador coincida con cualquier de los pasados par&aacute;metro en forma de lista</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">list()</span></td>
		<td colspan="1" rowspan="1">Devuelve todos los registros de una determinada clase de dominio. Acepta los par&aacute;metros <span class="codefrag">max</span>, <span class="codefrag">offset</span>, <span class="codefrag">sort</span> y <span class="codefrag">order</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1"><span class="codefrag">listOrderBy()</span></td>
		<td colspan="1" rowspan="1">Devuelve todos los registros de una determinada clase de dominio ordenador por un criterio. Acepta los par&aacute;metros <span class="codefrag">max</span>, <span class="codefrag">offset</span> y <span class="codefrag">order</span></td>
	
</tr>	

</table>
<a name="N102FC"></a><a name="Consultas+HQL+de+Hibernate"></a>
<h3 class="underlined_5">Consultas HQL de Hibernate</h3>
<p>
	Otra forma de realizar consultas sobre la base de datos es mediante el lenguaje de consulta propio de Hibernate, HQL (Hibernate Query Language). Con los m&eacute;todos din&aacute;micos de GORM vimos que ten&iacute;amos la posibilidad de ejecutar llamadas a m&eacute;todos para obtener un registro o un conjunto. Con HQL vamos a tener tambi&eacute;n esta capacidad con los m&eacute;todos <span class="codefrag">find()</span> y <span class="codefrag">findAll()</span> m&aacute;s uno nuevo llamado <span class="codefrag">executeQuery()</span>.
</p>
<p>
	Con el m&eacute;todo <span class="codefrag">find()</span> vamos a poder obtener el primer registro devuelto de la consulta HQL pasada por par&aacute;metro. El siguiente ejemplo, devuelve el primer usuario administrador que encuentre en la clase de dominio <em>Usuario</em>.
</p>
<pre class="code">def sentenciaHQL1 = Usuario.find("From Usuario as u")
assert sentenciaHQL1.tipo == "administrador"</pre>
<p>
	Pero lo habitual no es simplemente obtener el primer registro sino que normalmente necesitaremos obtener todos los registros que cumplan una serie de condiciones para posteriormente, actuar en consecuencia. Al igual que con los m&eacute;todos din&aacute;micos de GORM, HQL dispone tambi&eacute;n del m&eacute;todo <span class="codefrag">findAll()</span> al cual debemos pasarle por par&aacute;metro la sentencia HQL correspondiente. En el siguiente ejemplo, vamos a ver tres formas diferentes de obtener los usuarios de tipo <em>socio</em> de nuestra aplicaci&oacute;n.
</p>
<pre class="code">def hqlsentence2 = Usuario.findAll("from Usuario as u where u.tipo='socio'")
assert hqlsentence2.size()==2

def hqlsentence3 = Usuario.findAll("from Usuario as u where u.tipo=?", ["socio"])
assert hqlsentence3.size()==2

def hqlsentence4 = Usuario.findAll("from Usuario as u where u.tipo=:tipo", [tipo:"socio"])
assert hqlsentence4.size()==2</pre>
<p>
	En la primera de ellas, la sentencia HQL se pasa como par&aacute;metro al m&eacute;todo <span class="codefrag">findAll()</span>. Tambi&eacute;n es posible pasar par&aacute;metros a la sentencia HQL tal y como se ha hecho en la segunda forma. Utilizando el caracter <em>?</em> le especificamos que es valor se pasar&aacute; en forma de par&aacute;metro posicional, es decir, el primer caracter <em>?</em> encontrado en la sentencia HQL se referir&aacute; al primer par&aacute;metro pasado, el segundo <em>?</em> al segundo par&aacute;metro y as&iacute; sucesivamente.
</p>
<p>
	Otra forma posible de implementar sentencias HQL es pasando un mapa con las variables introducidas en la sentencia HQL. Para introducir una variable en una sentencia HQL basta con escribir el car&aacute;cter <em>:</em> seguido del nombre de la variable que deseemos crear. En el ejemplo hemos creado la variable <em>tipo</em>, que posteriormente se rellenar&aacute; en el mapa pasado como par&aacute;metro.
</p>
<p>
	De igual forma que ve&iacute;amos anteriormente con los m&eacute;todos <span class="codefrag">list()</span> y <span class="codefrag">listOrderBy()</span>, HQL permite utilizar los par&aacute;metros <span class="codefrag">max</span>, <span class="codefrag">offset</span>, <span class="codefrag">sort</span> y <span class="codefrag">order</span> para afinar a&uacute;n m&aacute;s la b&uacute;squeda.
</p>
<p>
	Por &uacute;ltimo, el m&eacute;todo <span class="codefrag">executeQuery()</span> es algo diferente a los m&eacute;todos <span class="codefrag">find()</span> y <span class="codefrag">findAll()</span>. En estos dos m&eacute;todos se devolv&iacute;an todas las columnas de la tabla en cuesti&oacute;n, cosa que no siempre puede ser necesaria. El m&eacute;todo <span class="codefrag">executeQuery()</span> permite seleccionar que columnas vamos a devolver. El siguiente ejemplo devuelve s&oacute;lo el <em>nombre</em> y <em>apellidos</em> de los administradores del sistema.
</p>
<pre class="code">Usuario.executeQuery("select nombre, apellidos from Usuario u where u.tipo='administrador'")</pre>
<a name="N1036F"></a><a name="Consultas+Criteria+de+Hibernate"></a>
<h3 class="underlined_5">Consultas Criteria de Hibernate</h3>
<p>
	El &uacute;ltimo m&eacute;todo para realizar consultas a la base de datos se refiere a la utilizaci&oacute;n de <em>Criteria</em>, un API de Hibernate dise&ntilde;ado espec&iacute;ficamente para la realizaci&oacute;n de consultas complejas. En Grails, Criteria est&aacute; basado en un <em>Builder de Groovy</em> y el c&oacute;digo mostrado a continuaci&oacute;n es un ejemplo de utilizaci&oacute;n de &eacute;ste. En este ejemplo vamos a ver como podr&iacute;amos obtener un listado de todas las operaciones de tipo <em>pr&eacute;stamo</em> realizadas los &uacute;ltimos 10 d&iacute;as. 
</p>
<pre class="code">void testCriteria() {
    def c = Operacion.createCriteria()
    def resultado = c{
        between("fechaInicio",new Date()-10,new Date())
        eq("tipo","prestamo")
        maxResults(15)
        order("fechaInicio","desc")
    }
    assert resultado.size()==1
}</pre>
<p>
	Criteria dispone de una serie de <em>criterios</em> disponibles para ser utilizados en este tipo de consultas. En el ejemplo hemos utilizado <span class="codefrag">between</span>, <span class="codefrag">eq</span>, <span class="codefrag">maxResults</span> y <span class="codefrag">order</span>, pero existen muchos m&aacute;s que vamos a ver en la siguiente tabla.
</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	
<tr>
		
<th colspan="1" rowspan="1">Criterio</th>
		<th colspan="1" rowspan="1">Descripci&oacute;n</th>
		<th colspan="1" rowspan="1">Ejemplo</th>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">between</td>
		<td colspan="1" rowspan="1">Cuando el valor de la propiedad se encuentra entre dos valores</td>
		<td colspan="1" rowspan="1"><span class="codefrag">between("fechaInicio",new Date()-10, new Date())</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">eq</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es igual al valor pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">eq("tipo","prestamo")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">eqProperty</td>
		<td colspan="1" rowspan="1">Cuando dos propiedades tienen el mismo valor</td>
		<td colspan="1" rowspan="1"><span class="codefrag">eqProperty("fechaInicio","fechaFin")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">gt</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es mayor que el valor pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">gt("fechaInicio",new Date()-5)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">gtProperty</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es mayor que el valor de la propiedad pasada por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">gtProperty("fechaInicio","fechaFin")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">ge</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es mayor o igual que el valor pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">ge("fechaInicio", new Date()-5)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">geProperty</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es mayor o igual que el valor de la propiedad pasada por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">geProperty("fechaInicio", "fechaFin")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">idEq</td>
		<td colspan="1" rowspan="1">Cuando el identificador de un objeto es igual al valor pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">idEq(1)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">ilike</td>
		<td colspan="1" rowspan="1">La sentencia SQL like, pero en modo <em>case insensitive</em></td>
		<td colspan="1" rowspan="1"><span class="codefrag">ilike("nombre", "fran%")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">in</td>
		<td colspan="1" rowspan="1">Cuando el valor de la propiedad es cualquiera de los valores pasados por par&aacute;metro. In es una palabra reservada en Groovy, as&iacute; que debemos utilizar las comillas simples</td>
		<td colspan="1" rowspan="1"><span class="codefrag">'in'("edad",[18..65])</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">isEmpty</td>
		<td colspan="1" rowspan="1">Cuando la propiedad se encuentra vac&iacute;a</td>
		<td colspan="1" rowspan="1"><span class="codefrag">isEmpty("descripcion")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">isNotEmpty</td>
		<td colspan="1" rowspan="1">Cuando la propiedad no se encuentra vac&iacute;a</td>
		<td colspan="1" rowspan="1"><span class="codefrag">isNotEmpty("descripcion")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">isNull</td>
		<td colspan="1" rowspan="1">Cuando el valor de la propiedad es <span class="codefrag">null</span></td>
		<td colspan="1" rowspan="1"><span class="codefrag">isNull("descripcion")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">isNotNull</td>
		<td colspan="1" rowspan="1">Cuando el valor de la propiedad no es <span class="codefrag">null</span></td>
		<td colspan="1" rowspan="1"><span class="codefrag">isNotNull("descripcion")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">lt</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es menor que el valor pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">lt("fechaInicio",new Date()-5)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">ltProperty</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es menor que el valor de la propiedad pasada por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">ltProperty("fechaInicio","fechaFin")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">le</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es menor o igual que el valor pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">le("fechaInicio",new Date()-5)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">leProperty</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad es menor o igual que el valor de la propiedad pasada por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">leProperty("fechaInicio","fechaFin")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">like</td>
		<td colspan="1" rowspan="1">La sentencia SQL like</td>
		<td colspan="1" rowspan="1"><span class="codefrag">like("nombre","Fran%")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">ne</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad no es igual al valor pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">ne("tipo","prestamo")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">neProperty</td>
		<td colspan="1" rowspan="1">Cuando el valor de una propiedad no es igual al valor de la propiedad pasada por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">neProperty("fechaInicio","fechaFin")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">order</td>
		<td colspan="1" rowspan="1">Ordena los resultados por la propiedad pasada por par&aacute;metro y en el orden especificado (asc o desc)</td>
		<td colspan="1" rowspan="1"><span class="codefrag">order("nombre","asc")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">rlike</td>
		<td colspan="1" rowspan="1">Similar a la sentencia SQL like, pero utilizando expresiones regulares. S&oacute;lo est&aacute; disponible para Oracle y MySQL</td>
		<td colspan="1" rowspan="1"><span class="codefrag">rlike("nombre",/Fran.+/)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">sizeEq</td>
		<td colspan="1" rowspan="1">Cuando el tama&ntilde;o del valor de una determinada propiedad es igual al pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">sizeEq("nombre",10)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">sizeGt</td>
		<td colspan="1" rowspan="1">Cuando el tama&ntilde;o del valor de una determinada propiedad es mayor al pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">sizeGt("nombre",10)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">sizeGe</td>
		<td colspan="1" rowspan="1">Cuando el tama&ntilde;o del valor de una determinada propiedad es mayor o igual al pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">sizeGe("nombre",10)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">sizeLt</td>
		<td colspan="1" rowspan="1">Cuando el tama&ntilde;o del valor de una determinada propiedad es menor al pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">sizeLt("nombre",10)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">sizeLe</td>
		<td colspan="1" rowspan="1">Cuando el tama&ntilde;o del valor de una determinada propiedad es menor o igual al pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">sizeLe("nombre",10)</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">sizeNe</td>
		<td colspan="1" rowspan="1">Cuando el tama&ntilde;o del valor de una determinada propiedad no es igual al pasado por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">sizeNe("nombre",10)</span></td>
	
</tr>	

</table>
<p>
	Los criterios de b&uacute;squeda se pueden incluso agrupar en bloques l&oacute;gicos. Estos bloques l&oacute;gicos ser&aacute;n del tipo <em>AND</em>, <em>OR</em> y <em>NOT</em>. Veamos algunos ejemplos.
</p>
<pre class="code">and {
	between("fechaInicio", new Date()-10, new Date())
	eq("tipo", "prestamo")
}

or {
	between("fechaInicio", new Date()-10, new Date())
	eq("tipo", "prestamo")
}

not {
	between("fechaInicio", new Date()-10, new Date())
	eq("tipo", "prestamo")
}</pre>
<p>
	Otro aspecto que hace muy interesante las consultas de tipo Criteria, es la forma que tiene de buscar la informaci&oacute;n de clases de dominio relacionadas o asociadas. Un ejemplo podr&iacute;a ser el siguiente. Deseamos saber cuantas operaciones hay asociadas a usuarios de tipo socio. El siguiente c&oacute;digo har&iacute;a esto mismo.
</p>
<pre class="code">def c2 = Operacion.createCriteria()
def resultado2 = c2 {
    usuario {
        eq("tipo","socio")
    }
}</pre>
<p>
	Simplemente, hemos agrupado dentro del bloque <em>usuario</em> las condiciones que queremos que cumplan los usuarios relacionados con las operaciones.
</p>
<p>
	Por &uacute;ltimo, Criteria tambi&eacute;n a&ntilde;ade la posibilidad de utilizar operaciones agrupadas del estilo <em>distinct</em>, <em>min</em> o <em>max</em> con lo que se conoce como <em>proyecciones</em>. Si quisi&eacute;ramos conocer cuantos usuarios distintos tienen operaciones asignadas, podr&iacute;amos realizar la siguiente consulta Criteria.
</p>
<pre class="code">def c3 = Operacion.createCriteria()

def numeroUsuarios = c3.get {
    projections {
        countDistinct('usuario')
    }
}</pre>
<p>
	Las posibles m&eacute;todos que tenemos para agrupar resultados son los mostrados en la siguiente tabla.
</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	
<tr>
		
<th colspan="1" rowspan="1">Nombre</th>
		<th colspan="1" rowspan="1">Descripci&oacute;n</th>
		<th colspan="1" rowspan="1">Ejemplo</th>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">property</td>
		<td colspan="1" rowspan="1">Devuelve la propiedad dada en los resultados</td>
		<td colspan="1" rowspan="1"><span class="codefrag">property("fechaInicio")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">distinct</td>
		<td colspan="1" rowspan="1">Devuelve los resultados utilizando una colecci&oacute;n de nombres de propiedades</td>
		<td colspan="1" rowspan="1"><span class="codefrag">distinct("fechaInicio", "fechaFin")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">avg</td>
		<td colspan="1" rowspan="1">Devuelve la media de los valores de la propiedad dada</td>
		<td colspan="1" rowspan="1"><span class="codefrag">avg("edad")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">count</td>
		<td colspan="1" rowspan="1">Devuelve el n&uacute;mero de valores de la propiedad dada</td>
		<td colspan="1" rowspan="1"><span class="codefrag">count("nombre")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">countDistinct</td>
		<td colspan="1" rowspan="1">Devuelve el n&uacute;mero de valores distintos de la propiedad dada</td>
		<td colspan="1" rowspan="1"><span class="codefrag">countDistinct("tipo")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">groupProperty</td>
		<td colspan="1" rowspan="1">Agrupa los resultados por la propiedad pasada por par&aacute;metro</td>
		<td colspan="1" rowspan="1"><span class="codefrag">groupProperty("usuario")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">max</td>
		<td colspan="1" rowspan="1">Devuelve el valor m&aacute;ximo de la propiedad dada</td>
		<td colspan="1" rowspan="1"><span class="codefrag">max("edad")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">min</td>
		<td colspan="1" rowspan="1">Devuelve el valor m&iacute;nimo de la propiedad dada</td>
		<td colspan="1" rowspan="1"><span class="codefrag">min("edad")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">sum</td>
		<td colspan="1" rowspan="1">Devuelve la suma de los valores de la propiedad dada</td>
		<td colspan="1" rowspan="1"><span class="codefrag">sum("ingresos")</span></td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">rowCount</td>
		<td colspan="1" rowspan="1">Devuelve el n&uacute;mero de filas devueltas</td>
		<td colspan="1" rowspan="1"><span class="codefrag">rowCount()</span></td>
	
</tr>

</table>
</div>


<a name="N106E1"></a><a name="Servicios"></a>
<h2 class="underlined_10">Servicios</h2>
<div class="section">
<p>
	En cualquier aplicaci&oacute;n que utilice el patr&oacute;n Modelo Vista Controlador, la capa de servicios debe ser la responsable de la l&oacute;gica de negocio de nuestra aplicaci&oacute;n. Si conseguimos esto, nuestra aplicaci&oacute;n ser&aacute; f&aacute;cil de mantener y evolucionar&aacute; de forma sencilla y eficiente.
</p>
<p>
	Cuando implementamos una aplicaci&oacute;n siguiendo el patr&oacute;n MVC, el principal error que se comete es acumular demasiado c&oacute;digo en la capa de control (controladores). Si en lugar de hacer esto, implement&aacute;semos servicios encargados de esta tarea, nuestra aplicaci&oacute;n ser&iacute;a m&aacute;s f&aacute;cil de mantener. Pero, &iquest;qu&eacute; son los servicios en Grails?.
</p>
<p>
	Siguiendo el paradigma de <em>convenci&oacute;n sobre configuraci&oacute;n</em>, los servicios no son m&aacute;s que clases cuyo nombre termina en <em>Service</em> y que se ubica en el directorio <em>grails-app/services</em>.
</p>
<p>
	En la aplicaci&oacute;n ejemplo que estamos desarrollando como ejemplo, vamos a crear un servicio para dar de alta nuevos usuarios. Para ello, en primer lugar debemos crear el esqueleto del servicio con el comando <span class="codefrag">grails create-service usuario</span>. Este comando, adem&aacute;s del servicio, tambi&eacute;n crear&aacute; un test unitario. La clase de servicio que hemos creado tiene la siguiente estructura
</p>
<pre class="code">package biblioteca
	
class UsuarioService {

    static transactional = true

    def serviceMethod() {

    }
}</pre>
<p>
	Mientras que el contenido del test ser&iacute;a el siguiente
</p>
<pre class="code">package biblioteca
	
import grails.test.*

class UsuarioServiceTests extends GrailsUnitTestCase {
    protected void setUp() {
        super.setUp()
    }

    protected void tearDown() {
        super.tearDown()
    }

    void testSomething() {

    }
}</pre>
<p>
	Pero centr&eacute;monos en la clase de servicio <em>UsuarioService</em>. En primer lugar, vemos una variable de tipo <em>booleano</em> que indica si el servicio en cuesti&oacute;n es <em>transaccional</em> o no. Si declaramos el servicio como transaccional, estamos indicando que en caso de que se produzca cualquier error o excepci&oacute;n, las operaciones realizadas ser&aacute;n desechadas.
</p>
<p>
	Si lo que necesitamos es definir la transaccionalidad a nivel de m&eacute;todo, podemos conseguirlo utilizando la anotaci&oacute;n <span class="codefrag">@Transactional</span>.
</p>
<pre class="code">import org.springframework.transaction.annotation.*
	
class LibroService{
	<strong>@Transactional(readOnly = true)</strong>
	def listLibros() { Libro.list()}
	
	<strong>@Transactional</strong> def updateLibro(){
		//...
	}
}</pre>
<p>
	Puedes encontrar m&aacute;s informaci&oacute;n sobre el uso de la transaccionalidad en la <a class="external" href="http://static.springsource.org/spring/docs/3.0.x/spring-framework-reference/html/transaction.html#transaction-declarative-annotations">documentaci&oacute;n de Spring</a>.
</p>
<p>
	A continuaci&oacute;n, vamos a sustituir el m&eacute;todo de ejemplo del servicio <span class="codefrag">serviceMethod()</span> por uno propio que cree un nuevo usuario en nuestra aplicaci&oacute;n. El m&eacute;todo recibir&aacute; un mapa con todos los par&aacute;metros necesarios para la creaci&oacute;n del usuario y devolver&aacute; una instancia de la clase <em>Usuario</em>.
</p>
<pre class="code">Usuario altaUsuario(params) {
    def u = new Usuario(params)

    //Comprobamos los datos introducidos con las restricciones
    //de la clase de dominio Usuario
    if (u.validate()){
        //Almacenamos en la base de datos
        u.save()
    }

    return u
}</pre>
<p>
	En primer lugar, creamos una nueva instancia de la clase <em>Usuario</em> a partir de los par&aacute;metros recibidos. A continuaci&oacute;n se validan las restricciones correspondientes con la nueva instancia con el m&eacute;todo <span class="codefrag">validate()</span> y en caso de que no haya ning&uacute;n problema, se almacena la informaci&oacute;n del nuevo usuario en la base de datos. Si se produce alg&uacute;n error, la propiedad <em>errors</em> del objeto <em>u</em> contendr&aacute; los errores producidos y se devolver&aacute; al controlador los datos del nuevo usuario (que no se ha almacenado en la base de datos) con todos los errores para que el controlador decida que hacer.
</p>
<p>
	El siguiente paso, ser&aacute; modificar el controlador de la clase de dominio <em>Usuario</em> para que en lugar de implementar &eacute;l mismo la l&oacute;gica de negocio para dar de alta un usuario, le ceda esta parte al servicio reci&eacute;n creado.
</p>
<pre class="code">def save = {
    def usuarioInstance = usuarioService.altaUsuario(params)
    if(!usuarioInstance.hasErrors()) {
        flash.message = "${message(code: 'default.created.message', 
          args: [message(code: 'usuario.label', default: 'Usuario'), usuarioInstance.id])}"
        redirect(action:show,id:usuarioInstance.id)
    }
    else {
        render(view:'create',model:[usuarioInstance:usuarioInstance])
    }
}</pre>
<p>
	Al inicio del controlador debemos crear tambi&eacute;n la variable <span class="codefrag">def usuarioService</span> para poder utilizar sus servicios. La convenci&oacute;n es que esta variable debe llamarse igual que el servicio salvo que la primera letra ser&aacute; min&uacute;scula. De esta forma, una instancia del servicio correspondiente se inyectar&aacute; convenientemente en nuestro controlador, con lo que no debemos preocuparnos por su ciclo de vida.
</p>
<p>
	Por defecto, todos los servicios en Grails son de tipo <em>singleton</em>, es decir, s&oacute;lo existe una instancia de la clase que se inyecta en todos los artefactos que declaren la variable correspondiente. Esto puede servirnos para la mayor&iacute;a de las situaciones, pero tiene un inconveniente y es que no es posible guardar informaci&oacute;n <em>privada</em> de una petici&oacute;n en el propio servicio puesto que todos los controladores ver&iacute;an la misma instancia y por lo tanto, el mismo valor. Para solucionar esto, podemos declarar una variable <span class="codefrag">scope</span> con cualquiera de los siguiente valores:
</p>
<ul>
	
<li>
<em>prototype</em>: cada vez que se inyecta el servicio en otro artefacto se crea una nueva instancia</li>
	
<li>
<em>request</em>: se crea una nueva instancia para cada solicitud HTTP</li>
	
<li>
<em>flash</em>: cada instancia estar&aacute; accesible para la solicitud HTTP actual y para la siguiente</li>
	
<li>
<em>flow</em>: cuando declaramos el servicio en un web flow, se crear&aacute; una instancia nueva en cada flujo</li>
	
<li>
<em>conversation</em>: cuando declaramos el servicio en un web flow, la instancia ser&aacute; visible para el flujo actual y todos sus sub-flujos (conversaci&oacute;n)</li>
	
<li>
<em>session</em>: se crear&aacute; una instancia nueva del servicio para cada sesi&oacute;n de usuario</li>
	
<li>
<em>singleton</em>: s&oacute;lo existe una instancia del servicio</li>

</ul>
<p>
	Por lo tanto, si queremos modificar el &aacute;mbito del servicio para que cada sesi&oacute;n de usuario tenga su propia instancia del servicio, debemos declararlos as&iacute;:
</p>
<pre class="code">class UsuarioService{
	static scope = 'session'
	.......
}</pre>
<a name="N10792"></a><a name="Servicio+de+mensajer%C3%ADa"></a>
<h3 class="underlined_5">Servicio de mensajer&iacute;a</h3>
<p>
	Un servicio t&iacute;pico de cualquier aplicaci&oacute;n web suele ser el que se refiere al env&iacute;o de correos electr&oacute;nicos. En nuestra aplicaci&oacute;n, vamos a crear un servicio que sea capaz de enviar emails a los usuarios de nuestro sistema. Este servicio podr&aacute; ser utilizado para por ejemplo, el env&iacute;o de avisos a los usuarios que deben devolver libros puesto que el pr&eacute;stamo de los mismos ha caducado o incluso para avisarles de que el libro que hab&iacute;an solicitado est&aacute; disponible.
</p>
<p>
	En Grails existe un plugin llamado <a class="external" href="http://grails.org/Mail+Plugin">Mail</a> que facilita much&iacute;simo la labor de env&iacute;o de correos electr&oacute;nicos, as&iacute; que lo primero que tenemos que hacer es instalarlo con el comando <span class="codefrag">grails install-plugin mail</span>.
</p>
<p>
	La configuraci&oacute;n de este plugin es relativamente sencilla y s&oacute;lo es necesario a&ntilde;adir un nuevo par&aacute;metro en el archivo <em>grails-app/conf/Config.groovy</em> para indicarle el servidor SMTP que vamos a utilizar en el env&iacute;o de los emails. En nuestro caso, podemos hacer uso del servidor de correo de la Universidad de Alicante, con lo que a&ntilde;adiremos:
</p>
<pre class="code">grails.mail.host = "mail.ua.es"</pre>
<p>
	Si necesitamos configurar otro gestor de correo diferente podemos acceder a la <a class="external" href="http://www.grails.org/plugin/mail">documentaci&oacute;n del plugin</a> donde hay varios ejemplos de configuraciones.
</p>
<p>
	Una vez instalado y configurado el plugin, vamos a crear un nuevo servicio que har&aacute; de intermediario entre los controladores y el plugin. Al nuevo servicio lo vamos a llamar <em>Notificador</em> y para crearlo ejecutamos el comando <span class="codefrag">grails create-service Notificador</span>.
</p>
<p>
	Este servicio por el momento s&oacute;lo tendr&aacute; un m&eacute;todo que ser&aacute; el encargado de enviar los emails y lo llamaremos <span class="codefrag">mandarMails()</span>. Adem&aacute;s, en el servicio necesitamos definir la llamada al servicio instalado con el plugin <em>Mail</em>.
</p>
<pre class="code">package biblioteca

class NotificadorService {

    boolean transactional = false

    def mailService

    def mandarMails(email) {
        mailService.sendMail {
            to email
            from "fgarcia@ua.es"
            subject "Estoy probando mi servicio de env&iacute;o de emails"
            body "Disculpa las molestias"
        }
    }
}</pre>
<p>
	Ahora que ya tenemos creado el servicio, vamos a probarlo creando un nuevo m&eacute;todo en el controlador de la clase <em>Usuario</em> para enviar un mail de prueba. El nuevo m&eacute;todo se llamar&aacute; <span class="codefrag">enviarEmails()</span> y enviar&aacute; un email de prueba a nuestra propia direcci&oacute;n de correo electr&oacute;nico. Posteriormente, mostrar&aacute; por pantalla un texto indicando que el email se han enviado correctamente.
</p>
<p>
	No olvidas inyectar el servicio <em>notificador</em> en el controlador de la clase <em>Usuario</em> indicando al inicio de la clase el c&oacute;digo <span class="codefrag">def notificadorService</span>.
</p>
<pre class="code">def enviarEmails = {
    notificadorService.mandarMails("fgarcia@ua.es")
    render "El email ha sido enviado correctamente"
}</pre>
<p>
	Si ahora accedemos a la direcci&oacute;n http://localhost:8080/biblioteca/usuario/enviarEmails comprobaremos como el correo electr&oacute;nico se ha enviado correctamente.
</p>
</div>


<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2010-2011 Depto. Ciencia de la Computaci&oacute;n e IA</div>
</div>
<script type="text/javascript">
     
         SyntaxHighlighter.defaults['toolbar'] = false;
         SyntaxHighlighter.autoloader(
  		     'java                   skin/highlight/shBrushJava.js',
  		     'xml xhtml xslt html    skin/highlight/shBrushXml.js',
  		     'js jscript javascript  skin/highlight/shBrushJScript.js',
  		     'groovy                 skin/highlight/shBrushGroovy.js',
  		     'bash shell             skin/highlight/shBrushBash.js',
  		     'php                    skin/highlight/shBrushPhp.js',
  		     'css                    skin/highlight/shBrushCss.js',
  		     'sql                    skin/highlight/shBrushSql.js',
  		     'objc                   skin/highlight/shBrushObjC.js',
  		     'cpp c                  skin/highlight/shBrushCpp.js',
  		     'text plain             skin/highlight/shBrushPlain.js'
         );
         SyntaxHighlighter.all();
     </script><a href="skin/highlight/shBrushJava.js"></a><a href="skin/highlight/shBrushXml.js"></a><a href="skin/highlight/shBrushJScript.js"></a><a href="skin/highlight/shBrushGroovy.js"></a><a href="skin/highlight/shBrushBash.js"></a><a href="skin/highlight/shBrushPhp.js"></a><a href="skin/highlight/shBrushCss.js"></a><a href="skin/highlight/shBrushSql.js"></a><a href="skin/highlight/shBrushObjC.js"></a><a href="skin/highlight/shBrushCpp.js"></a><a href="skin/highlight/shBrushPlain.js"></a>
</body>
</html>
