<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Introducci&oacute;n a Groovy</title>
<link type="text/css" href="../skin/highlight/shCore.css" rel="stylesheet">
<link type="text/css" href="../skin/highlight/shThemeEclipse.css" rel="stylesheet">
<script src="../skin/highlight/shCore.js" type="text/javascript"></script><script src="../skin/highlight/shAutoloader.js" type="text/javascript"></script>
<link type="text/css" href="../skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="../skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="../skin/print.css" rel="stylesheet">
<link type="text/css" href="../skin/profile.css" rel="stylesheet">
<script src="../skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="../skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="../skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="../index.html">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="jtech" src="../images/baner_j2ee_izq.gif" title="Especialista Universitario Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Groovy&amp;Grails: desarrollo r&aacute;pido de aplicaciones" src="../images/baner_j2ee_der.gif" title="Groovy&amp;Grails: desarrollo r&aacute;pido de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">Home</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Sesiones</a>
</li>
<li>
<a class="base-not-selected" href="../ejercicios/index.html">Ejercicios</a>
</li>
<li>
<a class="base-not-selected" href="../bibliografia/index.html">Bibliograf&iacute;a</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', '../skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('../skin/images/chapter_open.gif');">Sesiones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menupage">
<div class="menupagetitle">Sesi&oacute;n 1</div>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html" title="El lenguaje Groovy">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html" title="Aspectos avanzados en Groovy">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html" title="Librer&iacute;as propias en Groovy">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html" title="Introducci&oacute;n a Grails">Sesi&oacute;n 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html" title="Construir la interfaz de usuario (I)">Sesi&oacute;n 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html" title="Controladores">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html" title="Construir la interfaz de usuario (II)">Sesi&oacute;n 8</a>
</div>
<div class="menuitem">
<a href="sesion09-apuntes.html" title="Dominios y servicios (I)">Sesi&oacute;n 9</a>
</div>
<div class="menuitem">
<a href="sesion10-apuntes.html" title="Dominios y servicios (II)">Sesi&oacute;n 10</a>
</div>
<div class="menuitem">
<a href="sesion11-apuntes.html" title="Seguridad">Sesi&oacute;n 11</a>
</div>
<div class="menuitem">
<a href="sesion12-apuntes.html" title="Despliegue de aplicaciones">Sesi&oacute;n 12</a>
</div>
<div class="menuitem">
<a href="sesion13-apuntes.html" title="Web 2.0">Sesi&oacute;n 13</a>
</div>
<div class="menuitem">
<a href="sesion14-apuntes.html" title="AJAX">Sesi&oacute;n 14</a>
</div>
<div class="menuitem">
<a href="sesion15-apuntes.html" title="Dos horas para crear twitter">Sesi&oacute;n 15</a>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="../skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion01-apuntes.pdf"><img alt="PDF -icon" src="../skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Introducci&oacute;n a Groovy</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#%C2%BFQu%C3%A9+es%3F">&iquest;Qu&eacute; es?</a>
<ul class="minitoc">
<li>
<a href="#Integraci%C3%B3n+con+Java">Integraci&oacute;n con Java</a>
</li>
<li>
<a href="#%C2%BFA+qui%C3%A9n+va+dirigido+Groovy%3F">&iquest;A qui&eacute;n va dirigido Groovy?</a>
</li>
<li>
<a href="#Editores+Groovy">Editores Groovy</a>
</li>
</ul>
</li>
<li>
<a href="#Instalaci%C3%B3n">Instalaci&oacute;n</a>
</li>
<li>
<a href="#Hola+Mundo">Hola Mundo</a>
</li>
<li>
<a href="#Caracter%C3%ADsticas">Caracter&iacute;sticas</a>
<ul class="minitoc">
<li>
<a href="#Comentarios">Comentarios</a>
</li>
<li>
<a href="#Comparando+la+sintaxis+de+Java+y+Groovy">Comparando la sintaxis de Java y Groovy</a>
</li>
<li>
<a href="#Brevedad+del+lenguaje">Brevedad del lenguaje</a>
</li>
<li>
<a href="#Aserciones">Aserciones</a>
</li>
<li>
<a href="#Un+primer+vistazo+al+c%C3%B3digo+en+Groovy">Un primer vistazo al c&oacute;digo en Groovy</a>
<ul class="minitoc">
<li>
<a href="#Declaraci%C3%B3n+de+clases">Declaraci&oacute;n de clases</a>
</li>
<li>
<a href="#Scripts+en+Groovy">Scripts en Groovy</a>
</li>
<li>
<a href="#GroovyBeans">GroovyBeans</a>
</li>
<li>
<a href="#Trabajar+con+cadenas+de+texto">Trabajar con cadenas de texto</a>
</li>
<li>
<a href="#Los+n%C3%BAmeros+son+objetos">Los n&uacute;meros son objetos</a>
</li>
<li>
<a href="#Listas%2C+mapas+y+rangos">Listas, mapas y rangos</a>
</li>
<li>
<a href="#Closures">Closures</a>
</li>
<li>
<a href="#Estructuras+de+control+en+Groovy">Estructuras de control en Groovy</a>
</li>
</ul>
</li>
</ul>
</li>
<li>
<a href="#Groovy+en+el+entorno+Java">Groovy en el entorno Java</a>
<ul class="minitoc">
<li>
<a href="#GDK%3A+la+librer%C3%ADa+Groovy">GDK: la librer&iacute;a Groovy</a>
</li>
</ul>
</li>
</ul>
</div>
         

<p>En esta primera sesi&oacute;n del curso, empezaremos explicando qu&eacute; es el lenguaje de programaci&oacute;n Groovy y, c&oacute;mo, d&oacute;nde y porqu&eacute; se creo para ponernos un poco en situaci&oacute;n. Posteriormente, pasaremos a implementar nuestro primer ejemplo en Groovy, el t&iacute;pico Hola Mundo y lo compararemos con lo que ser&iacute;a el mismo ejemplo en Java.</p>
  

<p>En tercer lugar, describiremos detalladamente algunos aspectos b&aacute;sicos de Groovy, tales como la sintaxis, las aserciones, el trabajo con cadenas de texto, los closures y las estructuras de control, entre otros. Terminaremos explicando como se maneja Groovy en el entorno Java.</p>


<a name="N10012"></a><a name="%C2%BFQu%C3%A9+es%3F"></a>
<h2 class="underlined_10">&iquest;Qu&eacute; es?</h2>
<div class="section">
<p>
Mientras James Strachan esperaba junto a su mujer para embarcar en su vuelo de vuelta casa, ella decidi&oacute; dar un paseo y realizar las &uacute;ltimas compras. Mientras tanto, James visito un cibercaf&eacute; del aeropuerto con la intenci&oacute;n de aprender algo sobre Python. James era un experto programador Java, y enseguida se dio cuenta de que Python ten&iacute;a algunas interesantes caracter&iacute;sticas que podr&iacute;an ser muy atractivas para los desarrolladores Java. Entre estas caracter&iacute;sticas destacaban el soporte nativo para tipos de datos comunes mediante una sintaxis muy intuitiva, y lo que era m&aacute;s importante, el comportamiento din&aacute;mico de los mismos.
</p>
<p>
Groovy naci&oacute; con la intenci&oacute;n de ser un lenguaje rico en caracter&iacute;sticas, as&iacute; como para desenvolverse bien en el entorno Java, para de esta forma, utilizar los beneficios de los lenguajes din&aacute;micos en una plataforma tan robusta como es Java y todo su entorno. Posiblemente, hay muchos lenguajes que tienen m&aacute;s caracter&iacute;sticas t&iacute;picas de los lenguajes din&aacute;micos que Groovy y se integran mejor en la Plataforma Java, pero ninguno de esos lenguajes, presenta una combinaci&oacute;n de estos detalles (lenguaje din&aacute;mico y entorno Java) tan eficiente como Groovy. Pero, <em>&iquest;c&oacute;mo podr&iacute;amos definir exactamente Groovy?</em>

</p>
<p>
Una buena definici&oacute;n de Groovy podr&iacute;a ser la que se nos proporciona desde la propia p&aacute;gina web de Groovy (<a class="external" href="http://groovy.codehaus.org">http://groovy.codehaus.org</a>):
</p>
<div class="frame note">
<div class="label">Definici&oacute;n</div>
<div class="content">
Groovy es un lenguaje de programaci&oacute;n &aacute;gil y din&aacute;mico dise&ntilde;ado para la Plataforma Java con determinadas caracter&iacute;sticas inspiradas en lenguajes como Python, Ruby o Smalltalk, poni&eacute;ndolas a disposici&oacute;n de los programadores Java mediante una sintaxis t&iacute;pica de Java.
</div>
</div>
<p>
En ocasiones se tacha a Groovy de ser un lenguaje meramente de script, pero esto es un error, a pesar de que Groovy funciona realmente bien como lenguaje script. Groovy puede ser precompilado a Java bytecode, estar integrado en aplicaciones Java, construir robustas aplicaciones web, a&ntilde;adir un punto de control adicional a nuestros archivos e incluso ser la base de una aplicaci&oacute;n completa por si solo. 	
</p>
<p>
Se puede afirmar rotundamente que Groovy est&aacute; destinado a ser utilizado en la Plataforma Java, no en vano muchas partes de Groovy est&aacute;n desarrolladas en Java, as&iacute; que si decimos que <em>al programar en Groovy, estamos realmente programando en Java</em>, no estamos diciendo ninguna barbaridad. Todas las caracter&iacute;sticas de Java est&aacute;n esperando a ser utilizadas en Groovy, incluido todo el conjunto de librer&iacute;as de Java.	
</p>
<a name="N10035"></a><a name="Integraci%C3%B3n+con+Java"></a>
<h3 class="underlined_5">Integraci&oacute;n con Java</h3>
<p>
Cuando hablamos de <em>integraci&oacute;n con Java</em>, nos referimos a dos aspectos. Por un lado, de integraci&oacute;n imperceptible, puesto que Groovy es simplemente una nueva forma de crear nuestras habituales clases Java. Al fin y al cabo, Groovy es Java con un archivo jar como dependencia. Por otro lado, la sintaxis de Groovy es m&aacute;s precisa y compacta que en Java y a pesar de eso, cualquier programador Java puede entender el funcionamiento de un fragmento de c&oacute;digo escrito en Groovy.
</p>
<a name="N10042"></a><a name="%C2%BFA+qui%C3%A9n+va+dirigido+Groovy%3F"></a>
<h3 class="underlined_5">&iquest;A qui&eacute;n va dirigido Groovy?</h3>
<ul>
	
<li>
		
<strong>A los programadores Java</strong>.
		<p>
			Un programador Java con muchos a&ntilde;os de experiencia conocer&aacute; todas las partes importantes del entorno Java y su API, as&iacute; como otros paquetes adicionales. Sin embargo, algo aparentemente tan sencillo como listar todos los archivos recursivamente que cuelgan de un directorio se hace pesado en Java y suponiendo que existiera la funci&oacute;n <span class="codefrag">eachFileRecurse()</span> tendr&iacute;amos algo similar a:
	 	</p>

<pre class="code">public class ListFiles {
	public static void main(String[] args){
		new java.io.File(".").eachFileRecurse(
			new FileListener() {
				public void onFile (File file) {
					System.out.println(file.toString());
				}
			}
		);
	}
}</pre>

<p>
	Mientras que con Groovy quedar&iacute;a en una sola l&iacute;nea:
</p>

<pre class="code">groovy -e "new File('.').eachFileRecurse { println it}"</pre>
	
</li>
	
<li>
		
<strong>A los programadores de scripts</strong>
		
<p>
			Groovy tambi&eacute;n va dirigido a aquellos programadores que han pasado muchos a&ntilde;os trabajando con lenguajes de programaci&oacute;n como Perl, Ruby, Python o PHP. En ocasiones, sobre todo en las grandes empresas, los clientes requieren obligatoriamente el uso de una Plataforma robusta como puede ser Java. Estos programadores deben reciclarse, ya que no es factible cualquier soluci&oacute;n que pase por utilizar un lenguaje script como los mencionados anteriormente.
		</p>
		
		
<p>	
			Continuamente este tipo de programadores afirman que se sienten frustrados por toda la ceremonia que conlleva un lenguaje como Java y la frase <em>"si pudiera utilizar un lenguaje como Ruby, podr&iacute;a escribir todo este m&eacute;todo en una sola l&iacute;nea"</em> es su pan de cada d&iacute;a. Groovy puede darles un respiro y una v&iacute;a de escape a este tipo de programadores.
		</p>
	
</li>
	
<li>
		
<strong>A los programadores &aacute;giles y extremos</strong>
		
<p>
			Este tipo de programadores est&aacute;n acostumbrados a trabajar con la pr&oacute;xima revisi&oacute;n tan cercana, que pararse a pensar en utilizar un nuevo lenguaje de programaci&oacute;n queda fuera de sus principales objetivos. Sin embargo, una de los aspectos m&aacute;s importantes para los programadores &aacute;giles, consiste en tener siempre a su disposici&oacute;n los mejores recursos y metodolog&iacute;as para llevar a cabo su trabajo.
		</p>
		
		
<p>
			Y ah&iacute; es donde Groovy les puede aportar mucho, ya que Groovy es un lenguaje perfecto para realizar esas tareas de automatizaci&oacute;n tan habituales en sus proyectos. Estas tareas van desde la integraci&oacute;n continua y la realizaci&oacute;n de informes, hasta la documentaci&oacute;n autom&aacute;tica e instalaci&oacute;n.
		</p>
	
</li>		

</ul>
<a name="N1007E"></a><a name="Editores+Groovy"></a>
<h3 class="underlined_5">Editores Groovy</h3>
<p>
A la hora de aprender un nuevo lenguaje de programaci&oacute;n, es recomendable utilizar editores que soporten este lenguaje, aunque simplemente sea utilizado para resaltar la sintaxis, ya que nos ayudar&aacute; en nuestros comienzos. Vamos a ver algunos de estos editores, aunque con la evoluci&oacute;n que est&aacute; teniendo Groovy en los &uacute;ltimos tiempos, cada vez m&aacute;s editores est&aacute;n a&ntilde;adiendo soporte para escribir nuestros programas en Groovy.
</p>
<ul>
	
<li>
		
<strong>Plugin para IntelliJ IDEA</strong>
		
<p>
			La comunidad open source ha dise&ntilde;ado un plugin llamado GroovyJ que permite:
		</p>
		
<ul>
			
<li>Resaltar la sintaxis</li>
			
<li>Completado de c&oacute;digo</li>
			
<li>F&aacute;cil integraci&oacute;n con los procesos de compilaci&oacute;n y ejecuci&oacute;n</li>
			
<li>Cantidad de acciones avanzadas &uacute;tiles en Java que tambi&eacute;n puede ser utilizadas con Groovy</li>
			
<li>Depurador de c&oacute;digo Groovy</li>
		
</ul>
		
<p>
			M&aacute;s informaci&oacute;n en: <a class="external" href="http://www.jetbrains.com/idea/features/groovy_grails.html">http://www.jetbrains.com/idea/features/groovy_grails.html</a>
		
</p>
	
</li>
	
<li>
		
<strong>Plugin para Eclipse</strong>
		
<p>
			Este plugin nos permite:
		</p>
		
<ul>
			
<li>Resaltado de sintaxis</li>
			
<li>Compilar y ejecutar scripts de Groovy directamente desde el IDE</li>
			
<li>Refactorizaci&oacute;n</li>
			
<li>Autocompletado de c&oacute;digo</li>
		
</ul>
		
<p>
			M&aacute;s informaci&oacute;n en: <a class="external" href="http://groovy.codehaus.org/Eclipse+Plugin">http://groovy.codehaus.org/Eclipse+Plugin</a>. Tambi&eacute;n podemos hacer uso del <a class="external" href="http://www.springsource.com/developer/sts">SpringSource Tool Suite</a>, que no es m&aacute;s que una herramientas basada en Eclipse pero que facilita mucho el trabajo con aquellas tecnolog&iacute;as desarrolladas por Spring, entre las que se encuentra Grails.
		</p>
	
</li>
	
<li>
		
<strong>NetBeans</strong>
		
<ul>
			
<li>Resaltado de sintaxis</li>
			
<li>Ejecuci&oacute;n de scripts</li>
			
<li>Asistente para proyectos Groovy</li>
			
<li>Autocompletado de c&oacute;digo</li>
		
</ul>
		
<p>
		M&aacute;s informaci&oacute;n en: <a class="external" href="http://groovy.codehaus.org/Netbeans+Plugin">http://groovy.codehaus.org/Netbeans+Plugin</a> y en <a class="external" href="http://wiki.netbeans.org/Groovy">http://wiki.netbeans.org/Groovy</a>
		
</p>
	
</li>
	
<li>
		
<strong>UltraEdit</strong>
		
<ul>
			
<li>Resaltado de sintaxis</li>
			
<li>Compilaci&oacute;n y ejecuci&oacute;n de nuestros scripts</li>
			
<li>F&aacute;cil navegaci&oacute;n por las clases y m&eacute;todos de los archivos</li>
			
<li>Sangrado de c&oacute;digo inteligente</li>
			
<li>Autocompletado de c&oacute;digo</li>
		
</ul>
		
<p>
			M&aacute;s informaci&oacute;n en: <a class="external" href="http://groovy.codehaus.org/UltraEdit+Plugin">http://groovy.codehaus.org/UltraEdit+Plugin</a>
		
</p>
	
</li>
	
<li>
		
<strong>Plugin para JEdit</strong>
			
<p>El plugin se puede descargar desde la direcci&oacute;n <a class="external" href="http://plugins.jedit.org/plugins/?SuperScript">http://plugins.jedit.org/plugins/?SuperScript</a>
</p>
			
<ul>
				
<li>Resaltado de sintaxis</li>
				
<li>Ejecuci&oacute;n de scripts</li>
			
</ul>
		
<p>
			M&aacute;s informaci&oacute;n en: <a class="external" href="http://groovy.codehaus.org/JEdit+Plugin">http://groovy.codehaus.org/JEdit+Plugin</a>
		
</p>
	
</li>

</ul>
</div>


<a name="N1012C"></a><a name="Instalaci%C3%B3n"></a>
<h2 class="underlined_10">Instalaci&oacute;n</h2>
<div class="section">
<p>
	Antes de avanzar en la sesi&oacute;n, vamos a ver como se realizar&iacute;a la instalaci&oacute;n de Groovy en nuestro ordenador. En primer lugar debemos descargar la versi&oacute;n m&aacute;s reciente de Groovy desde la web <a class="external" href="http://groovy.codehaus.org/Download">http://groovy.codehaus.org/Download</a>. En el momento de escribir estas l&iacute;neas, la versi&oacute;n oficial de Groovy era la 1.7.10.
</p>
<p>
	Posteriormente debemos descomprimir el archivo descargado en un directorio conocido y establecer la variable de entorno <span class="codefrag">GROOVY_HOME</span> para que apunte al directorio donde acabamos de descomprimir el archivo. Tambi&eacute;n debemos a&ntilde;adir el directorio <span class="codefrag">GROOVY_HOME/bin</span> a la variable de entorno <span class="codefrag">PATH</span> de nuestro sistema.
</p>
<p>
	Por &uacute;ltimo, necesitaremos tambi&eacute;n establecer la variable <span class="codefrag">JAVA_HOME</span> para que apunte a la versi&oacute;n del JDK que tengamos instalado en nuestro equipo. Haciendo esto, ya podr&iacute;amos empezar a realizar nuestros primeros ejemplos en Groovy.
</p>
</div>


<a name="N1014C"></a><a name="Hola+Mundo"></a>
<h2 class="underlined_10">Hola Mundo</h2>
<div class="section">
<p>
	Ahora que ya tenemos una primera idea de lo que es Groovy, vamos a pasar a desarrollar nuestro primer ejemplo y a realizar nuestras primeras pruebas de ejecuci&oacute;n y compilaci&oacute;n de archivos Groovy. Pero antes de eso, vamos a introducir las diferentes formas de ejecutar nuestros programas en Groovy. 
</p>
<p>
	Si hemos descargado y descomprimido la &uacute;ltima versi&oacute;n de Groovy, podemos comprobar que en el directorio <em>bin</em> se encuentran una serie de archivos entre los que podemos observar <em>groovysh</em>, <em>groovyConsole</em> y <em>groovy</em>, entre otros. Podemos utilizar cualquiera de estos tres archivos para empezar a realizar nuestras pruebas con c&oacute;digo Groovy. Vamos a verlos uno a uno:
</p>
<ul>
		
<li>
			
<strong>groovysh</strong>
			
<p>
				Permite ejecutar en l&iacute;nea de comandos c&oacute;digo Groovy de forma interactiva. M&aacute;s informaci&oacute;n en <a class="external" href="http://groovy.codehaus.org/Groovy+Shell">http://groovy.codehaus.org/Groovy+Shell</a>.
			</p>

<pre class="code">groovy:000&gt; "Hola Mundo!"

====&gt; Hola Mundo!</pre>
			
<p>
				Otro ejemplo podr&iacute;a ser:
			</p>

<pre class="code">groovy:000&gt; saludo = "Hola"
===&gt; Hola
groovy:000&gt; "${saludo} Mundo!"

===&gt; Hola Mundo!</pre>
			
<p>
				E incluso podemos definir funciones con par&aacute;metros:
			</p>

<pre class="code">groovy:000&gt; def hola(nombre){
groovy:001&gt; println "Hola $nombre"
groovy:002&gt; }
===&gt; true
groovy:000&gt; hola("Fran") 
Hola Fran
====&gt; null</pre>
			
<p>
			Con el comando <strong>help</strong> accederemos a todas las funcionalidades de groovysh, que nos permitir&aacute;n realizar nuestras primeras pruebas con Groovy.
			</p>

<pre class="code">For information about Groovy, visit:
http://groovy.codehaus.org 

Available commands:
	help      (\h ) Display this help message
	?         (\? ) Alias to: help
	exit      (\x ) Exit the shell
	quit      (\q ) Alias to: exit
	import    (\i ) Import a class into the namespace
	display   (\d ) Display the current buffer
	clear     (\c ) Clear the buffer
	show      (\S ) Show variables, classes or imports
	inspect   (\n ) Inspect a variable or the last result with the GUI object browser
	purge     (\p ) Purge variables, classes, imports or preferences
	edit      (\e ) Edit the current buffer
	load      (\l ) Load a file or URL into the buffer
	.         (\. ) Alias to: load
	save      (\s ) Save the current buffer to a file
	record    (\r ) Record the current session to a file
	history   (\H ) Display, manage and recall edit-line history
	alias     (\a ) Create an alias
	set       (\= ) Set (or list) preferences
	register  (\rc) Registers a new command with the shell

	For help on a specific command type:
		help command</pre>
		
</li>
		
<li>
			
<strong>groovyConsole</strong>
			
<p>
				Mediante una interfaz Swing, groovyConsole actua como int&eacute;rprete de comandos Groovy. Tiene la posibilidad de cargar y salvar ficheros desde su men&uacute; File. 
			</p>
			
<p>
				
<img alt="Consola de groovy" height="278" src="../images/sesion1/groovyConsole.jpg" width="443">
			</p>
			
<p>	
				Como podemos observar, en la parte superior podemos escribir nuestro c&oacute;digo Groovy, mientras que la parte inferior nos muestra la salida del programa ejecutado.
			</p>
			
<p>
				Adem&aacute;s la groovyConsole nos permite tambi&eacute;n indicarle archivos jar externos que ser&aacute;n importados autom&aacute;ticamente en el c&oacute;digo de nuestros scripts.
			</p>
		
</li>
		
<li>
			
<strong>groovy</strong>
			
<p>
				El &uacute;ltimo m&eacute;todo sirve para ejecutar archivos groovy y simplemente ejecutando en la l&iacute;nea de comandos <span class="codefrag">groovy holamundo.groovy</span>, podemos ver la salida producida por el programa. En la siguiente imagen, puedes comprobar el funcionamiento de este m&eacute;todo con un fichero de ejemplo que realiza el c&aacute;lculo de la sucesi&oacute;n de Fibonacci.
			</p>
			
<p>
				
<img alt="groovy" height="239" src="../images/sesion1/groovy.jpg" width="504">
			</p>
		
</li>
	
</ul>
<p>
	Quiz&aacute;s ya te hayas dado cuenta, pero a diferencia de en Java, Groovy puede ejecutar sus archivos sin necesidad de compilarlos previamente. Esta forma de utilizar Groovy se llama <strong>Modo directo</strong> y nuestro c&oacute;digo es ejecutado sin necesidad de generar archivos ejecutables. Se puede decir que nuestros archivos son interpretados. Sin embargo, existe otra forma de ejecutar nuestros programas Groovy y se llama <strong>Modo precompilado</strong>. En el modo precompilado, en primer lugar se compila el programa groovy y posteriormente se ejecuta. El programa compilado es compatible con los archivos bytecode de Java. 
</p>
<p>
Para compilar nuestros programas Groovy, utilizamos una sentencia en l&iacute;nea de comandos llamada <strong>groovyc</strong> (tambi&eacute;n alojado en el directorio <em>bin</em>). Si quisieramos compilar el anterior ejemplo (<span class="codefrag">fibonacci.groovy</span>), ejecutar&iacute;amos <span class="codefrag">groovyc -d classes fibonacci.groovy</span>. Con el par&aacute;metro -d le hemos indicado que nos genere los archivos compilados en el directorio <em>classes</em>, y en el caso de que no existiera, lo crear&iacute;a. Si observamos el contenido de este directorio, veremos que hay un par de ficheros .class. El n&uacute;mero de archivos depender&aacute; del propio script, de la misma forma que sucede cuando compilamos archivo en Java. 
</p>
<p>
Una vez ya tenemos nuestro programa compilado, vamos a ver como podr&iacute;amos ejecutarlo con Java. !S&iacute;, con Java!, ya que para ejecutar un programa en Groovy debemos hacer exactamente lo mismo que hacemos en Java. Simplemente, debemos a&ntilde;adir al classpath el archivo jar de Groovy. Debemos hacer lo mismo con el directorio donde residen nuestros archivos compilados. Quedar&iacute;a algo as&iacute;:
</p>
<p>
	
<span class="codefrag">java -cp $GROOVY_HOME/embeddable/groovy-all-1.7.10.jar:classes fibonacci</span>

</p>
</div>


<a name="N101E2"></a><a name="Caracter%C3%ADsticas"></a>
<h2 class="underlined_10">Caracter&iacute;sticas</h2>
<div class="section">
<p>
	En la siguiente secci&oacute;n, vamos a introducir diferentes aspectos b&aacute;sicos del lenguaje Groovy, tales como la introducci&oacute;n de comentarios, diferencias y similitudes con Java, la brevedad del c&oacute;digo en Groovy y otros peque&ntilde;os detalles del lenguaje.
</p>
<a name="N101EB"></a><a name="Comentarios"></a>
<h3 class="underlined_5">Comentarios</h3>
<p>
		Los comentarios en Groovy siguen el mismo formato que en Java. Esto es:
	</p>
<ul>
		
<li>//, comentarios de una l&iacute;nea</li>
		
<li>/* .... */, comentarios multil&iacute;nea</li>
		
<li>/** .... */, comentarios del estilo Javadoc, que nos permitir&aacute; documentos nuestros programas con <em>Groovydoc</em>
</li>
	
</ul>
<p>
		Sin embargo, tambi&eacute;n podemos introducir en la primera l&iacute;nea comentarios del estilo <a class="external" href="http://es.wikipedia.org/wiki/Shebang">shebang</a> con la combinaci&oacute;n de caracteres <strong>#!</strong>
	
</p>
<a name="N1020D"></a><a name="Comparando+la+sintaxis+de+Java+y+Groovy"></a>
<h3 class="underlined_5">Comparando la sintaxis de Java y Groovy</h3>
<p>
		Es habitual leer que la sintaxis de Groovy es una superclase de Java y esto es debido a las grandes similitudes que hay entre ambos lenguajes. Sin embargo, no es correcto afirmar que un lenguaje es una superclase del otro. Existen peque&ntilde;os detalles de programaci&oacute;n en Java que no existen en Groovy, como puede ser el cl&aacute;sico <em>for(inicio;test;incremento)</em> o el operador <em>==</em> que en Groovy tiene unas connotaciones diferentes.
	</p>
<p>
		Pero aparte de estas peque&ntilde;as diferencias, podemos decir que gran parte de la sintaxis de Java es v&aacute;lida en Groovy. Estas similitudes son: 
	</p>
<ul>
			
<li>Mecanismo de paquetes</li>
			
<li>Sentencias</li>
			
<li>Definici&oacute;n de clases y m&eacute;todos</li>
			
<li>Estructuras de control</li>
			
<li>Operadores, asignaciones y expresiones</li>
			
<li>Manejo de excepciones</li>
			
<li>Declaraci&oacute;n de literales</li>
			
<li>Instanciaci&oacute;n de objetos y llamadas a m&eacute;todos</li>
		
</ul>
<p>
		No obstante, Groovy posee un valor a&ntilde;adido gracias a:
	</p>
<ul>
			
<li>F&aacute;cil acceso a los objetos Java a trav&eacute;s de nuevas expresiones y operadores</li>
			
<li>Nuevas formas de declarar objetos</li>
			
<li>Nuevas estructuras de control</li>
			
<li>Nuevos tipos de datos con sus correspondientes operadores y expresiones</li>
			
<li>Todo se gestiona como un objeto</li>
		
</ul>
<p>
		Estas nuevas caracter&iacute;sticas hacen que Groovy sea un lenguaje f&aacute;cil de leer y de entender.
	</p>
<a name="N10253"></a><a name="Brevedad+del+lenguaje"></a>
<h3 class="underlined_5">Brevedad del lenguaje</h3>
<p>
		Groovy pretende evitar en todo momento toda la ceremonia que acompa&ntilde;a a Java en sus programas y nos permite obviar determinados aspectos obligatorios y centrarnos en nuestro objetivo. Para empezar, se elimina la obligatoriedad de utilizar los puntos y comas (;) al finalizar cada l&iacute;nea. Si lo pensamos un poco es l&oacute;gico, porque &iquest;cu&aacute;ntos de nosotros escribimos m&aacute;s de una sentencia en la misma l&iacute;nea del c&oacute;digo fuente?. Esto no quiere decir que en Groovy no podamos escribir puntos y coma al final de cada l&iacute;nea, simplemente no es obligatorio.
	</p>
<p>
		Otro ejemplo de la brevedad del lenguaje que aporta Groovy es el siguiente ejemplo. Mientras que en Java tendr&iacute;amos lo siguiente:
	</p>
<pre class="code">java.net.URLEncoder.encode ("a b");</pre>
<p>
	en Groovy tendr&iacute;amos
	</p>
<pre class="code">URLEncoder.encode 'a b'</pre>
<p> Esto no s&oacute;lo significa que el c&oacute;digo en Groovy va a ser m&aacute;s corto, sino tambi&eacute;n m&aacute;s expresivo evitando toda la parafernalia que acompa&ntilde;a a Java en determinadas ocasiones.
	</p>
<p>
		Groovy adem&aacute;s importa autom&aacute;ticamente los paquetes <span class="codefrag">groovy.lang.*</span>, <span class="codefrag">groovy.util.*</span>, <span class="codefrag">java.lang.*</span>, <span class="codefrag">java.util.*</span>, <span class="codefrag">java.net.*</span> y <span class="codefrag">java.io.*</span>, as&iacute; como las clases <span class="codefrag">java.Math.BigInteger</span> y <span class="codefrag">java.Math.BigDecimal</span>, as&iacute; que siempre vas a poder utilizar todas sus clases sin necesidad de que sean importados sus paquetes al inicio del programa. Esto tambi&eacute;n es diferente a Java, donde s&oacute;lo se importa autom&aacute;ticamente el paquete <span class="codefrag">java.lang.*</span>.
	</p>
<p>
		Resumiendo. Groovy nos permite olvidarnos de los par&eacute;ntesis, la declaraci&oacute;n de paquetes, puntos y comas y centrarnos en la funcionalidad de nuestros programas y m&eacute;todos.
	</p>
<a name="N1028F"></a><a name="Aserciones"></a>
<h3 class="underlined_5">Aserciones</h3>
<p>
		Las aserciones permiten desde Java 1.4 comprobar si nuestro programa funciona como deber&iacute;a funcionar y Groovy no iba a ser menos, as&iacute; que tambi&eacute;n las incluye. Las aserciones se insertan en medio de nuestro c&oacute;digo y se utilizan, por ejemplo, para comprobar posibles incongruencias en las variables pasadas a un m&eacute;todo. Algunos ejemplos de aserciones ser&iacute;an:
	</p>
<pre class="code">assert(true)
assert 1 == 1
def x = 1
assert x == 1
def y = 1; assert y == 1</pre>
<p>
		Como se puede comprobar en los ejemplos las aserciones pueden tomar expresiones completas y no &uacute;nicamente variables, como en el ejemplo <span class="codefrag">assert 1 == 1</span>. Adem&aacute;s las aserciones no s&oacute;lo nos servir&aacute;n para comprobar el estado de nuestro programa, sino que tambi&eacute;n podremos reemplazar determinados comentarios por aserciones, que adem&aacute;s de clarificar el c&oacute;digo fuente de nuestro programa, nos sirve tambi&eacute;n para pasar peque&ntilde;as pruebas a nuestro c&oacute;digo.
	</p>
<p>
		Cuando usamos aserciones, es una buena pr&aacute;ctica incluir un mensaje que nos clarifique el error que se ha producido. Esto lo podemos hacer a&ntilde;adiendo despu&eacute;s de la aserci&oacute;n el mensaje de texto que queremos precedido de <em>:</em>, como en el siguiente ejemplo:
	</p>
<pre class="code">assert 1==2 : "Desde cuando 1 es igual a 2"
//Obteniendo el siguiente mensaje
//Exception thrown: Desde cuando 1 es igual a 2. Expression: (1 == 2)</pre>
<p>
		Adem&aacute;s, en las &uacute;ltimas versiones de Groovy se ha mejorado el sistema de mensajes mostrados cuando fallan las aserciones fallan. Si por ejemplo, ejecutamos el siguiente fragmento de c&oacute;digo:
	</p>
<pre class="code">assert new File('foo.bar') == new File('example.txt')</pre>
<p>
		Groovy nos mostrar&iacute;a el siguiente mensaje de error
	</p>
<pre class="code">Exception thrown

Assertion failed: 

assert new File('foo.bar') == new File('example.txt')
       |                   |  |
       foo.bar             |  example.txt
                           false</pre>
<a name="N102BB"></a><a name="Un+primer+vistazo+al+c%C3%B3digo+en+Groovy"></a>
<h3 class="underlined_5">Un primer vistazo al c&oacute;digo en Groovy</h3>
<a name="N102C1"></a><a name="Declaraci%C3%B3n+de+clases"></a>
<h4>Declaraci&oacute;n de clases</h4>
<p>
			Las clases son la clave de cualquier lenguaje orientado a objetos y Groovy no iba a ser menos. El siguiente fragmento consiste en la declaraci&oacute;n de la clase <em>Libro</em>, con una sola propiedad <em>Titulo</em>, el constructor de la clase y un m&eacute;todo <em>getter</em> para obtener el t&iacute;tulo del libro.
		</p>
<pre class="code">class Libro {&nbsp;
	private String titulo
		
	Libro (String elTitulo){
		titulo = elTitulo
	}
	String getTitulo(){
		return titulo
	}
}</pre>
<p>
			Se puede comprobar como el c&oacute;digo es bastante similar a Java. Sin embargo, no hay la necesidad de emplear modificadores de acceso a los m&eacute;todos, ya que por defecto siempre ser&aacute;n p&uacute;blicos.
		</p>
<a name="N102DB"></a><a name="Scripts+en+Groovy"></a>
<h4>Scripts en Groovy</h4>
<p>
			Los scripts en Groovy son archivos de texto plano con extensi&oacute;n <em>.groovy</em> y que pueden ser ejecutados, tal y como coment&aacute;bamos en una secci&oacute;n anterior mediante el comando <span class="codefrag">groovy miarchivo.groovy</span>. A diferencia de en Java, en Groovy no necesitamos compilar nuestros scripts, ya que son precompilados por nosotros al mismo tiempo que lo ejecutamos, as&iacute; que a simple vista, es como si pudi&eacute;ramos ejecutar un archivo groovy.
		</p>
<p>
			En Groovy podemos tener sentencias fuera de la definici&oacute;n de las clases e incluso podemos a&ntilde;adir m&eacute;todos a nuestros scripts que tambi&eacute;n queden fuera de las definiciones de nuestras clases, si con ello conseguimos clarificar nuestro c&oacute;digo, con lo que el m&eacute;todo <span class="codefrag">main()</span> t&iacute;pico de Java, no es necesario en Groovy y s&oacute;lo lo necesitaremos en el caso de que nuestro script necesite par&aacute;metros pasados en l&iacute;nea de comandos. Veamos un ejemplo:
		</p>
<pre class="code">Libro cgg = new Libro('Curso GroovyGrails')

assert cgg.getTitulo() == 'Curso GroovyGrails'
assert getTituloAlReves(cgg) == 'sliarGyvoorG osruC'

String getTituloAlReves(libro) {
	titulo = libro.getTitulo()
	return titulo.reverse()
}</pre>
<p>
			Podemos comprobar que llamamos al m&eacute;todo <span class="codefrag">getTituloAlReves()</span> incluso antes de que &eacute;ste sea declarado. Otro aspecto importante es que no necesitamos compilar nuestra clase <span class="codefrag">Libro</span>, ya que Groovy lo hace por nosotros. El &uacute;nico requisito es que la clase Libro se encuentre en el <span class="codefrag">CLASSPATH</span>.
		</p>
<a name="N10301"></a><a name="GroovyBeans"></a>
<h4>GroovyBeans</h4>
<p>
			Fundamentalmente los JavaBeans son clases que definen propiedades. Por ejemplo, en nuestro ejemplo de la clase Libro, sus propiedades ser&iacute;an el t&iacute;tulo, el autor, la editorial, etc. Estos JavaBeans tienen m&eacute;todos para obtener los valores de estas propiedades (getters) y modificarlas (setters). Estos m&eacute;todos deben ser definidos en cada JavaBean, con lo que esta tarea se vuelve algo repetitiva.
		</p>
<pre class="code">class Libro{
	String titulo;
	
	String getTitulo(){
		return this.titulo;
	}
	
	void setTitulo(String str){
		this.titulo = new String(str);	
	}
}</pre>
<p>
			Sin embargo, Groovy gestiona esta definici&oacute;n de los m&eacute;todos <span class="codefrag">get()</span> y <span class="codefrag">set()</span> por nosotros, con lo que ya no debemos preocuparnos. Con esto, el c&oacute;digo anterior, en Groovy quedar&iacute;a as&iacute;:
		</p>
<pre class="code">class Libro{
	String titulo
}</pre>
<p>
		Adem&aacute;s, tenemos la gran ventaja de que podemos sobreescribir estos m&eacute;todos en el caso de que queramos modificar su comportamiento b&aacute;sico.
	</p>
<p>
		En realidad, lo que hace Groovy es tratar de entender el comportamiento de las propiedades de un bean a partir de como est&aacute; definida. Con esto tenemos los siguientes casos:
	</p>
<ul>
		
<li>Si una propiedad de una clase es declarada sin ning&uacute;n modificador, se genera un campo privado con sus correspondientes m&eacute;todos <span class="codefrag">getter()</span> y <span class="codefrag">setter()</span>
</li>
		
<li>Si una propiedad de una clase es declarada como final, dicha propiedad ser&aacute; privada y se definir&aacute; tambi&eacute;n su <span class="codefrag">getter()</span>, pero no su <span class="codefrag">setter()</span>
</li>
		
<li>Si necesitamos una propiedad de tipo privado o protegida debemos declarar sus m&eacute;todos <span class="codefrag">getter()</span> y <span class="codefrag">setter()</span> de forma privada o protegida</li>
	
</ul>
<a name="N1033E"></a><a name="Trabajar+con+cadenas+de+texto"></a>
<h4>Trabajar con cadenas de texto</h4>
<p>
			Al igual que Java, Groovy realiza el tratamiento de las cadenas de texto con el paquete <span class="codefrag">java.lang.String</span>. No obstante, Groovy cuenta tambi&eacute;n con un paquete propio como <span class="codefrag">groovy.lang.GString</span> que facilita determinadas tareas. Con GString podemos definir cadenas de texto utilizando comillas simples o dobles. Con las comillas dobles podemos incluir variables en la misma cadena sin necesidad de utilizar caracteres de escape.
		</p>
<pre class="code">def part1 = 'groovy'
def part2 = 'grails'
assert "me gusta groovy grails" == "me gusta $part1 $part2"</pre>
<p>
			Gracias a GString, tambi&eacute;n podemos definir cadenas de texto multil&iacute;nea con el fin de clarificar el contenido de la variable en cuesti&oacute;n.
		</p>
<pre class="code">def nombre = "fran"
def texto = """\
	hola ${nombre}
	&iquest;c&oacute;mo est&aacute;s?
	"""</pre>
<a name="N10359"></a><a name="Los+n%C3%BAmeros+son+objetos"></a>
<h4>Los n&uacute;meros son objetos</h4>
<p>
			En Groovy, a diferencia que en Java, los n&uacute;meros son tratados como objetos y no como tipos primitivos. En Java no podemos utilizar m&eacute;todos de la clase Integer si el entero es de tipo primitivo y tampoco podemos hacer <span class="codefrag">y*2</span> si la variable <em>y</em> es un objeto. Esto tambi&eacute;n es diferente en Groovy, ya que podemos utilizar operadores y m&eacute;todos indiferentemente.
		</p>
<pre class="code">def x = 1
def y = 2
assert x + y == 3
assert x.plus(y) == 3
assert x instanceof Integer</pre>
<p>
			En el ejemplo anterior se puede observar que hemos podido utilizar el operador + de los tipos primitivos y el m&eacute;todo plus() de la clase Integer.
		</p>
<a name="N10370"></a><a name="Listas%2C+mapas+y+rangos"></a>
<h4>Listas, mapas y rangos</h4>
<p>
			Habitualmente, los lenguajes de programaci&oacute;n que conocemos, nos facilitan mucho el trabajo con arrays. Sin embargo, &iquest;qu&eacute; sucede con los otros tipos de colecciones existentes tales como listas, mapas o rangos? Groovy s&iacute; lo hace y esa tarea que en determinados lenguajes se vuelve demasiado complicada, aqu&iacute; es una tarea muy simple a la vez que potente. Veamos algunos ejemplos de listas, mapas y rangos
		</p>
<p>
			
<strong>Listas</strong>
		
</p>
<pre class="code">def sesiones = ['Introducci&oacute;n a Groovy', 'El lenguaje Groovy', 'Aspectos avanzados en Groovy']

assert sesiones[1] == 'El lenguaje Groovy'

sesiones[3] = 'Librer&iacute;as propias de Groovy'//La lista se expande autom&aacute;ticamente

assert sesiones.size() == 4</pre>
<p>
			
<strong>Mapas</strong>
		
</p>
<pre class="code">def http = [
	100 : 'Continue',
	200 : 'OK',
	400 : 'Bad Request'
]

assert http[200] == 'OK'
assert http.size() == 3</pre>
<p>
			
<strong>Rangos</strong>
		
</p>
<pre class="code">def x = 1..10
assert x.contains(2)
assert x.size() == 10
assert x.reverse() == 10..1</pre>
<a name="N10398"></a><a name="Closures"></a>
<h4>Closures</h4>
<p>
			Hasta ahora, la forma m&aacute;s habitual que conocemos para agrupar bloques de c&oacute;digo son los m&eacute;todos o funciones. Pues a partir de ahora, Groovy introduce una forma m&aacute;s que se conoce como <strong>closures</strong>. Los closures no son m&aacute;s que bloques de c&oacute;digo an&oacute;nimo definido entre llaves. La mejor forma de entender que son los closures es mediante ejemplos.
		</p>
<pre class="code">def ayer = {Date dia -&gt; dia - 1}

ayer.call(new Date())</pre>
<p>
			Si nos fijamos en el closure anterior, observamos que no hay ninguna sentencia <em>return</em>. Esto es porque en un closure el valor devuelto es el de la &uacute;ltima sentencia ejecutada. El principal objetivo de los closures es la agilidad al escribir c&oacute;digo, ya que es mucho m&aacute;s sencillo crear un closure que crear una clase an&oacute;nima y utilizar una instancia de ella para realizar una determinada operaci&oacute;n. Con los closures no vamos a poder hacer nada nuevo que no pudi&eacute;ramos hacer antes en Java, sin embargo nos permite ser m&aacute;s &aacute;giles y r&aacute;pidos programando. Pero, veamos otro ejemplo:
		</p>
<pre class="code">['Pedro','Lola','Juan'].each { it -&gt; println(it) }</pre>
<p>
			En el ejemplo anterior, el closure imprime por pantalla cada uno de los elementos de la lista que llama al closure. La variable <span class="codefrag">it</span> contiene el valor del elemento de la lista analizado en cada iteraci&oacute;n.
		</p>
<p>
			Algo que a&ntilde;ade valor a los closures es la posibilidad de que &eacute;stos sean pasados como par&aacute;metros a funciones.
		</p>
<pre class="code">def lista = ['a','b','c','d']
def nuevaLista = []

lista.collect( nuevaLista ) {
	it.toUpperCase()
}
println nuevaLista	//  ["A", "B", "C", "D"]</pre>
<p>
		En el ejemplo anterior, la funci&oacute;n <a class="external" href="http://groovy.codehaus.org/groovy-jdk/java/util/Collection.html#collect(java.util.Collection,%20groovy.lang.Closure)"><span class="codefrag">collect()</span></a> de las colecciones recibe como primer par&aacute;metro otra colecci&oacute;n y como segundo par&aacute;metro un objeto de tipo <span class="codefrag">Closure</span> que se encargar&aacute; de realizar las operaciones sobre la colecci&oacute;n original.
	</p>
<a name="N103CB"></a><a name="Estructuras+de+control+en+Groovy"></a>
<h4>Estructuras de control en Groovy</h4>
<p>
			Algunas estructuras de control en Groovy son tratadas de la misma forma que en Java. Estos bloques son <span class="codefrag">if-else</span>, <span class="codefrag">while</span>, <span class="codefrag">switch</span> y <span class="codefrag">try-catch-finally</span>, aunque es conveniente hacer algunas anotaciones. En los condicionales, <span class="codefrag">null</span> es tratado como <span class="codefrag">false</span>, mientras que not-<span class="codefrag">null</span> ser&aacute; <span class="codefrag">true</span>.
		</p>
<p>
			Con respecto a la sentencia <span class="codefrag">if</span>, Groovy soporta la sentencia de forma anidada.
		</p>
<pre class="code">if ( ... ) {
...
} else if (...) {
...
} else {
...
}</pre>
<p>
			De igual forma, se introduce tambi&eacute;n el operador ternario, que no es m&aacute;s que una simplificaci&oacute;n del operador ternario, de tal forma que tiene en cuenta cuando el valor evaluado es falso o <span class="codefrag">null</span>.
		</p>
<pre class="code">def y = 5
def x = (y &gt; 1) ? "funciona" : "falla"
assert x == "funciona"</pre>
<p>
			As&iacute; como el operador Elvis
		</p>
<pre class="code">def nombreMostrado = usuario.nombre ?: "An&oacute;nimo"</pre>
<p>
			Los bloques de c&oacute;digo del tipo <span class="codefrag">for</span> utilizan la notaci&oacute;n <span class="codefrag">for(i in x){cuerpo}</span> donde <em>x</em> puede ser cualquier cosa que Groovy sepa como iterar (iteradores, enumeraciones, colecciones, mapas, rangos, etc.)
		</p>
<pre class="code">for(i in 1..10)
	println i
	
for(i in [1,2,3,4,5,6,7,8,9,10])
	println i</pre>
<p>
			En Groovy es una pr&aacute;ctica habitual utilizar un closure para simular un bucle <span class="codefrag">for</span> como por ejemplo en el siguiente c&oacute;digo
		</p>
<pre class="code">def alumnos = ['Pedro','Miguel','Alejandro','Elena']
alumnos.each{nombre -&gt; println nombre}</pre>
</div>


<a name="N10424"></a><a name="Groovy+en+el+entorno+Java"></a>
<h2 class="underlined_10">Groovy en el entorno Java</h2>
<div class="section">
<p>
	Ahora que ya tenemos una primera impresi&oacute;n de lo que Groovy nos puede aportar, vamos a ver como se mueve en el entorno Java. Se puede decir que Groovy es tan amable con Java como Java lo es con Groovy, y es que cualquiera puede utilizar las clases del otro sin ning&uacute;n problema. No en vano, el c&oacute;digo Groovy se ejecuta dentro de la M&aacute;quina Virtual de Java.
</p>
<p>
	Groovy puede ser ejecutado en la M&aacute;quina Virtual de Java de dos formas:
</p>
<ul>
		
<li>Utilizando <strong>groovyc</strong> para compilar nuestros archivos <em>.groovy</em> en archivos <em>.class</em> de Java, simplemente colocando estas clases en el Classpath de Java</li>
		
<li>Sin necesidad de compilar los archivos <em>.groovy</em>. Si en nuestro c&oacute;digo aparece una llamada del tipo <span class="codefrag">new MiClase()</span> y existe un archivo <em>MiClase.groovy</em> en el classpath, &eacute;ste ser&aacute; parseado generando una nueva clase llamada MiClase como si hubiera sido cargada desde un archivo MiClase.class.</li>
	
</ul>
<a name="N1044B"></a><a name="GDK%3A+la+librer%C3%ADa+Groovy"></a>
<h3 class="underlined_5">GDK: la librer&iacute;a Groovy</h3>
<p>
	Se puede decir sin tapujos, que la librer&iacute;a de Groovy (GDK) es una extensi&oacute;n a la librer&iacute;a JDK. GDK a&ntilde;ade nuevas clases que facilitan el acceso a las bases de datos y el procesamiento XML, pero tambi&eacute;n extiende las funcionalidades de las clases existentes en Java. Pero veamos un ejemplo de como GDK nos facilita la labor.
</p>
<p>
	En Java existen diferentes formas para determinar el tama&ntilde;o de un objeto, mientras que en Groovy siempre se utiliza el mismo m&eacute;todo <em>size()</em>, facilit&aacute;ndonos la labor.
</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	
<tr>
		
<th colspan="1" rowspan="1">Tipo</th>
		<th colspan="1" rowspan="1">En Java</th>
		<th colspan="1" rowspan="1">En Groovy</th>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">Array</td>
		<td colspan="1" rowspan="1">Propiedad length</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">String</td>
		<td colspan="1" rowspan="1">M&eacute;todo length()</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">StringBuffer</td>
		<td colspan="1" rowspan="1">M&eacute;todo length()</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">Collection</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">Map</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">File</td>
		<td colspan="1" rowspan="1">M&eacute;todo length()</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">Matcher</td>
		<td colspan="1" rowspan="1">M&eacute;todo groupCount()</td>
		<td colspan="1" rowspan="1">M&eacute;todo size()</td>
	
</tr>

</table>
<p>
	Puedes ver el API completo del GDK en la direcci&oacute;n <a class="external" href="http://groovy.codehaus.org/gapi/">http://groovy.codehaus.org/gapi/</a>.
</p>
</div>


<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2010-2011 Depto. Ciencia de la Computaci&oacute;n e IA</div>
</div>
<script type="text/javascript">
     
         SyntaxHighlighter.defaults['toolbar'] = false;
         SyntaxHighlighter.autoloader(
  		     'java                   skin/highlight/shBrushJava.js',
  		     'xml xhtml xslt html    skin/highlight/shBrushXml.js',
  		     'js jscript javascript  skin/highlight/shBrushJScript.js',
  		     'groovy                 skin/highlight/shBrushGroovy.js',
  		     'bash shell             skin/highlight/shBrushBash.js',
  		     'php                    skin/highlight/shBrushPhp.js',
  		     'css                    skin/highlight/shBrushCss.js',
  		     'sql                    skin/highlight/shBrushSql.js',
  		     'objc                   skin/highlight/shBrushObjC.js',
  		     'cpp c                  skin/highlight/shBrushCpp.js',
  		     'text plain             skin/highlight/shBrushPlain.js'
         );
         SyntaxHighlighter.all();
     </script><a href="skin/highlight/shBrushJava.js"></a><a href="skin/highlight/shBrushXml.js"></a><a href="skin/highlight/shBrushJScript.js"></a><a href="skin/highlight/shBrushGroovy.js"></a><a href="skin/highlight/shBrushBash.js"></a><a href="skin/highlight/shBrushPhp.js"></a><a href="skin/highlight/shBrushCss.js"></a><a href="skin/highlight/shBrushSql.js"></a><a href="skin/highlight/shBrushObjC.js"></a><a href="skin/highlight/shBrushCpp.js"></a><a href="skin/highlight/shBrushPlain.js"></a>
</body>
</html>
