<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Seguridad</title>
<link type="text/css" href="../skin/highlight/shCore.css" rel="stylesheet">
<link type="text/css" href="../skin/highlight/shThemeEclipse.css" rel="stylesheet">
<script src="../skin/highlight/shCore.js" type="text/javascript"></script><script src="../skin/highlight/shAutoloader.js" type="text/javascript"></script>
<link type="text/css" href="../skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="../skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="../skin/print.css" rel="stylesheet">
<link type="text/css" href="../skin/profile.css" rel="stylesheet">
<script src="../skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="../skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="../skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="../index.html">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="jtech" src="../images/baner_j2ee_izq.gif" title="Especialista Universitario Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Groovy&amp;Grails: desarrollo r&aacute;pido de aplicaciones" src="../images/baner_j2ee_der.gif" title="Groovy&amp;Grails: desarrollo r&aacute;pido de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">Home</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Sesiones</a>
</li>
<li>
<a class="base-not-selected" href="../ejercicios/index.html">Ejercicios</a>
</li>
<li>
<a class="base-not-selected" href="../bibliografia/index.html">Bibliograf&iacute;a</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', '../skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('../skin/images/chapter_open.gif');">Sesiones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html" title="Introducci&oacute;n a Groovy">Sesi&oacute;n 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html" title="El lenguaje Groovy">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html" title="Aspectos avanzados en Groovy">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html" title="Librer&iacute;as propias en Groovy">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html" title="Introducci&oacute;n a Grails">Sesi&oacute;n 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html" title="Construir la interfaz de usuario (I)">Sesi&oacute;n 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html" title="Controladores">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html" title="Construir la interfaz de usuario (II)">Sesi&oacute;n 8</a>
</div>
<div class="menuitem">
<a href="sesion09-apuntes.html" title="Dominios y servicios (I)">Sesi&oacute;n 9</a>
</div>
<div class="menuitem">
<a href="sesion10-apuntes.html" title="Dominios y servicios (II)">Sesi&oacute;n 10</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesi&oacute;n 11</div>
</div>
<div class="menuitem">
<a href="sesion12-apuntes.html" title="Despliegue de aplicaciones">Sesi&oacute;n 12</a>
</div>
<div class="menuitem">
<a href="sesion13-apuntes.html" title="Web 2.0">Sesi&oacute;n 13</a>
</div>
<div class="menuitem">
<a href="sesion14-apuntes.html" title="AJAX">Sesi&oacute;n 14</a>
</div>
<div class="menuitem">
<a href="sesion15-apuntes.html" title="Dos horas para crear twitter">Sesi&oacute;n 15</a>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="../skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion11-apuntes.pdf"><img alt="PDF -icon" src="../skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Seguridad</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Autenticaci%C3%B3n">Autenticaci&oacute;n</a>
</li>
<li>
<a href="#Registro+de+usuarios+con+CAPTCHAS">Registro de usuarios con CAPTCHAS</a>
</li>
<li>
<a href="#Control+de+acceso%3A+Filtros">Control de acceso: Filtros</a>
</li>
<li>
<a href="#Plugin+de+seguridad+Shiro">Plugin de seguridad Shiro</a>
<ul class="minitoc">
<li>
<a href="#Clases+de+dominio+de+Shiro">Clases de dominio de Shiro</a>
</li>
<li>
<a href="#Carga+de+datos">Carga de datos</a>
</li>
<li>
<a href="#Etiquetas+GSP">Etiquetas GSP</a>
</li>
</ul>
</li>
</ul>
</div>
         

<p>
	Llegados a este punto, debemos dar un paso adelante para mejorar nuestra aplicaci&oacute;n y que mejor que a&ntilde;adi&eacute;ndole seguridad desde varios puntos de vista, ya que hasta el momento, nuestro m&eacute;todo para identificar a los usuarios era demasiado simple y totalmente inseguro.
</p>

<p>
	Uno de los objetivos de la seguridad en una aplicaci&oacute;n es establecer una forma efectiva de identificar a los usuarios (<em>autenticaci&oacute;n</em>), ya que se necesita saber de alguna forma que el usuario que est&aacute; tratando de entrar a nuestra aplicaci&oacute;n, es quien verdaderamente est&aacute; dici&eacute;ndonos. Esto se suele hacer t&iacute;picamente especificando un nombre de usuario y una contrase&ntilde;a. 
</p>

<p>
	Adem&aacute;s, otro de los objetivos hablando en t&eacute;rminos de seguridad es saber que usuarios tienen acceso a cada una de las partes de la aplicaci&oacute;n (<em>control de acceso</em>). Por ejemplo, un usuario de tipo <em>profesor</em> o <em>socio</em> no debe tener acceso a la gesti&oacute;n de otros usuarios.
</p>

<p>
	En esta sesi&oacute;n, veremos como implementar la seguridad de nuestra aplicaci&oacute;n de varias formas. En primer lugar, utilizaremos un m&eacute;todo propio desde cero y posteriormente veremos como utilizar el plugin <em>Shiro</em>.
</p>

<a name="N10027"></a><a name="Autenticaci%C3%B3n"></a>
<h2 class="underlined_10">Autenticaci&oacute;n</h2>
<div class="section">
<p>
	El proceso de autenticaci&oacute;n en una aplicaci&oacute;n consiste en la identificaci&oacute;n por parte de los usuarios para comprobar que realmente son quienes dicen ser. En este proceso tambi&eacute;n podemos incluir la parte en la que el usuario abandona la aplicaci&oacute;n.
</p>
<p>
	Hasta el momento ese proceso en nuestra aplicaci&oacute;n consiste simplemente en seleccionar uno de los usuarios listados en un seleccionable, lo cual no es nada seguro. En primer lugar vamos a modificar esta forma de entrar en la aplicaci&oacute;n por otra en la cual se nos solicite el nombre de usuario (<em>login</em>) y la contrase&ntilde;a (<em>password</em>).
</p>
<p>
	En primer lugar debemos cambiar la vista correspondiente (<em>grails-app/views/usuario/login.gsp</em>) para indicarle la nueva forma de acceso a nuestra aplicaci&oacute;n, que ahora quedar&iacute;a as&iacute;:
</p>
<pre class="code">&lt;html&gt;
  &lt;head&gt;
    &lt;meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/&gt;
    &lt;meta name="layout" content="main"/&gt;
    &lt;title&gt;Login&lt;/title&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;div class="body"&gt;
        &lt;g:if test="${flash.message}"&gt;
            &lt;div class="message"&gt;
                ${flash.message}
            &lt;/div&gt;
        &lt;/g:if&gt;
        &lt;p&gt;
            Bienvenido a la aplicaci&oacute;n Biblioteca. Por favor, identif&iacute;cate.
        &lt;/p&gt;
        &lt;form&gt;
            &lt;br/&gt;
            &lt;label for="login"&gt;Nombre de usuario&lt;/label&gt;&lt;br/&gt;&lt;input type="text" maxlength="20" id="login" name="login" value="${fieldValue(bean:usuarioInstance,field:'login')}"/&gt;
            &lt;br/&gt;
            &lt;label for="password"&gt;Contrase&ntilde;a&lt;/label&gt;&lt;br/&gt;&lt;input type="password" maxlength="20" id="password" name="password"/&gt;
            &lt;br/&gt;
            &lt;div class="buttons"&gt;
                &lt;span class="button"&gt;&lt;g:actionSubmit value="Login" action="handleLogin"/&gt;&lt;/span&gt;
            &lt;/div&gt;
        &lt;/form&gt;
    &lt;/div&gt;
  &lt;/body&gt;
&lt;/html&gt;</pre>
<p>
	Y por supuesto, tambi&eacute;n debemos modificar el controlador de la clase de dominio <em>Usuario</em> para que ahora se compruebe no s&oacute;lo el nombre de usuario escogido sino tambi&eacute;n la contrase&ntilde;a. El m&eacute;todo <span class="codefrag">handleLogin()</span> quedar&iacute;a as&iacute;:
</p>
<pre class="code">def handleLogin = {
    <strong>def usuario = Usuario.findWhere(["login":params.login, "password":params.password, "active":true])</strong>
    if (!usuario) {
        flash.message = "El usuario ${params.login} no existe"
        redirect(controller: 'usuario', action:'login')
        return
    }
    else {
        session.usuario = usuario
        redirect(controller:'operacion')
    }
}</pre>
<p>
	Si te fijas, comprobar&aacute;s como simplemente hemos cambiado una l&iacute;nea en el controlador para que ahora se compruebe tanto el nombre de usuario como la contrase&ntilde;a y que la cuenta del usuario est&eacute; activa. Sin embargo, todav&iacute;a queda algo por hacer y es referente a la forma con la que la contrase&ntilde;a de los usuarios se almacena en la base de datos. 
</p>
<p>
	Hasta este momento, la contrase&ntilde;a de los usuarios se almacena en forma de texto plano en la tabla correspondiente de la base de datos, lo cual se puede considerar como una falta muy grave en temas de seguridad y de protecci&oacute;n de datos, ya que muchos usuarios utilizan siempre la misma contrase&ntilde;a para diferentes sistemas de autenticaci&oacute;n, con lo que si nuestro sistema es intervenido por alg&uacute;n agente externo, &eacute;ste tendr&aacute; acceso a estas contrase&ntilde;as.
</p>
<p>
	Para solucionar esto, debemos encriptar la contrase&ntilde;a antes de insertar los datos del usuarios, lo cual habitualmente se consigue mediante t&eacute;cnicas <em>hash</em>. En Grails vamos a utilizar una t&eacute;cnica llamada <em>DigestUtils</em> que utiliza el paquete <span class="codefrag">org.apache.commons.codec.digest.DigestUtils</span>. Esta clase contiene una serie de m&eacute;todos para producir diversos tipos de cadenas encriptadas:
</p>
<ul>
	
<li>
<span class="codefrag">DigestUtils.md5(java.lang.String cadena)</span>, que produce una cadena de 16 elementos de tipo <span class="codefrag">byte[]</span>
</li>
	
<li>
<span class="codefrag">DigestUtils.md5Hex(java.lang.String cadena)</span>, utiliza tambi&eacute;n MD5, pero en este caso crear&aacute; una cadena de 32 caracteres hexadecimales</li>
	
<li>
<span class="codefrag">DigestUtils.shaHex(java.lang.String cadena)</span>, tambi&eacute;n devuelve una cadena de 32 caracteres hexadecimales pero utiliza SHA-1 como m&eacute;todo de encriptaci&oacute;n</li>

</ul>
<p>
	Para encriptar la contrase&ntilde;a de los usuarios, en primer lugar debemos modificar la clase de dominio, puesto que estamos indicando que la longitud de la cadena no puede ser superior a 20 caracteres, lo que una vez encriptada la contrase&ntilde;a ser&aacute; insuficiente. Vamos a modificar este tama&ntilde;o a 255.
</p>
<p>
	A continuaci&oacute;n, modificaremos los m&eacute;todos correspondientes en el controlador de la clase <em>Usuario</em> para que a partir de ahora encripte la contrase&ntilde;a utilizando el m&eacute;todo <span class="codefrag">DigestUtils.md5Hex(pwd)</span>. El m&eacute;todo <span class="codefrag">save()</span> quedar&iacute;a as&iacute;:
</p>
<pre class="code">def save = {
    <strong>params.password = DigestUtils.md5Hex(params.password)</strong>
    def usuarioInstance = usuarioService.altaUsuario(params)
    if(!usuarioInstance.hasErrors()) {
        flash.message = "${message(code: 'default.created.message', 
            args: [message(code: 'usuario.label', default: 'Usuario'), usuarioInstance.id])}"
        redirect(action:show,id:usuarioInstance.id)
    }
    else {
        render(view:'create',model:[usuarioInstance:usuarioInstance])
    }
}</pre>
<p>
	La modificaci&oacute;n de la contrase&ntilde;a para que sea encriptada debe ser realizada tambi&eacute;n en el m&eacute;todo <span class="codefrag">update()</span>. No debemos olvidar tambi&eacute;n importar el paquete <span class="codefrag">org.apache.commons.codec.digest.DigestUtils</span>.
</p>
<p>
	Debemos modificar tambi&eacute;n el fichero <span class="codefrag">BootStrap.groovy</span> para que la contrase&ntilde;a sea tambi&eacute;n encriptada antes de que sea insertada en la base de datos.
</p>
<pre class="code">def usuario1 = new Usuario(login:'frangarcia',
	<strong>password:DigestUtils.md5Hex('mipassword')</strong>, 
	nombre:'Francisco Jos&eacute;', 
	apellidos:'Garc&iacute;a Rico',
	tipo:'administrador',
	email:'fgarcia@ua.es,
	active:true)</pre>
<p>
	Por &uacute;ltimo, debemos actualizar el m&eacute;todo <span class="codefrag">handleLogin()</span> para comprobar los datos del usuario que intenta identificarse para que la contrase&ntilde;a sea encriptada antes de realizar dicha comprobaci&oacute;n. Modificamos la l&iacute;nea correspondiente por esta otra <span class="codefrag">def usuario = Usuario.findWhere(["login":params.login, "password":DigestUtils.md5Hex(params.password), "active":true])</span>.
</p>
<p>
	Ahora s&iacute;, nuestra aplicaci&oacute;n empieza a tener mejor forma en cuanto a lo relativo a la seguridad de la misma, ya que las contrase&ntilde;as de los usuarios no aparecen en texto plano.
</p>
</div>

<a name="N100B2"></a><a name="Registro+de+usuarios+con+CAPTCHAS"></a>
<h2 class="underlined_10">Registro de usuarios con CAPTCHAS</h2>
<div class="section">
<p>
	El siguiente paso en nuestra aplicaci&oacute;n va a ser a&ntilde;adir la posibilidad de que sean los propios usuarios quienes se registren en la aplicaci&oacute;n. Por supuesto, este registro no permitir&aacute; a la persona que quiera registrarse seleccionar el tipo de usuario, de tal forma que los nuevos usuarios ser&aacute;n autom&aacute;ticamente del tipo <em>socio</em>. Adem&aacute;s, veremos como instalar un plugin a nuestra aplicaci&oacute;n para a&ntilde;adir a este registro de nuevos usuarios la utilizaci&oacute;n de la t&eacute;cnica de <em>CAPTCHA</em> para evitar el registro automatizado de nuevos usuarios.
</p>
<div class="frame note">
<div class="label">&iquest;En qu&eacute; consiste la t&eacute;cnica CAPTCHA?</div>
<div class="content">
	CAPTCHA es el acr&oacute;nimo de <strong>Completely Automated Public Turing Test to tell Computers and Humans apart (Prueba de Turing p&uacute;blica y autom&aacute;tica para diferenciar a m&aacute;quinas y humanos)</strong>. Se trata de una prueba desaf&iacute;o-respuesta utilizada en computaci&oacute;n para determinar cuando el usuario es o no humano.<br>
<br>
	La t&iacute;pica prueba consiste en que el usuario introduzca un conjunto de caracteres que se muestran en una imagen distorsionada que aparece en pantalla, que supuestamente una m&aacute;quina no puede entender y que s&oacute;lo un humano podr&aacute; escribir la secuencia correcta. &Uacute;ltimamente se han a&ntilde;adido otro tipo de pruebas como archivos de audio, preguntas de c&aacute;lculo matem&aacute;tico, o de <a class="external" href="http://google.dirson.com/post/4344-nuevos-captchas-pajaro-orientado/">cualquier otro tipo</a>.<br>
<br>
	
<em>Fuente:</em> <a class="external" href="http://es.wikipedia.org/wiki/Captcha">Art&iacute;culo de la Wikipedia en Espa&ntilde;ol</a>

</div>
</div>
<p>
	Empecemos entonces instalando un plugin que nos va a permitir realizar este tipo de comprobaciones a la hora de registrar nuevos usuarios. Grails dispone de un potente y eficaz sistema de plugins realizado en su mayor&iacute;a por la, cada vez m&aacute;s extensa, comunidad de usuarios que facilita la ampliaci&oacute;n de las aplicaciones.
</p>
<p>
	El plugin que vamos a instalar se llama <a class="external" href="http://docs.codehaus.org/display/GRAILS/JCaptcha+Plugin">jcaptcha</a> y para ello debemos escribir en l&iacute;nea de comandos <span class="codefrag">grails install-plugin jcaptcha</span>. Este plugin crear&aacute; autom&aacute;ticamente un controlador y un servicio que posteriormente podremos utilizar para realizar las comprobaciones correspondientes.
</p>
<p>
	La instalaci&oacute;n de este plugin requiere tambi&eacute;n algunas modificaciones en el archivo de configuraci&oacute;n <em>grails-app/conf/Config.groovy</em>. En este archivo debemos a&ntilde;adir el siguiente c&oacute;digo para la generaci&oacute;n de las im&aacute;genes correspondientes a los captchas.
</p>
<pre class="code">import java.awt.Font
import java.awt.Color

import com.octo.captcha.service.multitype.GenericManageableCaptchaService
import com.octo.captcha.engine.GenericCaptchaEngine
import com.octo.captcha.image.gimpy.GimpyFactory
import com.octo.captcha.component.word.wordgenerator.RandomWordGenerator
import com.octo.captcha.component.image.wordtoimage.ComposedWordToImage
import com.octo.captcha.component.image.fontgenerator.RandomFontGenerator
import com.octo.captcha.component.image.backgroundgenerator.GradientBackgroundGenerator
import com.octo.captcha.component.image.color.SingleColorGenerator
import com.octo.captcha.component.image.textpaster.NonLinearTextPaster

.......
	
jcaptchas {
	image = new GenericManageableCaptchaService(
		new GenericCaptchaEngine(
			new GimpyFactory(
				new RandomWordGenerator(
					"abcdefghijklmnopqrstuvwxyz1234567890"
				),
				new ComposedWordToImage(
					new RandomFontGenerator(
						20, // min font size
						30, // max font size
						[new Font("Arial", 0, 10)] as Font[]
					),
					new GradientBackgroundGenerator(
						140, // width
						35, // height
						new SingleColorGenerator(new Color(0, 60, 0)),
						new SingleColorGenerator(new Color(20, 20, 20))
					),
					new NonLinearTextPaster(
						6, // minimal length of text
						6, // maximal length of text
						new Color(0, 255, 0)
					)
				)
			)
		),
		180, // minGuarantedStorageDelayInSeconds
		180000 // maxCaptchaStoreSize
	)
}</pre>
<p>
	Una vez ya tenemos instalado el plugin <em>jcaptcha</em>, lo siguiente que vamos a hacer es crear la vista correspondiente para el registro de los nuevos usuarios. Este registro ser&aacute; pr&aacute;cticamente id&eacute;ntico a cuando un administrador a&ntilde;ade usuarios, con lo que vamos a copiar el archivo <em>grails-app/views/usuario/create.gsp</em> en un nuevo archivo llamado <em>grails-app/views/usuario/register.gsp</em>.
</p>
<p>
	En el registro de los nuevos usuarios, adem&aacute;s del captcha correspondiente, vamos a pedirles tambi&eacute;n a quienes deseen registrarse en nuestro sistema que introduzcan una confirmaci&oacute;n de la contrase&ntilde;a, algo que tambi&eacute;n es t&iacute;pico en este tipo de sistemas. El siguiente ser&aacute; el c&oacute;digo de la parte del formulario del archivo <em>register.gsp</em>.
</p>
<pre class="code">&lt;g:form action="<strong>handleRegister</strong>" method="post" &gt;
    &lt;div class="dialog"&gt;
        &lt;table&gt;
            &lt;tbody&gt;
            
                &lt;tr class="prop"&gt;
                    &lt;td valign="top" class="name"&gt;
                        &lt;label for="login"&gt;&lt;g:message code="usuario.login.label" default="Login" /&gt;:&lt;/label&gt;
                    &lt;/td&gt;
                    &lt;td valign="top" class="value ${hasErrors(bean:usuarioInstance,field:'login','errors')}"&gt;
                        &lt;input type="text" maxlength="20" id="login" name="login" value="${fieldValue(bean:usuarioInstance,field:'login')}"/&gt;
                    &lt;/td&gt;
                &lt;/tr&gt; 
            
                &lt;tr class="prop"&gt;
                    &lt;td valign="top" class="name"&gt;
                        &lt;label for="password"&gt;&lt;g:message code="usuario.password.label" default="Password" /&gt;:&lt;/label&gt;
                    &lt;/td&gt;
                    &lt;td valign="top" class="value ${hasErrors(bean:usuarioInstance,field:'password','errors')}"&gt;
                        &lt;input type="password" maxlength="20" id="password" name="password"/&gt;
                    &lt;/td&gt;
                &lt;/tr&gt;

                <strong>&lt;tr class="prop"&gt;
                    &lt;td valign="top" class="name"&gt;
                        &lt;label for="confirm"&gt;&lt;g:message code="usuario.confirm.label" default="Confirm Password" /&gt;:&lt;/label&gt;
                    &lt;/td&gt;
                    &lt;td valign="top"&gt;
                        &lt;input type="password" maxlength="20" id="confirm" name="confirm"/&gt;
                    &lt;/td&gt;
                &lt;/tr&gt;</strong>
            
                &lt;tr class="prop"&gt;
                    &lt;td valign="top" class="name"&gt;
                        &lt;label for="nombre"&gt;&lt;g:message code="usuario.nombre.label" default="Nombre" /&gt;:&lt;/label&gt;
                    &lt;/td&gt;
                    &lt;td valign="top" class="value ${hasErrors(bean:usuarioInstance,field:'nombre','errors')}"&gt;
                        &lt;input type="text" id="nombre" name="nombre" value="${fieldValue(bean:usuarioInstance,field:'nombre')}"/&gt;
                    &lt;/td&gt;
                &lt;/tr&gt; 
            
                &lt;tr class="prop"&gt;
                    &lt;td valign="top" class="name"&gt;
                        &lt;label for="apellidos"&gt;&lt;g:message code="usuario.apellidos.label" default="Apellidos" /&gt;:&lt;/label&gt;
                    &lt;/td&gt;
                    &lt;td valign="top" class="value ${hasErrors(bean:usuarioInstance,field:'apellidos','errors')}"&gt;
                        &lt;input type="text" id="apellidos" name="apellidos" value="${fieldValue(bean:usuarioInstance,field:'apellidos')}"/&gt;
                    &lt;/td&gt;
                &lt;/tr&gt; 

                &lt;tr class="prop"&gt;
                    &lt;td valign="top" class="name"&gt;
                        &lt;label for="email"&gt;&lt;g:message code="usuario.email.label" default="Email" /&gt;&lt;/label&gt;
                    &lt;/td&gt;
                    &lt;td valign="top" class="value ${hasErrors(bean: usuarioInstance, field: 'email', 'errors')}"&gt;
                        &lt;g:textField name="email" value="${usuarioInstance?.email}" /&gt;
                    &lt;/td&gt;
                &lt;/tr&gt;
            
                <strong>&lt;tr class="prop"&gt;
                    &lt;td valign="top" class="name"&gt;
                        &lt;label for="tipo"&gt;Captcha:&lt;/label&gt;
                    &lt;/td&gt;
                    &lt;td valign="top" class="value ${hasErrors(bean:usuarioInstance,field:'responseCaptcha','errors')}"&gt;
                          &lt;jcaptcha:jpeg name="image" /&gt;&lt;br&gt;
                          &lt;g:textField name="responseCaptcha" value="" /&gt;&lt;br&gt;
                    &lt;/td&gt;
                &lt;/tr&gt;</strong>
            
            &lt;/tbody&gt;
        &lt;/table&gt;
    &lt;/div&gt;
    &lt;div class="buttons"&gt;
        &lt;span class="button"&gt;&lt;input class="save" type="submit" value="${message(code: 'default.button.create.label', default: 'Create')}" /&gt;&lt;/span&gt;
    &lt;/div&gt;
&lt;/g:form&gt;</pre>
<p>
	Lo siguiente que debemos hacer es a&ntilde;adir los correspondientes m&eacute;todos en el controlador de la clase <em>Usuario</em>, en este caso los m&eacute;todos <span class="codefrag">register()</span> y <span class="codefrag">handleRegister()</span>. Este &uacute;ltimo ser&aacute; quien se encargue de comprobar que la pregunta referente al captcha ha sido correctamente contestada y que la confirmaci&oacute;n de la contrase&ntilde;a coincida con la contrase&ntilde;a. Tambi&eacute;n debemos crear una variable llamada <em>jcaptchaService</em> en la parte superior del controlador, que ser&aacute; quien se encargue de comprobar la validez de la respuesta. Aqu&iacute; volvemos a encontrarnos con el paradigma de Grails que indica <em>convenci&oacute;n sobre configuraci&oacute;n</em>, puesto que nombrando esta variable como <em>jcaptchaService</em>, nos olvidamos de m&aacute;s configuraci&oacute;n. El c&oacute;digo de estos m&eacute;todos quedar&iacute;a as&iacute;:
</p>
<pre class="code">
<strong>def jcaptchaService</strong>
	
	...........
	
def register = {
    def usuarioInstance = new Usuario()
    usuarioInstance.properties = params
    return ['usuarioInstance':usuarioInstance]
}

def handleRegister = {
    def usuarioInstance = new Usuario()
    //Proceso el captcha
    <strong>if (!jcaptchaService.validateResponse("image", session.id, params.responseCaptcha)){</strong>
        flash.message = "El captcha no es correcto"
        redirect(controller:'usuario', action:'register')
    }
    else{
        //Compruebo la confirmaci&oacute;n de la contrase&ntilde;a
        <strong>if(params.password != params.confirm) {</strong>
            flash.message = "La confirmaci&oacute;n de la contrase&ntilde;a no coincide con la contrase&ntilde;a"
            redirect(action:register)
        }
        else{
            <strong>params.password = DigestUtils.md5Hex(params.password)
            params.tipo = "socio"</strong>
            usuarioInstance = usuarioService.altaUsuario(params)
            if(!usuarioInstance.hasErrors()) {
                session.usuario = usuarioInstance
                redirect(controller:'operacion')
            }
            else {
                render(view:'register',model:[usuarioInstance:usuarioInstance])
            }
        }
    }
}</pre>
<p>
	En primer lugar comprobamos que la respuesta introducida al desaf&iacute;o del captcha es correcta para posteriormente chequear que la confirmaci&oacute;n a la contrase&ntilde;a se ha introducido correctamente. En caso de pasar ambos tests, se guarda la informaci&oacute;n del usuario en la base de datos y se autentica directamente al usuario en la aplicaci&oacute;n para que pueda empezar a operar sobre ella. Podemos comprobar el funcionamiento de este registro de usuarios accediendo a <a class="external" href="http://localhost:8080/biblioteca/usuario/register">http://localhost:8080/biblioteca/usuario/register</a>.
</p>
<p>
	Por &uacute;ltimo, simplemente debemos mostrar a los usuarios de nuestra aplicaci&oacute;n alg&uacute;n enlace donde poder registrarse. Esto se suele poner junto al enlace correspondiente a la identificaci&oacute;n, es decir, en el encabezado de nuestra aplicaci&oacute;n, con lo que vamos a modificar el archivo <em>grails-app/views/common/_header.gsp</em> para que junto a la palabra <em>Identificarse</em>, aparezca tambi&eacute;n un enlace para que un usuario pueda registrarse en la aplicaci&oacute;n.
</p>
<pre class="code">&lt;div id="menu"&gt;
    &lt;nobr&gt;
        &lt;g:if test="${session.usuario}"&gt;
            &lt;b&gt;${session.usuario?.nombre}&nbsp;${session.usuario?.apellidos}&lt;/b&gt; |
            &lt;g:link controller="usuario" action="logout"&gt;&lt;g:message code="encabezado.logout"/&gt;&lt;/g:link&gt;
        &lt;/g:if&gt;
        &lt;g:else&gt;
            &lt;g:link controller="usuario" action="login"&gt;&lt;g:message code="encabezado.login"/&gt;&lt;/g:link&gt; <strong>|
            &lt;g:link controller="usuario" action="register"&gt;Registrarse&lt;/g:link&gt;</strong>
        &lt;/g:else&gt;
    &lt;/nobr&gt;
&lt;/div&gt;</pre>
<p>
	En la siguiente imagen podemos ver como quedar&iacute;a nuestra aplicaci&oacute;n cuando un usuario desea registrarse en ella.
</p>
<p>
	
<img alt="Registro de nuevos usuarios" height="484" src="../images/sesion11/register.jpg" width="780">
</p>
</div>


<a name="N10157"></a><a name="Control+de+acceso%3A+Filtros"></a>
<h2 class="underlined_10">Control de acceso: Filtros</h2>
<div class="section">
<p>
	La segunda parte de cualquier sistema de autenticaci&oacute;n, es saber quien puede hacer que en una aplicaci&oacute;n. Por ejemplo, un usuario de tipo <em>socio</em> nunca va a poder crear nuevos usuarios en el sistema. En Grails podemos conseguir este tipo de restricciones gracias a los filtros de los controladores.
</p>
<p>
	Ya en la sesi&oacute;n 7 vimos una primera introducci&oacute;n a los filtros cuando indic&aacute;bamos que determinadas operaciones s&oacute;lo estaban permitidas a los usuarios de tipo <em>administrador</em>. Ahora vamos a ampliar esta seguridad que ya a&ntilde;adimos en su momento.
</p>
<p>
	En nuestra aplicaci&oacute;n, s&oacute;lo hay 3 lugares donde los usuarios no identificados no van a tener ning&uacute;n problema en acceder. Estos lugares son la p&aacute;gina inicio de la aplicaci&oacute;n, la p&aacute;gina donde se pueden registrar y por &uacute;ltimo, la p&aacute;gina donde se deben identificar. El resto, deber&aacute;n estar protegidas ante el acceso de usuarios no autorizados.
</p>
<p>
	Tal y como vimos en la sesi&oacute;n 7, los filtros deben crearse en el directorio <em>grails-app/conf</em> y el nombre del filtro debe terminar por la palabra <em>Filters</em>. Nuestro filtro se va a llamar, por razones obvias, <span class="codefrag">SecurityFilters</span>. Este ser&aacute; el esqueleto de los filtros que creemos en la aplicaci&oacute;n.
</p>
<pre class="code">package biblioteca

class SecurityFilters {
	def filters = {
		......
	}
}</pre>
<p>
	Los filtros pueden ser definidos de dos formas diferentes:
</p>
<ul>
	
<li>Especificando el controlador y la acci&oacute;n</li>
	
<li>Especificando la URI</li>

</ul>
<p>
	Adem&aacute;s, tambi&eacute;n vamos a poder especificar el instante en el que queremos que se ejecute el filtro:
</p>
<ul>
	
<li>
<em>before</em>, el filtro se ejecuta antes que la acci&oacute;n dada</li>
	
<li>
<em>after</em>, el filtro se ejecuta despu&eacute;s de la acci&oacute;n dada</li>
	
<li>
<em>afterView</em>, el filtro se ejecuta despu&eacute;s de que la vista sea renderizada</li>

</ul>
<p>
	Vamos a ver como quedar&iacute;a el filtro que protege del acceso no permitido a nuestra aplicaci&oacute;n. 
</p>
<pre class="code">package biblioteca

class SecuridadFilters {
    def filters = {
        bibliotecaFilter(controller:'*', action:'*') {
            before = {
                if (!session.usuario
                    &amp;&amp; !((controllerName.equals('usuario')
                    &amp;&amp; actionName.equals('login'))
                    || (controllerName.equals('usuario')
                    &amp;&amp; actionName.equals('handleLogin'))
                    || (controllerName.equals('usuario')
                    &amp;&amp; actionName.equals('register'))
                    || controllerName.equals('jcaptcha')
                )){
                    redirect(controller:'usuario', action:'login')
                    return false
                }
            }
        }
    }
}</pre>
<p>
	Con este filtro, estamos protegiendo completamente nuestra aplicaci&oacute;n del acceso de usuarios no identificados y salvo en los casos expuestos en el filtro, el usuario ser&aacute; redirigido a la pantalla de identificaci&oacute;n.
</p>
<p>
	Para realizar estas comprobaciones, podemos hacer uso de las variables <em>controllerName</em> que nos indica el controlador al que estamos accediendo y <em>actionName</em> que utilizaremos para referirnos a la acci&oacute;n del controlador referida.
</p>
<p>
	Podemos especificar tanto el par&aacute;metro controlador como la acci&oacute;n de la siguiente forma:
</p>
<pre class="code">def filters = {
    bibliotecaFilter(controller:'usuario|libro', action:'create|save|edit|update|delete') {
    ...
}</pre>
<p>
	Tambi&eacute;n podemos especificar filtros especificando la URI. Un ejemplo podr&iacute;a ser el siguiente, en donde se redirije al usuario a un nuevo proceso de registro.
</p>
<pre class="code">otroFilter(uri:'/usuario/register') {
    before = {
        redirect(controller:'usuario', action:'registernew')
    }
}</pre>
<p>
	Aqu&iacute; Grails inyecta una serie de propiedades para hacerlas accesibles en los filtros como son:
</p>
<ul>
	
<li>request</li>
	
<li>response</li>
	
<li>session</li>
	
<li>servletContext</li>
	
<li>applicationContext</li>
	
<li>params</li>

</ul>
<p>
	Sin embargo, esta soluci&oacute;n puede no ser suficiente cuando estamos desarrollando sistemas con varios perfiles de usuario y cada uno de ellos tiene una serie de operaciones permitidas y prohibidas. Por ejemplo, en nuestra aplicaci&oacute;n un usuario de tipo <em>administrador</em> no deber&iacute;a ser capaz de realizar ninguna <em>operaci&oacute;n</em> y simplemente encargarse de la gesti&oacute;n de los usuarios.
</p>
<p>
	En la siguiente secci&oacute;n, vamos a ver como utilizar el plugin JSecurity para implementar un sistema de seguridad con varios perfiles, cada uno de ellos con unos permisos determinados.
</p>
</div>


<a name="N101E3"></a><a name="Plugin+de+seguridad+Shiro"></a>
<h2 class="underlined_10">Plugin de seguridad Shiro</h2>
<div class="section">
<p>
	Si necesitamos ayuda con nuestra aplicaci&oacute;n para la creaci&oacute;n de usuarios con determinados permisos, posiblemente la mejor soluci&oacute;n nos la proporcione el plugin Shiro. Este plugin implementa una soluci&oacute;n perfecta para la creaci&oacute;n de usuarios y los roles que &eacute;stos pueden adquirir dentro de la aplicaci&oacute;n con los correspondientes permisos.
</p>
<p>
	En primer lugar, vamos a realizar la instalaci&oacute;n del plugin. Para ello ejecutamos en l&iacute;nea de comandos <span class="codefrag">grails install-plugin shiro</span> y posteriormente el comando <span class="codefrag">grails shiro-quick-start</span>. Este segundo comando copiar&aacute; una serie de clases de dominio, controladores y vistas en nuestra aplicaci&oacute;n que nos servir&aacute;n para realizar el proceso de autenticaci&oacute;n en la aplicaci&oacute;n.
</p>
<a name="N101F5"></a><a name="Clases+de+dominio+de+Shiro"></a>
<h3 class="underlined_5">Clases de dominio de Shiro</h3>
<p>
	El plugin Shiro utilizar dos clases de dominio para realizar la implementaci&oacute;n de su sistema de seguridad. Estas dos clases de dominio son las siguientes:
</p>
<p>
	
<strong>ShiroUser</strong>

</p>
<p>
	Esta clase es la que se encarga de la gesti&oacute;n de los usuarios del sistema. Los atributos de esta clase son:
</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	
<tr>
		
<th colspan="1" rowspan="1">Atributo</th>
		<th colspan="1" rowspan="1">Descripci&oacute;n</th>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">username</td>
		<td colspan="1" rowspan="1">Nombre de usuario</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">passwordHash</td>
		<td colspan="1" rowspan="1">Contrase&ntilde;a</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">roles</td>
		<td colspan="1" rowspan="1">Los diferentes roles que puede adquirir el usuario en la aplicaci&oacute;n</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">permissions</td>
		<td colspan="1" rowspan="1">Cadenas de texto especificando los permisos especiales de este usuario</td>
	
</tr>

</table>
<p>
	
<strong>ShiroRole</strong>

</p>
<p>
	Esta clase especifica los roles de la aplicaci&oacute;n. En nuestro caso necesitar&iacute;amos cuatro roles: <em>administrador, bibliotecario, profesor y socio</em>.
</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	
<tr>
		
<th colspan="1" rowspan="1">Atributo</th>
		<th colspan="1" rowspan="1">Descripci&oacute;n</th>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">name</td>
		<td colspan="1" rowspan="1">Nombre del rol o perfil</td>
	
</tr>	
	
<tr>
		
<td colspan="1" rowspan="1">users</td>
		<td colspan="1" rowspan="1">Los diferentes usuarios con este rol</td>
	
</tr>
	
<tr>
		
<td colspan="1" rowspan="1">permissions</td>
		<td colspan="1" rowspan="1">Cadenas de texto especificando los permisos especiales de este rol</td>
	
</tr>

</table>
<a name="N1028F"></a><a name="Carga+de+datos"></a>
<h3 class="underlined_5">Carga de datos</h3>
<p>
	Una vez ya conocemos las diferentes clases incluidas en la instalaci&oacute;n del plugin Shiro, vamos a crear algunos datos de ejemplo en la aplicaci&oacute;n y modificar el sistema de registro para comprobar la potencia de este plugin.
</p>
<p>
	En el ejemplo que vamos a desarrollar, vamos a utilizar dos tipos de usuarios, los <em>administradores</em> y los <em>profesores</em>. Para ello, vamos a utilizar el archivo <em>BootStrap.groovy</em> para crear algunos datos de ejemplo. Para poder utilizar la clase <span class="codefrag">Sha1Hash</span> debemos importar la librer&iacute;a <span class="codefrag">import org.apache.shiro.crypto.hash.Sha256Hash</span> el inicio del archivo <em>BootStrap.groovy</em>.
</p>
<pre class="code">def adminRole = new ShiroRole(name:'Administrador')
adminRole.addToPermissions("*:*")
adminRole.save()
def profeRole = new ShiroRole(name:'Profesor')
profeRole.addToPermissions("libro:list")
profeRole.addToPermissions("libro:show")
profeRole.save()

def adminUser = new ShiroUser(username:'admin', passwordHash:new Sha256Hash('password').toHex())
adminUser.addToRoles(adminRole)
adminUser.save()
def profeUser = new ShiroUser(username:'profesor', passwordHash:new Sha256Hash('password').toHex())
profeUser.addToRoles(profeRole)
profeUser.save()</pre>
<p>
	Con el c&oacute;digo anterior, hemos creado dos usuarios cada uno con un rol diferente. Podemos comprobar como el sistema nos autentica correctamente si accedemos a la direcci&oacute;n <a class="external" href="http://localhost:8080/biblioteca/auth">http://localhost:8080/biblioteca/auth</a> e intentamos entrar con los usuarios reci&eacute;n creados.
</p>
<p>
	Adem&aacute;s, tambi&eacute;n hemos creado un par de roles para cada uno de estos usuarios, de tal forma que en lugar de asignarles los permisos a los usuarios se los hemos asignado a los roles, con lo que podemos ser m&aacute;s gen&eacute;ricos. Adem&aacute;s, con el comando <span class="codefrag">grails shiro-quick-start</span>, tambi&eacute;n se ha creado un filtro en el directorio <em>grails-app/conf</em> llamado <em>ShiroSecurityFilters.groovy</em> con el siguiente contenido.
</p>
<pre class="code">class SecurityFilters {
    def filters = {
        all(uri: "/**") {
            before = {
                // Ignore direct views (e.g. the default main index page).
                if (!controllerName) return true

                // Access control by convention.
                accessControl()
            }
        }
    }
}</pre>
<p>
	Con el c&oacute;digo de este filtro conseguimos que la &uacute;nica p&aacute;gina que se vea sin estar autenticados en el sistema sea la p&aacute;gina de inicio de la aplicaci&oacute;n, http://localhost:8080/biblioteca y para el resto de p&aacute;ginas necesitaremos estar autenticados para poder interactuar con la aplicaci&oacute;n. Y es ah&iacute; donde entra en funcionamiento los permisos que hemos a&ntilde;adido a cada uno de los roles y por ende, a los usuarios.
</p>
<a name="N102CC"></a><a name="Etiquetas+GSP"></a>
<h3 class="underlined_5">Etiquetas GSP</h3>
<p>
	El plugin Shiro permite la utilizaci&oacute;n de una serie de etiquetas para determinadas operaciones. Estas etiquetas son las siguientes:
</p>
<ul>
	
<li>
<span class="codefrag">&lt;shiro:isLoggedIn&gt;</span>: comprueba si el usuario est&aacute; identificado en el sistema</li>
	
<li>
<span class="codefrag">&lt;shiro:isNotLoggedIn&gt;</span>: comprueba si el usuario no est&aacute; identificado en el sistema</li>
	
<li>
<span class="codefrag">&lt;shiro:authenticated&gt;</span>: etiqueta sin&oacute;nima a <span class="codefrag">isLoggedIn</span>
</li>
	
<li>
<span class="codefrag">&lt;shiro:notAuthenticated&gt;</span>: etiqueta sin&oacute;nima a <span class="codefrag">isNotLoggedIn</span>
</li>
	
<li>
<span class="codefrag">&lt;shiro:user&gt;</span>: s&oacute;lo se muestra el contenido si el usuario es reconocido con la utilizaci&oacute;n de la opci&oacute;n <em>Remember me</em>
</li>
	
<li>
<span class="codefrag">&lt;shiro:principal&gt;</span>: muestra el nombre de usuario del usuario registrado</li>
	
<li>
<span class="codefrag">&lt;shiro:hasRole&gt;</span>: s&oacute;lo se muestra el contenido si el usuario est&aacute; autenticado y adem&aacute;s tiene un rol asignado</li>

</ul>
<p>
	Podemos modificar el contenido de la plantilla <em>_header.gsp</em> para mostrar un enlace para identificarse en el sistema o indicar el nombre del usuario junto con un enlace para abandonar la aplicaci&oacute;n. El nuevo encabezado quedar&iacute;a as&iacute;:
</p>
<pre class="code">&lt;div id="menu"&gt;
    &lt;nobr&gt;
        &lt;shiro:isLoggedIn&gt;
          &lt;div&gt;
              &lt;shiro:principal/&gt;
              (
                  &lt;g:link controller="auth" action="signOut"&gt;
                      &lt;g:message code="encabezado.logout"/&gt;
                  &lt;/g:link&gt;
              )
          &lt;/div&gt;
        &lt;/shiro:isLoggedIn&gt;
        &lt;shiro:isNotLoggedIn&gt;
          &lt;div&gt;
              &lt;g:link controller="auth" action="login"&gt;
                  &lt;g:message code="encabezado.login"/&gt;
              &lt;/g:link&gt;
          &lt;/div&gt;
        &lt;/shiro:isNotLoggedIn&gt;
    &lt;/nobr&gt;
&lt;/div&gt;</pre>
</div>


<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2010-2011 Depto. Ciencia de la Computaci&oacute;n e IA</div>
</div>
<script type="text/javascript">
     
         SyntaxHighlighter.defaults['toolbar'] = false;
         SyntaxHighlighter.autoloader(
  		     'java                   skin/highlight/shBrushJava.js',
  		     'xml xhtml xslt html    skin/highlight/shBrushXml.js',
  		     'js jscript javascript  skin/highlight/shBrushJScript.js',
  		     'groovy                 skin/highlight/shBrushGroovy.js',
  		     'bash shell             skin/highlight/shBrushBash.js',
  		     'php                    skin/highlight/shBrushPhp.js',
  		     'css                    skin/highlight/shBrushCss.js',
  		     'sql                    skin/highlight/shBrushSql.js',
  		     'objc                   skin/highlight/shBrushObjC.js',
  		     'cpp c                  skin/highlight/shBrushCpp.js',
  		     'text plain             skin/highlight/shBrushPlain.js'
         );
         SyntaxHighlighter.all();
     </script><a href="skin/highlight/shBrushJava.js"></a><a href="skin/highlight/shBrushXml.js"></a><a href="skin/highlight/shBrushJScript.js"></a><a href="skin/highlight/shBrushGroovy.js"></a><a href="skin/highlight/shBrushBash.js"></a><a href="skin/highlight/shBrushPhp.js"></a><a href="skin/highlight/shBrushCss.js"></a><a href="skin/highlight/shBrushSql.js"></a><a href="skin/highlight/shBrushObjC.js"></a><a href="skin/highlight/shBrushCpp.js"></a><a href="skin/highlight/shBrushPlain.js"></a>
</body>
</html>
