<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Depuraci&oacute;n y gesti&oacute;n de logs</title>
<link type="text/css" href="skin/highlight/shCore.css" rel="stylesheet">
<link type="text/css" href="skin/highlight/shThemeEclipse.css" rel="stylesheet">
<script src="skin/highlight/shCore.js" type="text/javascript"></script><script src="skin/highlight/shAutoloader.js" type="text/javascript"></script>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://web.ua.es/especialistajava"><img class="logoImage" alt="jtech" src="images/baner_j2ee_izq.gif" title="Experto en Desarrollo de Aplicaciones y Servicios con Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Lenguaje Java Avanzado" src="images/baner_j2ee_der.gif" title="Lenguaje Java Avanzado"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="javascript:location.href='../index.html'">Home</a>
</li>
<li>
<a class="base-not-selected" href="javascript:location.href='../aplic-web.html'">Aplicaciones Web</a>
</li>
<li>
<a class="base-not-selected" href="javascript:location.href='../aplic-ent.html'">Aplicaciones Enterprise</a>
</li>
<li>
<a class="base-not-selected" href="javascript:location.href='../charlas.html'">Charlas</a>
</li>
<li>
<a class="base-not-selected" href="javascript:location.href='../proy-int/index.html'">Proyecto</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Java y Herramientas de Desarrollo</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 6</div>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html">Sesion 8</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html">Sesion 8</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion06-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Depuraci&oacute;n y gesti&oacute;n de logs</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Depuraci%C3%B3n+con+Eclipse">Depuraci&oacute;n con Eclipse</a>
<ul class="minitoc">
<li>
<a href="#Primeros+pasos+para+depurar+un+proyecto">Primeros pasos para depurar un proyecto</a>
</li>
<li>
<a href="#Establecer">Establecer breakpoints</a>
</li>
<li>
<a href="#Evaluar+expresiones">Evaluar expresiones</a>
</li>
<li>
<a href="#Explorar+variables">Explorar variables</a>
</li>
<li>
<a href="#Cambiar+c%C3%B3digo+%22en+caliente%22">Cambiar c&oacute;digo "en caliente"</a>
</li>
</ul>
</li>
<li>
<a href="#Gesti%C3%B3n+de+logs+con+Log4Java">Gesti&oacute;n de logs con Log4Java</a>
<ul class="minitoc">
<li>
<a href="#Estructura+de+Log4J">Estructura de Log4J</a>
</li>
<li>
<a href="#Niveles+de+log+%28loggers%29">Niveles de log (loggers)</a>
</li>
<li>
<a href="#Salidas+de+log+%28appenders%29">Salidas de log (appenders)</a>
</li>
<li>
<a href="#Formato+del+log+%28layout%29">Formato del log (layout)</a>
</li>
<li>
<a href="#Configurar+Log4J">Configurar Log4J</a>
<ul class="minitoc">
<li>
<a href="#Configuraci%C3%B3n+b%C3%A1sica+de+Log4J">Configuraci&oacute;n b&aacute;sica de Log4J</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+mediante+ficheros+de+propiedades">Configuraci&oacute;n mediante ficheros de propiedades</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+mediante+un+fichero+XML">Configuraci&oacute;n mediante un fichero XML</a>
</li>
<li>
<a href="#Cambios+%22en+caliente%22">Cambios "en caliente"</a>
</li>
<li>
<a href="#Sumario+de+configuraciones">Sumario de configuraciones</a>
</li>
</ul>
</li>
</ul>
</li>
<li>
<a href="#La+librer%C3%ADa+commons-logging">La librer&iacute;a commons-logging</a>
<ul class="minitoc">
<li>
<a href="#Definir+mensajes+de+logs+en+nuestras+aplicaciones+con+commons-logging">Definir mensajes de logs en nuestras aplicaciones con commons-logging</a>
</li>
<li>
<a href="#Enlazar+con+nuestra+librer%C3%ADa%3A+Log4J">Enlazar con nuestra librer&iacute;a: Log4J</a>
</li>
<li>
<a href="#Enlazar+con+otras+librer%C3%ADas">Enlazar con otras librer&iacute;as</a>
</li>
<li>
<a href="#Conclusiones">Conclusiones</a>
</li>
</ul>
</li>
</ul>
</div>

<p>En esta sesi&oacute;n veremos c&oacute;mo podemos depurar nuestro c&oacute;digo al ejecutarlo, mediante el depurador incorporado en Eclipse. Para las aplicaciones donde no sea posible su auto-ejecuci&oacute;n (por ejemplo, aplicaciones basadas en web), debemos recurrir a otras t&eacute;cnicas de depurado, como son la emisi&oacute;n de mensajes de estado (logs), que indiquen qu&eacute; va haciendo el programa en cada momento. Para esto veremos c&oacute;mo utilizar una librer&iacute;a llamada <strong>Log4Java</strong>, y las posibilidades que ofrece.</p>

<a name="N10012"></a><a name="Depuraci%C3%B3n+con+Eclipse"></a>
<h2 class="underlined_10">Depuraci&oacute;n con Eclipse</h2>
<div class="section">
<p>En este apartado veremos c&oacute;mo podemos depurar el c&oacute;digo de nuestras aplicaciones desde el depurador que incorpora Eclipse, encontrando el origen de los errores que provoque nuestro programa. Este depurador incorpora muchas funcionalidades, como la ejecuci&oacute;n paso a paso, establecimiento de <em>breakpoints</em>, consulta y establecimiento de valores de variables, parar y reanudar hilos de ejecuci&oacute;n, etc. Tambi&eacute;n podremos depurar aplicaciones que se est&eacute;n ejecutando en m&aacute;quinas remotas, e incluso utilizar el depurador a la hora de trabajar con otros lenguajes como C o C++ (instalando las <em>C/C++ Development Tools (CDT)</em>).</p>
<p>Eclipse proporciona una vista de depuraci&oacute;n (<em>debug view</em>) que permite controlar el depurado y ejecuci&oacute;n de programas. En &eacute;l se muestra la pila de los procesos e hilos que tengamos ejecutando en cada momento. </p>
<a name="N10027"></a><a name="Primeros+pasos+para+depurar+un+proyecto"></a>
<h3 class="underlined_5">Primeros pasos para depurar un proyecto</h3>
<p>En primer lugar, debemos tener nuestro proyecto hecho y correctamente compilado. Una vez hecho eso, 
		ejecutaremos la aplicaci&oacute;n, pero en lugar de hacerlo desde el men&uacute; <em>Run As</em> lo haremos desde
		el men&uacute; <em>Debug As</em> (pinchando sobre el bot&oacute;n derecho sobre la clase que queramos ejecutar/depurar). </p>
<p>En algunas versiones de Eclipse, al depurar el c&oacute;digo pasamos directamente a la perspectiva de depuraci&oacute;n (<em>Debug perspective</em>), pero para cambiar manualmente, vamos a <strong>Window - Open perspective - Debug</strong>. </p>
<p>
<img alt="Perspectiva de depuraci&oacute;n" content-width="12cm" height="300" src="imagenes/herramientas/debug_perspectiva.gif" width="600"></p>
<p>En la parte superior izquierda vemos los hilos que se ejecutan, y su estado. Arriba a la derecha vemos los <em>breakpoints</em> que establezcamos, y los valores de las variables que entran en juego. Despu&eacute;s tenemos el c&oacute;digo fuente, para poder establecer marcas y <em>breakpoints</em> en &eacute;l, y debajo la ventana con la salida del proyecto. </p>
<a name="N10051"></a><a name="Establecer"></a>
<h3 class="underlined_5">Establecer breakpoints</h3>
<p>Una de las operaciones m&aacute;s habituales a la hora de depurar es establecer <em>breakpoints</em>, puntos en los que la ejecuci&oacute;n del programa se detiene para permitir al programador examinar cu&aacute;l es el estado del mismo en ese momento. </p>
<p>Para establecer <em>breakpoints</em>, vamos en la ventana de c&oacute;digo hasta la l&iacute;nea que queramos marcar, y hacemos doble click en el margen izquierdo: </p>
<p>
<img alt="Establecer breakpoints" content-width="11cm" height="349" src="imagenes/herramientas/debug_breakpoint.gif" width="527"></p>
<p>El <em>breakpoint</em> se a&ntilde;adir&aacute; a la lista de <em>breakpoints</em> de la pesta&ntilde;a superior derecha. Una vez hecho esto, re-arrancamos el programa desde <strong>Run - Debug</strong>, seleccionando la configuraci&oacute;n deseada y pulsando en <strong>Debug</strong>. </p>
<p>
<img alt="Control del estado del programa" content-width="12cm" height="138" src="imagenes/herramientas/debug_breakpoint_2.gif" width="599"></p>
<p>En la parte superior podemos ver el estado de las variables (pesta&ntilde;a <em>Variables</em>), y de los hilos de ejecuci&oacute;n. Tras cada <em>breakpoint</em>, podemos reanudar el programa pulsando el bot&oacute;n de <em>Resume</em> (la flecha verde), en la parte superior. </p>
<p>
<strong>Breakpoints condicionales</strong> 
</p>
<p>Podemos establecer tambi&eacute;n <em>breakpoints</em> condicionales, que se disparen &uacute;nicamente cuando el valor de una determinada expresi&oacute;n o variable cambie. Para ello, pulsamos con el bot&oacute;n derecho sobre la marca del <em>breakpoint</em> en el c&oacute;digo, y elegimos <strong>Breakpoint Properties</strong>. All&iacute; veremos una casilla que indica <strong>Enable Condition</strong>. Basta con marcarla y poner la expresi&oacute;n que queremos verificar. Podremos hacer que se dispare el <em>breakpoint</em> cuando la condici&oacute;n sea cierta, o cuando el valor de esa condici&oacute;n cambie: </p>
<p>
<img alt="Breakpoints condicionales" content-width="10cm" height="556" src="imagenes/herramientas/debug_breakpoint_cond.gif" width="491"></p>
<a name="N100B0"></a><a name="Evaluar+expresiones"></a>
<h3 class="underlined_5">Evaluar expresiones</h3>
<p>Podemos evaluar una expresi&oacute;n del c&oacute;digo si, durante la depuraci&oacute;n, seleccionamos la expresi&oacute;n a evaluar, y con el bot&oacute;n derecho 
		elegimos <strong>Inspect</strong>. Si queremos hacer un seguimiento del valor de la expresi&oacute;n durante la ejecuci&oacute;n del programa, seleccionaremos
		<strong>Watch</strong> en lugar de <strong>Inspect</strong>. De esta forma el valor de la expresi&oacute;n se ir&aacute; actualizando conforme &eacute;sta cambie.</p>
<p>
<img alt="Evaluaci&oacute;n de expresiones" content-width="11cm" height="330" src="imagenes/herramientas/debug_expresion.gif" width="572"></p>
<a name="N100CB"></a><a name="Explorar+variables"></a>
<h3 class="underlined_5">Explorar variables</h3>
<p>Como hemos dicho, en la parte superior derecha, en el cuadro <strong>Variables</strong> podemos ver el valor que tienen las variables en cada momento. Una vez que la depuraci&oacute;n alcanza un <em>breakpoint</em>, podemos desde el men&uacute; <strong>Run</strong> ir a la opci&oacute;n <strong>Step Over</strong> (o pulsar <strong>F6</strong>), para ir ejecutando paso a paso a partir del <em>breakpoint</em>, y ver en cada paso qu&eacute; variables cambian (se ponen en rojo), y qu&eacute; valores toman. </p>
<p>Tambi&eacute;n podemos, en el cuadro de variables, pulsar con el bot&oacute;n derecho sobre una, y elegir <strong>Change Value</strong>, para cambiar a mano su valor y ver c&oacute;mo se comporta el programa. </p>
<p>
<img alt="Exploraci&oacute;n de variables" content-width="7cm" height="160" src="imagenes/herramientas/debug_variables.gif" width="375"></p>
<a name="N100F5"></a><a name="Cambiar+c%C3%B3digo+%22en+caliente%22"></a>
<h3 class="underlined_5">Cambiar c&oacute;digo "en caliente"</h3>
<p>Si utilizamos Java 1.4 o superior, desde el depurador de Eclipse podemos, durante la depuraci&oacute;n, cambiar el c&oacute;digo de nuestra aplicaci&oacute;n y seguir depurando. Basta con modificar el c&oacute;digo durante una parada por un <em>breakpoint</em> o algo similar, y despu&eacute;s pulsar en <em>Resume</em> para seguir ejecutando. </p>
<p>Esto se debe a que Java 1.4 es compatible con la JPDA (<em>Java Platform Debugger Architecture)</em>, que permite modificar c&oacute;digo en una aplicaci&oacute;n en ejecuci&oacute;n. Esto es &uacute;til cuando es muy pesado re-arrancar la aplicaci&oacute;n, o llegar al punto donde falla. </p>
</div>

<a name="N1010C"></a><a name="Gesti%C3%B3n+de+logs+con+Log4Java"></a>
<h2 class="underlined_10">Gesti&oacute;n de logs con Log4Java</h2>
<div class="section">
<p>Log4Java (log4j) es una librer&iacute;a <em>open source</em> que permite a los desarrolladores de software controlar la salida de los mensajes que generen sus aplicaciones, y hacia d&oacute;nde direccionarlos, con una cierta granularidad. Es configurable en tiempo de ejecuci&oacute;n, lo que permite establecer el tipo de mensajes que queremos mostrar y d&oacute;nde mostrarlos, sin tener que detener ni recompilar nuestra aplicaci&oacute;n.</p>
<p>Para encontrar m&aacute;s informaci&oacute;n acerca de Log4J, as&iacute; como &uacute;ltimas versiones que vayan saliendo, consultad la p&aacute;gina del proyecto Jakarta: <a href="http://jakarta.apache.org/log4j/"><strong>http://jakarta.apache.org/log4j/</strong></a>.</p>
<a name="N10120"></a><a name="Estructura+de+Log4J"></a>
<h3 class="underlined_5">Estructura de Log4J</h3>
<p>El funcionamiento de Log4J se basa en 3 elementos b&aacute;sicos: <em>loggers</em>, <em>appenders</em> y <em>layouts</em>.</p>
<p>Los <strong>loggers</strong> son entidades asociadas a nombres (de paquetes o clases), que recogen los mensajes de log que emiten dichos paquetes o clases. Se dice que un <em>logger</em> es un <strong>antecesor</strong> de otro si su nombre, seguido de un punto, es un prefijo del nombre del otro log. Un <em>logger</em> es el <strong>padre</strong> de otro, si es su antecesor m&aacute;s cercano. Por ejemplo: el logger <span class="codefrag">com.foo</span> es padre del logger <span class="codefrag">com.foo.Bar</span>, y antecesor de <span class="codefrag">com.foo.otroPaquete.UnaClase</span>.</p>
<p>Existe siempre un logger ra&iacute;z (<em>root logger</em>), a partir del cual se genera toda la jerarqu&iacute;a de nuestra aplicaci&oacute;n.</p>
<p>Una vez controlado el mensaje de log, se debe mostrar por alguna parte. Ese <em>d&oacute;nde</em> se env&iacute;a el mensaje de log es lo que llamamos <strong>appender</strong>. Podremos tener como <em>appenders</em> la propia pantalla, un fichero de texto, o una base de datos, entre otros, como veremos a continuaci&oacute;n.</p>
<p>Finalmente, podemos dar un formato a los mensajes de log, para que se muestren con la apariencia que queramos. Por ejemplo, mostrar la fecha actual, tipo de mensaje, y texto del mensaje. Todo esto se consigue definiendo el correspondiente <strong>layout</strong> de los logs.</p>
<p>Veremos cada uno de estos elementos con m&aacute;s detalle a continuaci&oacute;n.</p>
<a name="N10169"></a><a name="Niveles+de+log+%28loggers%29"></a>
<h3 class="underlined_5">Niveles de log (loggers)</h3>
<p>Una ventaja que debe tener una librer&iacute;a de logging sobre los tradicionales <span class="codefrag">System.out.println</span> o <span class="codefrag">printf</span> que nos ayudaban a ver por d&oacute;nde iba el programa y qu&eacute; pasaba, es que deben permitir omitir estos mensajes de forma c&oacute;moda, cuando no necesitemos que se muestren, sin tener que quitarlos a mano del c&oacute;digo y recompilar la aplicaci&oacute;n.</p>
<p>Los mensajes de log que maneja log4j se categorizan en 5 niveles de prioridad:</p>
<ul>
			
<li>
<span class="codefrag">DEBUG</span>: para mensajes de depuraci&oacute;n, mientras se est&aacute; desarrollando la aplicaci&oacute;n, para ver c&oacute;mo se comporta.</li>
			
<li>
<span class="codefrag">INFO</span>: para mensajes que muestren informaci&oacute;n del programa durante su ejecuci&oacute;n (por ejemplo, versi&oacute;n que se est&eacute; ejecutando, inicios o fines de procesos que se lancen, etc)</li>
			
<li>
<span class="codefrag">WARN</span>: para mensajes de alerta sobre situaciones an&oacute;malas que se produzcan, pero que no afecten el funcionamiento correcto del programa.</li>
			
<li>
<span class="codefrag">ERROR</span>: para guardar constancia de errores del programa que, aunque le permitan seguir funcionando, afecten al funcionamiento del mismo. Por ejemplo, que un par&aacute;metro de configuraci&oacute;n tenga un valor incorrecto, o que no se encuentre un fichero no cr&iacute;tico.</li>
			
<li>
<span class="codefrag">FATAL</span>: se utiliza para mensajes cr&iacute;ticos, por errores que hacen que el programa generalmente aborte su ejecuci&oacute;n.</li>
		
</ul>
<p>Se podr&aacute; habilitar que se muestren los mensajes pertenecientes a ciertas categor&iacute;as de las anteriores, en cualquier momento, seg&uacute;n la informaci&oacute;n que nos interese mantener.</p>
<p>Para mostrar mensajes de log en una clase, debemos crear un objeto de tipo <span class="codefrag">org.apache.log4j.Logger</span>, asign&aacute;ndole el nombre asociado (normalmente nos basamos en el nombre de la clase que lo usa), y luego tenemos en ella m&eacute;todos para generar mensajes de cada uno de los 5 niveles:</p>
<pre class="brush:java;">debug (String mensaje)
info  (String mensaje)
warn  (String mensaje)
error (String mensaje)
fatal (String mensaje)</pre>
<p>Por ejemplo:</p>
<pre class="brush:java;">import org.apache.log4j.*;

public class MiClase
{
	static Logger logger = Logger.getLogger(MiClase.class);
	...
	public static void main(String[] args)
	{
		logger.info("Entrando en la aplicacion");
		...
		logger.warn("Esto es una advertencia");
		...
		logger.fatal("Error fatal");
	}
}</pre>
<p>Adem&aacute;s, existen dos niveles extras que s&oacute;lo se utilizan en el fichero de configuraci&oacute;n:</p>
<ul>
			
<li>
<span class="codefrag">ALL</span>: el nivel m&aacute;s bajo posible, habilita todos los niveles anteriores</li>
			
<li>
<span class="codefrag">OFF</span>: el nivel m&aacute;s alto, deshabilita todos los niveles anteriores.</li>
		
</ul>
<p>Veremos m&aacute;s adelante c&oacute;mo configurar la habilitaci&oacute;n o deshabilitaci&oacute;n de los niveles que interesen.</p>
<a name="N101C1"></a><a name="Salidas+de+log+%28appenders%29"></a>
<h3 class="underlined_5">Salidas de log (appenders)</h3>
<p>Adem&aacute;s, log4j permite que un nivel de log se muestre por una o varias salidas establecidas. Cada una de las salidas por las que puede mostrarse un log se llama <em>appender</em>. Algunos de los disponibles (cuyas clases est&aacute;n en el paquete <span class="codefrag">org.apache.log4j</span>) son:</p>
<ul>
			
<li>
				
<p>
<span class="codefrag">ConsoleAppender</span>: muestra el log en la pantalla. Tiene 3 opciones configurables:</p>
    			
<ul>
					
<li>
<span class="codefrag">Threshold=WARN</span>: indica que no muestre ning&uacute;n mensaje con nivel menor que el indicado</li>
					
<li>
<span class="codefrag">ImmediateFlush=true</span>: si est&aacute; a <span class="codefrag">true</span>, indica que los mensajes no se almacenan en un buffer, sino que se env&iacute;an directamente al destino</li>
					
<li>
<span class="codefrag">Target=System.err</span>: por defecto env&iacute;a los mensajes a <span class="codefrag">System.out</span>. Establece la salida a utilizar</li>
    			
</ul>
			
</li>
			
<li>
				
<p>
<span class="codefrag">FileAppender</span>: vuelca el log a un fichero. Tiene 4 opciones configurables:</p>
				
<ul>
					
<li>
<span class="codefrag">Threshold=WARN</span>: sirve para lo mismo que en <span class="codefrag">ConsoleAppender</span>
</li>
					
<li>
<span class="codefrag">ImmediateFlush=true</span>: sirve para lo mismo que en <span class="codefrag">ConsoleAppender</span>
</li>
					
<li>
<span class="codefrag">File=logs.txt</span>: nombre del archivo donde guardar los logs</li>
					
<li>
<span class="codefrag">Append=false</span>: a <span class="codefrag">true</span> indica que los nuevos mensajes se a&ntilde;adan al final del fichero, y a <span class="codefrag">false</span>, cuando se reinicie la aplicaci&oacute;n el archivo se sobreescribir&aacute;.</li>
				
</ul>
			
</li>
			
<li>
				
<p>
<span class="codefrag">RollingFileAppender</span>: como <span class="codefrag">FileAppender</span>, pero permite definir pol&iacute;ticas de rotaci&oacute;n en los ficheros, para que no crezcan indefinidamente. Tiene 6 opciones configurables:</p>
				
<ul>
					
<li>
<span class="codefrag">Threshold=WARN</span>: sirve para lo mismo que en <span class="codefrag">ConsoleAppender</span>
</li>
					
<li>
<span class="codefrag">ImmediateFlush=true</span>: sirve para lo mismo que en <span class="codefrag">ConsoleAppender</span>
</li>
					
<li>
<span class="codefrag">File=logs.txt</span>: sirve para lo mismo que en <span class="codefrag">FileAppender</span>
</li>
					
<li>
<span class="codefrag">Append=false</span>: sirve para lo mismo que en <span class="codefrag">FileAppender</span>
</li>
					
<li>
<span class="codefrag">MaxFileSize=100KB</span>: los sufijos pueden ser KB, MB o GB. Rota el archivo de log (copia su contenido en otro fichero auxiliar para vaciarse) cuando el log alcanza el tama&ntilde;o indicado.</li>
					
<li>
<span class="codefrag">MaxBackupIndex=2</span>: mantiene los archivos de respaldo auxiliares que se indiquen como m&aacute;ximo. Los archivos de respaldo sirven para no borrar los logs antiguos cuando lleguen nuevos, sino guardarlos en otros ficheros mientras quepan. Sin esta opci&oacute;n, el n&uacute;mero de archivos de respaldo ser&iacute;a ilimitado.</li>
				
</ul>
				
<p>
<strong>NOTA:</strong> existe una variante de este <em>appender</em>, que es <span class="codefrag">DailyRollingFileAppender</span>, que permite definir pol&iacute;ticas de rotaci&oacute;n basadas en fechas (pol&iacute;ticas diarias, semanales, mensuales... etc).</p>
			
</li>
			
<li>
				
<p>
<span class="codefrag">JDBCAppender</span>: redirecciona los mensajes hacia una base de datos. Se espera que este appender sea modificado en un futuro. Sus opciones son:</p>
				
<ul>
					
<li>
<span class="codefrag">Threshold=WARN</span>: sirve para lo mismo que en <span class="codefrag">ConsoleAppender</span>
</li>
					
<li>
<span class="codefrag">ImmediateFlush=true</span>: sirve para lo mismo que en <span class="codefrag">ConsoleAppender</span>
</li>
					
<li>
<span class="codefrag">Driver=mm.mysql.Driver</span>: define el driver de conexi&oacute;n por JDBC</li>
					
<li>
<span class="codefrag">URL=jdbc:mysql://localhost/LOG4JDemo</span>:indica la URL de la base de datos en el servidor de base de datos</li>
					
<li>
<span class="codefrag">user=default</span>: login del usuario</li>
					
<li>
<span class="codefrag">password=default</span>: password del usuario</li>
					
<li>
<span class="codefrag">sql=INSERT INTO Logs(mensaje) VALUES ('%d - %c - %p - %m')</span>: sentencia SQL que se utiliza para dar de alta el mensaje en la BD.</li>
				
</ul>
			
</li>
			
<li>
				
<p>Otros <em>appenders</em>:</p>
    			
<ul>
					
<li>
<span class="codefrag">SocketAppender</span>: redirecciona los mensajes hacia un servidor remoto</li>
					
<li>
<span class="codefrag">SMTPAppender</span>: env&iacute;a un email con los mensajes de log</li>
					
<li>
<span class="codefrag">SyslogAppender</span>: redirecciona los mensajes hacia el demonio <em>syslog</em> de Unix</li>
					
<li>... etc.</li>
    			
</ul>
  			
</li>
		
</ul>
<p>Los <em>appenders</em> se establecen en la configuraci&oacute;n que se proporcione, que se ver&aacute; m&aacute;s adelante.</p>
<a name="N102B5"></a><a name="Formato+del+log+%28layout%29"></a>
<h3 class="underlined_5">Formato del log (layout)</h3>
<p>Los <em>layouts</em> son los responsables de dar formato de salida a los mensajes de log, de acuerdo a las especificaciones que indique el desarrollador de software. Algunos de los tipos disponibles son:</p>
<ul>
			
<li>
				
<p>
<span class="codefrag">SimpleLayout</span>: consiste en la prioridad del mensaje, seguida de un gui&oacute;n, y el mensaje:</p>
				
<pre class="code">DEBUG - Hola, esto es una prueba</pre>
			
</li>
  			
<li>
				
<p>
<span class="codefrag">PatternLayout</span>: establece el formato de salida del mensaje de acuerdo a unos patrones similares al comando <span class="codefrag">printf</span> de C. Algunos de los patrones disponibles son:</p>
				
<ul>
					
<li>
<span class="codefrag">c</span>: para desplegar la categor&iacute;a del evento de log. Puede tener una precisi&oacute;n, dada entre llaves, que indique qu&eacute; parte de la categor&iacute;a mostrar. Por ejemplo: <span class="codefrag">%c</span>, <span class="codefrag">%c{2}</span>.</li>
					
<li>
<span class="codefrag">C</span>: para desplegar el nombre completo de la clase que gener&oacute; el evento de log. Tambi&eacute;n puede tener una precisi&oacute;n entre llaves. Por ejemplo, si la clase en cuesti&oacute;n es <span class="codefrag">org.apache.MiClase</span>, si ponemos <span class="codefrag">%C</span> mostrar&aacute; "<span class="codefrag">org.apache.MiClase"</span>, pero si ponemos <span class="codefrag">%C{1}</span> mostrar&aacute; "<span class="codefrag">MiClase</span>".</li>
					
<li>
<span class="codefrag">d</span>: muestra la fecha en que se genera el evento de log. Entre llaves podemos indicar el formato de la misma. Por ejemplo: <span class="codefrag">d{dd/MM/yyyy HH:mm:ss}</span>
</li>
					
<li>
<span class="codefrag">L</span>: muestra el n&uacute;mero de l&iacute;nea donde se ha generado el evento de log</li>
					
<li>
<span class="codefrag">m</span>: muestra el mensaje del evento de log</li>
					
<li>
<span class="codefrag">M</span>: muestra el nombre del m&eacute;todo que gener&oacute; el evento de log</li>
					
<li>
<span class="codefrag">n</span>: genera un salto de l&iacute;nea en el formato</li>
					
<li>
<span class="codefrag">p</span>: muestra la prioridad del evento de log</li>
					
<li>
<span class="codefrag">r</span>: muestra los milisegundos desde que se inici&oacute; la aplicaci&oacute;n hasta que se produjo el error</li>
					
<li>... existen otros muchos modificadores que no se comentan aqu&iacute;, por simplificar.</li>
				
</ul>
			
</li>
			
<li>
				
<p>
<span class="codefrag">HTMLLayout</span>: establece como salida de log una tabla HTML. Tiene como atributos:</p>
				
<ul>
					
<li>
<span class="codefrag">LocationInfo=true</span>: a <span class="codefrag">true</span> muestra la clase Java y el n&uacute;mero de l&iacute;nea donde se produjo el mensaje</li>
					
<li>
<span class="codefrag">Title=T&iacute;tulo de mi aplicaci&oacute;n</span>: indica el valor a incluir en el tag <span class="codefrag">&lt;title&gt;</span> de HTML</li>
				
</ul>
			
</li>
			
<li>
				
<p>
<span class="codefrag">XMLLayout</span>: la salida ser&aacute; un archivo XML, que cumple con la DTD <span class="codefrag">log4j.dtd</span>. Tiene como atributo:</p>
				
<ul>
					
<li>
<span class="codefrag">LocationInfo=true</span>: a <span class="codefrag">true</span> muestra la clase Java y el n&uacute;mero de l&iacute;nea donde se produjo el mensaje</li>
				
</ul>
			
</li>
			
<li>
<span class="codefrag">TTCCLayout</span>: consiste en la fecha, hilo, categor&iacute;a y NDC (Nested Diagnostic Context) del evento.</li>
		
</ul>
<p>El formato de log tambi&eacute;n se establece en los ficheros de configuraci&oacute;n, como se ver&aacute; m&aacute;s adelante.</p>
<a name="N1035F"></a><a name="Configurar+Log4J"></a>
<h3 class="underlined_5">Configurar Log4J</h3>
<p>Log4J permite configurarse mediante archivos, bien sean XML, o archivos de propiedades de java (donde cada l&iacute;nea tiene el aspecto <span class="codefrag">clave=valor</span>).</p>
<p>Vemos un ejemplo de c&oacute;mo incluir logs en una aplicaci&oacute;n. Los pasos a seguir son:</p>
<ul>
			
<li>Incluir los paquetes (<span class="codefrag">org.apache.log4j.*</span>)</li>
			
<li>Definir una variable de tipo <span class="codefrag">Logger</span> con el nombre de la clase que queremos loggear</li>
			
<li>Crear una configuraci&oacute;n (por ejemplo, con <span class="codefrag">BasicConfigurator.configure(...)</span>)</li>
		
</ul>
<a name="N10383"></a><a name="Configuraci%C3%B3n+b%C3%A1sica+de+Log4J"></a>
<h4>Configuraci&oacute;n b&aacute;sica de Log4J</h4>
<p>Veamos c&oacute;mo ser&iacute;a la configuraci&oacute;n m&aacute;s sencilla de Log4J con un ejemplo:</p>
<pre class="brush:java;">import org.apache.log4j.*;

public class MiClase
{
	static Logger logger = Logger.getLogger(MiClase.class);
	...
	public static void main(String[] args)
	{
		BasicConfigurator.configure();
		logger.info("Entrando en la aplicacion");
		MiOtraClase mc = new MiOtraClase();
		mc.hola();
		logger.info("Finalizando aplicacion");
	}
}</pre>
<p>El log se configura en la clase principal de la aplicaci&oacute;n (la que la arranca), y despu&eacute;s todas las subclases ya parten de esa configuraci&oacute;n para mostrar sus logs. Por ejemplo, en el caso anterior, si quisi&eacute;ramos mostrar informaci&oacute;n de log desde la clase <span class="codefrag">MiOtraClase</span>, s&oacute;lo tendr&iacute;amos que declarar el <span class="codefrag">Logger</span> y mostrar los mensajes que queramos:</p>
<pre class="brush:java;">import org.apache.log4j.*;

public class MiOtraClase
{
	static Logger logger = Logger.getLogger(MiOtraClase.class);
	...
	public MiOtraClase()
	{
		logger.info("Constructor de MiOtraClase");
		...
	}

	public void hola()
	{
		...
	}
}</pre>
<p>En este caso se ha tomado una configuraci&oacute;n por defecto, que es la que establece el m&eacute;todo <span class="codefrag">BasicConfigurator.configure()</span>. Tenemos tambi&eacute;n opci&oacute;n de pasar como configuraci&oacute;n de log un fichero de <span class="codefrag">Properties</span> (mediante un <span class="codefrag">PropertyConfigurator</span>), o un fichero XML (con un <span class="codefrag">DomConfigurator</span>), llamando a sus m&eacute;todos <span class="codefrag">configure()</span> respectivos.</p>
<a name="N103B2"></a><a name="Configuraci%C3%B3n+mediante+ficheros+de+propiedades"></a>
<h4>Configuraci&oacute;n mediante ficheros de propiedades</h4>
<p>Por ejemplo, si queremos pasarle a la clase <span class="codefrag">MiClase</span> un fichero de <span class="codefrag">Properties</span> para configurar el logging, har&iacute;amos algo como:</p>
<pre class="brush:java;">import org.apache.log4j.*;

public class MiClase
{
	static Logger logger = Logger.getLogger(MiClase.class);
	...
	public static void main(String[] args)
	{
		PropertyConfigurator.configure(args[0]);
		logger.info("Entrando en la aplicacion");
		MiOtraClase mc = new MiOtraClase();
		mc.hola();
		logger.info("Finalizando aplicacion");
	}
}</pre>
<p>Un ejemplo de archivo de configuraci&oacute;n es:</p>
<pre class="brush:java;"># Coloca el nivel root del logger en DEBUG (muestra mensajes de DEBUG hacia arriba)
# A&ntilde;ade dos appenders, llamados A1 y A2
log4j.rootLogger=DEBUG, A1, A2

# A1 se redirige a la consola
log4j.appender.A1=org.apache.log4j.ConsoleAppender

# A1 utiliza PatternLayout
log4j.appender.A1.layout=org.apache.log4j.PatternLayout
log4j.appender.A1.layout.ConversionPattern=%r [%t] %-5p %c %x %m

# A2  se redirige a un fichero
log4j.appender.A2=org.apache.log4j.RollingFileAppender

# A2 solo muestra mensajes de tipo WARN o superior, en el fichero logs.txt, hasta 1 MB
log4j.appender.A2.Threshold=WARN
log4j.appender.A2.File=logs.txt
log4j.appender.A2.MaxFileSize=1MB

# En el paquete mipaq.otropaq solo muestra mensajes de tipo WARN o superior
log4j.logger.mipaq.otropaq=WARN</pre>
<p>Si no indicamos ning&uacute;n fichero de configuraci&oacute;n (si no hay ninguna l&iacute;nea <span class="codefrag">configure</span>), por defecto Log4J buscar&aacute; en el CLASSPATH un fichero que se llame <span class="codefrag">log4j.properties</span> y tomar&aacute; la configuraci&oacute;n de &eacute;l (si lo encuentra, si no aplicar&aacute; una configuraci&oacute;n por defecto). As&iacute; que una alternativa es crearnos ese fichero con la configuraci&oacute;n que queramos, en lugar de llamar a otro distinto.</p>
<a name="N103D8"></a><a name="Configuraci%C3%B3n+mediante+un+fichero+XML"></a>
<h4>Configuraci&oacute;n mediante un fichero XML</h4>
<p>Si queremos hacer la misma configuraci&oacute;n anterior desde un fichero XML, har&iacute;amos algo como:</p>
<pre class="brush:java;">import org.apache.log4j.*;

public class MiClase
{
	static Logger logger = Logger.getLogger(MiClase.class);
	...
	public static void main(String[] args)
	{
		DOMConfigurator.configure(args[0]);
		logger.info("Entrando en la aplicacion");
		MiOtraClase mc = new MiOtraClase();
		mc.hola();
		logger.info("Finalizando aplicacion");
	}
}</pre>
<p>y como par&aacute;metro le pasar&iacute;amos el fichero XML de configuraci&oacute;n. Un ejemplo de archivo de configuraci&oacute;n es:</p>
<pre class="brush:xml;">&lt;?xml version="1.0" encoding="UTF-8" ?&gt;
&lt;!DOCTYPE log4j:configuration SYSTEM "log4j.dtd"&gt;

&lt;log4j:configuration&gt;

  &lt;!-- Definimos appender A1 de tipo ConsoleAppender --&gt;
  &lt;appender name="A1" class="org.apache.log4j.ConsoleAppender"&gt;
    &lt;layout class="org.apache.log4j.PatternLayout"&gt;
      &lt;param name="ConversionPattern" value="%r [%t] %-5p %c %x %m"/&gt;
    &lt;/layout&gt;
  &lt;/appender&gt;

  &lt;!-- Definimos appender A2 de tipo FileAppender --&gt;
  &lt;appender name="A1" class="org.apache.log4j.FileAppender"&gt;
    &lt;param name="File" value="logs.txt"/&gt;
    &lt;param name="Threshold" value="warn"/&gt;
    &lt;param name="MaxFileSize" value="1MB"/&gt;
    &lt;layout class="org.apache.log4j.SimpleLayout"&gt;
  &lt;/appender&gt;

  &lt;!-- Configuramos el root logger --&gt;
  &lt;root&gt;
    &lt;priority value ="debug" /&gt;
    &lt;appender-ref ref="A1"/&gt;
    &lt;appender-ref ref="A2"/&gt;
  &lt;/root&gt;

&lt;/log4j:configuration&gt;</pre>
<a name="N103EF"></a><a name="Cambios+%22en+caliente%22"></a>
<h4>Cambios "en caliente"</h4>
<p>Adicionalmente, se tienen los m&eacute;todos <span class="codefrag">PropertyConfigurator.configureAndWatch(...)</span> y <span class="codefrag">DomConfigurator.configureAndWatch(...)</span>, que establecen la configuraci&oacute;n, como <span class="codefrag">configure()</span>, pero revisan en tiempo de ejecuci&oacute;n el fichero de configuraci&oacute;n para aplicar los cambios que sobre &eacute;l podamos hacer.</p>
<a name="N10402"></a><a name="Sumario+de+configuraciones"></a>
<h4>Sumario de configuraciones</h4>
<p>En resumen, tenemos 4 formas de establecer la configuraci&oacute;n de Log4J:</p>
<ul>
				
<li>Utilizar <span class="codefrag">BasicConfigurator.configure()</span>, en cuyo caso usar&aacute; la configuraci&oacute;n por defecto que tiene Log4J.</li>
				
<li>Utilizar <span class="codefrag">PropertyConfigurator.configure("fichero")</span> o <span class="codefrag">PropertyConfigurator.configureAndWatch("fichero")</span>, en cuyo caso utilizar&aacute; el fichero de propiedades indicado. En el segundo caso, recoger&aacute; autom&aacute;ticamente los cambios que hagamos en el fichero de propiedades</li>
				
<li>Utilizar <span class="codefrag">DOMConfigurator.configure("fichero")</span> o <span class="codefrag">DOMConfigurator.configureAndWatch("fichero")</span>, en cuyo caso utilizar&aacute; el fichero XML de configuraci&oacute;n indicado. En el segundo caso, recoger&aacute; autom&aacute;ticamente los cambios que hagamos en dicho fichero</li>
				
<li>No poner nada, en cuyo caso buscar&aacute; un archivo de propiedades <span class="codefrag">log4j.properties</span> en el CLASSPATH, con la configuraci&oacute;n que hayamos indicado en &eacute;l</li>
			
</ul>
</div>


<a name="N1042F"></a><a name="La+librer%C3%ADa+commons-logging"></a>
<h2 class="underlined_10">La librer&iacute;a commons-logging</h2>
<div class="section">
<p>Aunque Log4J es una librer&iacute;a muy potente para logging, puede que no se adapte a nuestras necesidades, o a las de nuestra empresa. En ese caso, tenemos una alternativa m&aacute;s flexible: utilizar las librer&iacute;as <strong>commons-logging</strong> de Jakarta: <a href="http://jakarta.apache.org/commons/logging/"><span class="codefrag">http://jakarta.apache.org/commons/logging/</span></a>.</p>
<p>Esta librer&iacute;a no proporciona herramientas de logging propiamente dichas, sino una envoltura (<em>wrapper</em>) con la que colocar los mensajes de log en nuestras aplicaciones, y bajo la cual podemos poner la librer&iacute;a de logs que queramos, como puedan ser Log4Java, la librer&iacute;a de logging de Java (<span class="codefrag">SimpleLog</span>), u otras, configurando adecuadamente el puente entre el wrapper de <span class="codefrag">commons-logging</span> y nuestra librer&iacute;a de log.</p>
<a name="N1044C"></a><a name="Definir+mensajes+de+logs+en+nuestras+aplicaciones+con+commons-logging"></a>
<h3 class="underlined_5">Definir mensajes de logs en nuestras aplicaciones con commons-logging</h3>
<p>Para colocar los mensajes de log en nuestros programas utilizando <span class="codefrag">commons-logging</span>, basta con tener cargada la librer&iacute;a JAR correspondiente (normalmente, el fichero <span class="codefrag">commons-logging-1.1.jar</span> o similar que venga en la distribuci&oacute;n que nos descarguemos). Despu&eacute;s, en cada clase sobre la que queramos generar logs, creamos un objeto de tipo <span class="codefrag">org.apache.commons.logging.Log</span>, como veremos en el siguiente ejemplo, y llamamos a sus m&eacute;todos <span class="codefrag">info(), debug(), error(), warn(), fatal()</span>, como hac&iacute;amos con Log4J:</p>
<pre class="brush:java;">import org.apache.commons.logging.*;

public class ClaseAuxiliar
{
  String mensaje = null;
  static Log logger = LogFactory.getLog(ClaseAuxiliar.class);

  public ClaseAuxiliar()
  {
    logger.info("Clase auxiliar inicializada");
  }

  public String mensaje() {
    if (mensaje == null) {
      logger.warn("Atencion, el mensaje es null");
      return "";
    }
    return mensaje;
  }
}</pre>
<a name="N10467"></a><a name="Enlazar+con+nuestra+librer%C3%ADa%3A+Log4J"></a>
<h3 class="underlined_5">Enlazar con nuestra librer&iacute;a: Log4J</h3>
<p>Ya tenemos colocados nuestros mensajes de log en la aplicaci&oacute;n, pero... &iquest;c&oacute;mo le decimos al programa que queremos utilizar Log4J, y un fichero de configuraci&oacute;n de Log4J?</p>
<p>Simplemente tenemos que dejar en el CLASSPATH de nuestra aplicaci&oacute;n dos ficheros de propiedades: Uno llamado <span class="codefrag">commons-logging.properties</span>, en cuyo contenido indicamos, con la siguiente l&iacute;nea, que vamos a utilizar Log4J como logger interno:</p>
<pre class="code">org.apache.commons.logging.Log=
    org.apache.commons.logging.impl.Log4JLogger</pre>
<p>El segundo fichero debe llamarse <span class="codefrag">log4j.properties</span>, que contendr&aacute; la configuraci&oacute;n que le queremos dar a Log4Java, como hemos visto antes. Un ejemplo de este fichero ser&iacute;a:</p>
<pre class="code"># Coloca el nivel root del logger en DEBUG (muestra mensajes de DEBUG hacia arriba)
# A&ntilde;ade appender A1
log4j.rootLogger=DEBUG, A1

# A1 se redirige a la consola
log4j.appender.A1=org.apache.log4j.ConsoleAppender
log4j.appender.A1.Threshold=INFO

# A1 utiliza PatternLayout
log4j.appender.A1.layout=org.apache.log4j.PatternLayout
log4j.appender.A1.layout.ConversionPattern=%d{dd/MM/yyyy HH:mm:ss} - %p - %m %n</pre>
<p>Recordemos que Log4J, si no se especifica ning&uacute;n fichero de configuraci&oacute;n, buscar&aacute; el fichero <span class="codefrag">log4j.properties</span> en el CLASSPATH, por eso tenemos que llamarlo as&iacute;.</p>
<a name="N1048A"></a><a name="Enlazar+con+otras+librer%C3%ADas"></a>
<h3 class="underlined_5">Enlazar con otras librer&iacute;as</h3>
<p>Si en lugar de trabajar con Log4J queremos trabajar con otras librer&iacute;as, tendremos que consultar la documentaci&oacute;n de <span class="codefrag">commons-logging</span> para ver c&oacute;mo se hace. Por ejemplo, podemos utilizar la librer&iacute;a de logging que viene con JDK. Para eso, simplemente necesitamos, como antes, dos ficheros de propiedades en el classpath: uno llamado <span class="codefrag">commons-logging.properties</span>, como antes, en cuyo contenido indicamos, con la siguiente l&iacute;nea, que vamos a utilizar la librer&iacute;a de JDK como logger interno:</p>
<pre class="code">org.apache.commons.logging.Log=org.apache.commons.logging.impl.SimpleLog</pre>
<p>El segundo fichero debe llamarse <span class="codefrag">simplelog.properties</span>, y contendr&aacute; la configuraci&oacute;n espec&iacute;fica para este tipo de loggers. Un ejemplo sencillo de fichero ser&iacute;a:</p>
<pre class="code"># Nivel de log general
# ("trace", "debug", "info", "warn", "error", o "fatal"). 
# Por defecto es "info"
org.apache.commons.logging.simplelog.defaultlog=warn

# A true si queremos que el nombre del Log aparezca en cada mensaje en la salida
org.apache.commons.logging.simplelog.showlogname=false

# A true si queremos que el nombre corto del Log (su &uacute;ltimo t&eacute;rmino) aparezca en cada mensaje en la salida
org.apache.commons.logging.simplelog.showShortLogname=true

# A true si queremos poner fecha y hora actuales en cada mensaje en la salida
org.apache.commons.logging.simplelog.showdatetime=true</pre>
<a name="N104A8"></a><a name="Conclusiones"></a>
<h3 class="underlined_5">Conclusiones</h3>
<p>Observad que la principal ventaja de utilizar <span class="codefrag">commons-logging</span> es que, una vez colocados los mensajes de log en nuestra aplicaci&oacute;n, ya no tenemos que tocar nada del c&oacute;digo fuente para configurarla, ni para cambiar de librer&iacute;a de log si queremos. Basta con colocar en el CLASSPATH los ficheros de propiedades correspondientes, y reajustar en ellos la configuraci&oacute;n de logging que deseamos.</p>
</div>


<p class="pageBreakAfter"></p>


</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2012-2013 Dept. Ciencia de la Computaci&oacute;n e IA</div>
</div>
<script type="text/javascript">
     
         SyntaxHighlighter.defaults['toolbar'] = false;
         SyntaxHighlighter.autoloader(
  		     'java                   skin/highlight/shBrushJava.js',
  		     'xml xhtml xslt html    skin/highlight/shBrushXml.js',
  		     'js jscript javascript  skin/highlight/shBrushJScript.js',
  		     'groovy                 skin/highlight/shBrushGroovy.js',
  		     'bash shell             skin/highlight/shBrushBash.js',
  		     'php                    skin/highlight/shBrushPhp.js',
  		     'css                    skin/highlight/shBrushCss.js',
  		     'sql                    skin/highlight/shBrushSql.js',
  		     'objc                   skin/highlight/shBrushObjC.js',
  		     'cpp c                  skin/highlight/shBrushCpp.js',
  		     'text plain             skin/highlight/shBrushPlain.js'
         );
         SyntaxHighlighter.all();
     </script><a href="skin/highlight/shBrushJava.js"></a><a href="skin/highlight/shBrushXml.js"></a><a href="skin/highlight/shBrushJScript.js"></a><a href="skin/highlight/shBrushGroovy.js"></a><a href="skin/highlight/shBrushBash.js"></a><a href="skin/highlight/shBrushPhp.js"></a><a href="skin/highlight/shBrushCss.js"></a><a href="skin/highlight/shBrushSql.js"></a><a href="skin/highlight/shBrushObjC.js"></a><a href="skin/highlight/shBrushCpp.js"></a><a href="skin/highlight/shBrushPlain.js"></a>
</body>
</html>
