<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Roadmap</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Java y Herramientas de Desarrollo" src="images/baner_j2ee_der.gif" title="Java y Herramientas de Desarrollo"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Java y Herramientas de Desarrollo</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html">Sesion 8</a>
</div>
<div class="menupage">
<div class="menupagetitle">Roadmap</div>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html">Sesion 8</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="roadmap-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Roadmap</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Puntos+destacados">Puntos destacados</a>
</li>
<li>
<a href="#Certificaci%C3%B3n+Sun">Certificaci&oacute;n Sun</a>
</li>
<li>
<a href="#Recursos+adicionales">Recursos adicionales</a>
<ul class="minitoc">
<li>
<a href="#Bibliograf%C3%ADa">Bibliograf&iacute;a</a>
</li>
<li>
<a href="#Enlaces">Enlaces</a>
</li>
</ul>
</li>
</ul>
</div>


<a name="N1000C"></a><a name="Puntos+destacados"></a>
<h2 class="underlined_10">Puntos destacados</h2>
<div class="section">
<ul>

<li>Manejo de las herramientas java, javac, jar</li>

<li>Creaci&oacute;n de proyectos Java en el entorno de desarrollo Eclipse</li>

<li>Configuraci&oacute;n y manejo del entorno Eclipse</li>

<li>Organizaci&oacute;n del directorio de desarrollo</li>

<li>Sintaxis b&aacute;sica del lenguaje Java</li>

<li>Interfaces y herencia</li>

<li>Normas de estilo para el c&oacute;digo fuente Java</li>

<li>Automatizaci&oacute;n de la construcci&oacute;n y despliegue de aplicaciones con Ant</li>

<li>Tratamiento de errores mediante la captura de excepciones</li>

<li>Lanzar excepciones para la gesti&oacute;n de errores</li>

<li>Identificar los casos en los que es necesario la utilizaci&oacute;n de hilos</li>

<li>Creaci&oacute;n de hilos mediante herencia y mediante interfaces. Determinar la forma m&aacute;s adecuada en cada caso</li>

<li>Operaciones b&aacute;sicas y propiedades de los hilos</li>

<li>M&eacute;todos para la sincronizaci&oacute;n de hilos. Identificar los casos en los que es necesario utilizar cada una de ellas</li>

<li>Manejo de las operaciones b&aacute;sicas de los flujos de E/S</li>

<li>Tipos de hilos existentes y funciones de cada uno</li>

<li>Acceso a ficheros mediante hilos de E/S</li>

<li>Acceso a los recursos de una aplicaci&oacute;n</li>

<li>Manejo de los flujos DataInputStream y DataOutputStream</li>

<li>Creaci&oacute;n de proyectos Java en el entorno de desarrollo Eclipse</li>

<li>Mecanismo de serializaci&oacute;n de objetos</li>

<li>Acceder a una URL desde una aplicaci&oacute;n Java</li>

<li>Programaci&oacute;n del protocolo HTTP desde una aplicaci&oacute;n cliente</li>

<li>Visi&oacute;n general de los componentes principales para crear aplicaciones AWT/Swing (botones, men&uacute;s, desplegables, ventanas, etc)</li>

<li>Uso de gestores de disposici&oacute;n (<em>layout managers</em>) para colocar los componentes en aplicaciones gr&aacute;ficas AWT/Swing</li>

<li>Manejo de eventos de diferentes tipos (de acci&oacute;n, de rat&oacute;n, de ventana, etc) en aplicaciones AWT/Swing</li>

<li>Concepto de Applet, programaci&oacute;n y uso de los mismos. Similitudes y diferencias con aplicaciones AWT/Swing <em>standalone</em>
</li>

<li>Tener claro c&oacute;mo se gestiona la seguridad en aplicaciones Java: qu&eacute; elementos intervienen en dicha gesti&oacute;n, y qu&eacute; restricciones se aplican (o se deben aplicar) a los Applets</li>

<li>Uso de opciones avanzadas en el desarrollo de aplicaciones Swing: acciones, bordes, timers, etc</li>

<li>Creaci&oacute;n de casos de prueba en JUnit e identificaci&oacute;n de los m&eacute;todos de prueba a implementar</li>

<li>Prueba de los m&eacute;todos y casos de prueba desde Eclipse</li>

<li>Funcionalidades adicionales en los casos de prueba: m&eacute;todo <span class="codefrag">setUp</span>, pruebas con excepciones, creaci&oacute;n de las clases tras los casos de prueba, etc</li>

<li>Estructuraci&oacute;n de casos de prueba en &aacute;rboles mediante suites de prueba</li>

<li>Uso del depurador de eclipse: establecimiento de breakpoints, ejecuci&oacute;n paso a paso, inspecci&oacute;n de valores de variables</li>

<li>Componentes principales de Log4Java: loggers, appenders y layouts</li>

<li>Inserci&oacute;n de mensajes de log en nuestras aplicaciones Java</li>

<li>Configuraci&oacute;n del logging mediante ficheros de properties y mediante ficheros XML</li>

<li>Uso de commons-logging para encapsular Log4J</li>

</ul>
</div>

<a name="N10090"></a><a name="Certificaci%C3%B3n+Sun"></a>
<h2 class="underlined_10">Certificaci&oacute;n Sun</h2>
<div class="section">
<p>Aunque el resto del curso de Especialista est&aacute; orientado a certificaciones en el &aacute;mbito de J2EE, este m&oacute;dulo de Java y Herramientas de Desarrollo se basa en las certificaciones para Java b&aacute;sico o est&aacute;ndar. Dichas certificaciones son dos:</p>
<ul>

<li>SCJP (<em>Sun Certified Java Programmer</em> - Certificado Sun de Programador Java): <a href="http://www.sun.com/training/certification/java/scjp.xml">http://www.sun.com/training/certification/java/scjp.xml</a>
</li>

<li>SCJP (<em>Sun Certified Java Developper</em> - Certificado Sun de Desarrollador Java): <a href="http://www.sun.com/training/certification/java/scjd.xml">http://www.sun.com/training/certification/java/scjd.xml</a>
</li>

</ul>
<p>Para la primera (<strong>SCJP</strong>), se debe completar un examen. En el caso del certificado para la plataforma Java 1.5, el examen abarca los siguientes apartados generales:</p>
<ul>

<li>
<strong>Secci&oacute;n 1: Declaraciones, inicializaciones y &aacute;mbitos:</strong> eval&uacute;a si el alumno es capaz de escribir c&oacute;digo que declare clases o interfaces, utilice adecuadamente la estructura de paquetes e imports, utilice c&oacute;digo con tipos simples, arrays, objetos est&aacute;ticos, variables locales, constructores, m&eacute;todos est&aacute;ticos y no est&aacute;ticos, sobrecarga de m&eacute;todos, etc</li>

<li>
<strong>Secci&oacute;n 2: Control de flujo:</strong> uso de sentencias <span class="codefrag">if</span>, <span class="codefrag">switch</span>, bucles (<span class="codefrag">for, do, while, break, continue</span>), manejo y uso de excepciones (<span class="codefrag">try-catch-finally</span>), etc</li>

<li>
<strong>Secci&oacute;n 3: Contenidos del API:</strong> uso de wrappers b&aacute;sicos (<span class="codefrag">Integer, Boolean</span>, etc), entrada/salida de ficheros, serializaci&oacute;n de objetos para E/S, formateo de datos con el paquete <span class="codefrag">java.text</span>, y parseo de cadenas mediante expresiones regulares y similares (paquetes <span class="codefrag">java.util</span> y <span class="codefrag">java.util.regex</span>)</li>

<li>
<strong>Secci&oacute;n 4: Concurrencia:</strong> manejo de hilos (mediante <span class="codefrag">Thread</span> y mediante <span class="codefrag">Runnable</span>), estados de los hilos, interbloqueos y sincronizaci&oacute;n</li>

<li>
<strong>Secci&oacute;n 5: Conceptos sobre orientaci&oacute;n a objetos:</strong> desarrollo de c&oacute;digo que cumpla los requerimientos de encapsulamiento, cohesi&oacute;n y acoplamiento entre clases (mucha cohesi&oacute;n, poco acoplamiento). Uso del polimorfismo y del casting. Uso de m&eacute;todos sobrecargados, llamadas a la superclase, etc.</li>

<li>
<strong>Secci&oacute;n 6: Colecciones:</strong> determinar qu&eacute; tipos de colecciones (listas, hashmaps, etc) utilizar en diferentes supuestos. Comparaciones y ordenaciones entre objetos de una colecci&oacute;n, etc</li>

<li>
<strong>Secci&oacute;n 7: Fundamentos:</strong> uso correcto de los modificadores de acceso, declaraciones de paquetes, imports. Seguimiento de trazas. Manejo de referencias a objetos. Uso del recolector de basura... etc</li>

</ul>
<p>Para la segunda (<strong>SCJD</strong>) es necesario haber obtenido antes la primera certificaci&oacute;n (SCJP). Despu&eacute;s, se deben superar dos pruebas: un supuesto de programaci&oacute;n, y un examen.</p>
<p>La primera prueba (el supuesto de programaci&oacute;n), consiste en escribir c&oacute;digo para implementar una supuesta aplicaci&oacute;n para empresa. Se evaluar&aacute;n aspectos como documentaci&oacute;n, dise&ntilde;o orientado a objetos, desarrollo de la interfaz gr&aacute;fica, interbloqueos, etc.</p>
<p>La segunda prueba (el examen), es una explicaci&oacute;n sobre el desarrollo que hayamos hecho en el supuesto de programaci&oacute;n anterior, explicando las decisiones principales que hemos tenido que tomar, ventajas y desventajas de las mismas, y justificaci&oacute;n de dichas decisiones, en funci&oacute;n de los objetivos propuestos para la implementaci&oacute;n.</p>
<p>M&aacute;s informaci&oacute;n sobre las certificaciones en los enlaces respectivos vistos antes.</p>
</div>

<a name="N10108"></a><a name="Recursos+adicionales"></a>
<h2 class="underlined_10">Recursos adicionales</h2>
<div class="section">
<a name="N1010E"></a><a name="Bibliograf%C3%ADa"></a>
<h3 class="underlined_5">Bibliograf&iacute;a</h3>
<ul>

<li>
<strong>Curso de Java</strong>, Ian F. Darwin, <em>Ed. Anaya Multimedia, Colecci&oacute;n O'Reilly</em>
</li>

<li>
<strong>Java 2 v5.0</strong>, Varios autores, <em>Ed. Anaya Multimedia, Colecci&oacute;n Wrox</em>
</li>

<li>
<strong>Piensa en Java</strong>, Bruce Eckel, <em>Ed. Prentice Hall</em>
</li>

<li>
<strong>Core Java 2</strong>, Cay Horstmann y Gary Cornell, <em>Ed. Prentice Hall PTR</em>
</li>

<li>
<strong>Java in a Nutshell</strong>, David Flanagan, <em>Ed. O'Reilly Media</em>
</li>

<li>
<strong>Professional Java Tools for Extreme Programming: Ant, XDoclet, JUnit, Cactus, and Maven</strong>, Richard Hightower, Warner Onstine, Paul Visan, Damon Payne y Joseph D. Gradecki, <em>Ed. Wrox</em>
</li>

<li>
<strong>JUnit in Action</strong>, Ted Husted, Vincent Massol, <em>Ed. Manning Publications</em>
</li>

</ul>
<a name="N10149"></a><a name="Enlaces"></a>
<h3 class="underlined_5">Enlaces</h3>
<ul>

<li>
<a href="http://www.java.sun.com">Web oficial de Java, http://www.java.sun.com</a>
</li>

<li>
<a href="http://www.eclipse.org">Web oficial de Eclipse, http://www.eclipse.org</a>
</li>

<li>
<a href="http://www.junit.org">Web del proyecto JUnit, http://www.junit.org</a>
</li>

<li>
<a href="http://ant.apache.org">Web de Apache Ant, http://ant.apache.org</a>
</li>

</ul>
</div>


<p class="pageBreakAfter"></p>


</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006 Depto. CCIA</div>
</div>
</body>
</html>
