<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Automatizaci&oacute;n con Ant</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Java y Herramientas de Desarrollo" src="images/baner_j2ee_der.gif" title="Java y Herramientas de Desarrollo"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Java y Herramientas de Desarrollo</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 2</div>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html">Sesion 8</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html">Sesion 8</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion02-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Automatizaci&oacute;n con Ant</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Ant+y+Make">Ant y Make</a>
</li>
<li>
<a href="#Estructura+de+un+fichero+build.xml">Estructura de un fichero build.xml</a>
<ul class="minitoc">
<li>
<a href="#Propiedades">Propiedades</a>
</li>
<li>
<a href="#Declaraci%C3%B3n+de+tareas">Declaraci&oacute;n de tareas</a>
</li>
<li>
<a href="#Objetivos">Objetivos</a>
</li>
</ul>
</li>
<li>
<a href="#Definici%C3%B3n+del+classpath">Definici&oacute;n del classpath</a>
<ul class="minitoc">
<li>
<a href="#Elementos+individuales">Elementos individuales</a>
</li>
<li>
<a href="#Conjuntos">Conjuntos</a>
</li>
</ul>
</li>
<li>
<a href="#Tareas+b%C3%A1sicas">Tareas b&aacute;sicas</a>
<ul class="minitoc">
<li>
<a href="#Compilaci%C3%B3n">Compilaci&oacute;n</a>
</li>
<li>
<a href="#Documentaci%C3%B3n">Documentaci&oacute;n</a>
</li>
<li>
<a href="#Empaquetamiento">Empaquetamiento</a>
</li>
<li>
<a href="#Ejecuci%C3%B3n">Ejecuci&oacute;n</a>
</li>
<li>
<a href="#Sistema+de+ficheros">Sistema de ficheros</a>
</li>
<li>
<a href="#Comandos+externos">Comandos externos</a>
</li>
<li>
<a href="#Impresi%C3%B3n+de+texto">Impresi&oacute;n de texto</a>
</li>
</ul>
</li>
<li>
<a href="#Integraci%C3%B3n+con+Eclipse">Integraci&oacute;n con Eclipse</a>
<ul class="minitoc">
<li>
<a href="#Configuraci%C3%B3n">Configuraci&oacute;n</a>
</li>
<li>
<a href="#Ejecuci%C3%B3n+de+tareas">Ejecuci&oacute;n de tareas</a>
</li>
</ul>
</li>
</ul>
</div>
          

<p>Al desarrollar aplicaciones Java medianamente complejas, una vez escrito el 
  c&oacute;digo fuente, para construir la aplicaci&oacute;n normalmente tendremos 
  que utilizar varias herramientas (<span class="codefrag">javac</span>, <span class="codefrag">jar</span>, <span class="codefrag">rmic</span>, 
  <span class="codefrag">java</span>, etc). Adem&aacute;s ser&aacute; conveniente crear una estructura 
  de directorios donde tengamos por separado los ficheros fuente, las clases compiladas, 
  las librer&iacute;as y cualquier otro tipo de recursos, como por ejemplo el 
  siguiente:</p>
  

<pre class="code">bin
src
lib
resources</pre>


<p>Esto nos obligar&aacute;, cada vez que queramos construir la aplicaci&oacute;n 
  para probarla, a compilar las clases en el directorio adecuado, estableciendo 
  la variable <span class="codefrag">CLASSPATH</span> para que incluya las librer&iacute;as necesarias 
  para compilar, copiar todos los recursos al directorio donde se haya construido 
  la aplicaci&oacute;n, realizar alg&uacute;n procesamiento adicional a los ficheros 
  de c&oacute;digo en caso de que sea necesario, empaquetar la aplicaci&oacute;n 
  y cualquier otra tarea que pueda ser necesaria.</p>

<p>Para facilitar la tarea de desarrollo de aplicaciones, podemos utilizar la 
  herramienta <em>Ant</em> para automatizar todo este proceso.</p>


<a name="N1002B"></a><a name="Ant+y+Make"></a>
<h2 class="underlined_10">Ant y Make</h2>
<div class="section">
<p>
<em>Ant</em> es una herramienta basada en Java, similar a la herramienta <em>make</em>, 
  pero m&aacute;s adecuada para el desarrollo de aplicaciones Java. <em>Make</em> 
  tiene el inconveniente de ser dependiente del <em>shell</em> que utilicemos, 
  ya que ejecuta comandos de &eacute;ste, lo cual complicar&iacute;a la portabilidad 
  de nuestras aplicaciones a distintas plataformas. Uno de los objetivos que se 
  han buscado desde el principio con las tecnolog&iacute;as Java es la independencia 
  de la plataforma, por lo que ser&aacute; conveniente contar con un sistema de 
  construcci&oacute;n de aplicaciones que cumpla este objetivo para que la portabilidad 
  no se vea da&ntilde;ada.</p>
<p>
<em>Ant</em> utiliza ficheros de configuraci&oacute;n basados en XML, donde 
  definiremos las tareas a realizar. Para realizar estas tareas se utilizar&aacute;n 
  clases Java, en lugar de comandos del <em>shell</em>, lo cual lo har&aacute; 
  independiente de la plataforma. Podremos realizar un gran n&uacute;mero de diferentes 
  tareas con esta herramienta, de las que veremos las principales, y adem&aacute;s 
  es extensible, permiti&eacute;ndonos a&ntilde;adir nuestras propias tareas que 
  podremos implementar utilizando clases Java.</p>
<p>Estas tareas son las acciones que se ejecutar&aacute;n desde dentro del fichero 
  de configuraci&oacute;n, y se definen en &eacute;l como etiquetas en XML:</p>
<pre class="code">&lt;<strong>mkdir</strong> dir="bin"/&gt;
&lt;<strong>javac</strong> srcdir="src" destdir="bin"/&gt;</pre>
<p>De esta forma, en este ejemplo estaremos creando un directorio <span class="codefrag">bin</span> 
  y a continuaci&oacute;n estamos compilando todos los fuentes que tengamos en 
  <span class="codefrag">src</span> guardando las clases compiladas en <span class="codefrag">bin</span>. Al definir 
  estas acciones con este formato est&aacute;ndar, ser&aacute;n independientes 
  de la plataforma.</p>
<p>El fichero de configuraci&oacute;n, llamado <span class="codefrag">build.xml</span>, es bastante 
  m&aacute;s complejo que un <span class="codefrag">Makefile</span>, pero podremos parametrizarlo, 
  permiti&eacute;ndonos reutilizar una misma plantilla gen&eacute;rica para distintas 
  aplicaciones. Adem&aacute;s, este fichero <span class="codefrag">build.xml</span> al utilizar 
  una gram&aacute;tica de m&aacute;s alto nivel no tendr&aacute; el inconveniente 
  de los tabuladores que encontramos en los <span class="codefrag">Makefile</span> (si en lugar 
  de tabuladores usamos espacios no funcionan correctamente).</p>
<p>Para ejecutar este fichero <span class="codefrag">build.xml</span> deberemos ejecutar <span class="codefrag">ant</span> 
  desde el directorio donde se encuentre este fichero</p>
<pre class="code">ant [objetivo]</pre>
<p>Para que funcione correctamente deberemos establecer las variables de entorno 
  <span class="codefrag">ANT_HOME</span> y <span class="codefrag">JAVA_HOME</span> apuntando a los directorios donde 
  tengamos instalado <em>Ant</em> y Java 2 SDK respectivamente. Adem&aacute;s 
  para poder ejecutar el comando <span class="codefrag">ant</span> la variable <span class="codefrag">PATH</span> 
  deber&aacute; apuntar al directorio de binarios de <em>Ant</em>:</p>
<pre class="code">
<strong>PATH</strong>=${PATH}:${JAVA_HOME}/bin:<strong>${ANT_HOME}/bin</strong>
</pre>
<p>A continuaci&oacute;n veremos c&oacute;mo crear estos ficheros de configuraci&oacute;n 
  <span class="codefrag">build.xml</span> para trabajar con la herramienta <em>Ant</em>.</p>
</div>

<a name="N100A3"></a><a name="Estructura+de+un+fichero+build.xml"></a>
<h2 class="underlined_10">Estructura de un fichero build.xml</h2>
<div class="section">
<p>El elemento principal de un fichero <span class="codefrag">build.xml</span> es la etiqueta <span class="codefrag">project</span> 
  que engloba todo el proyecto. Todo el contenido del fichero se encontrar&aacute; 
  dentro de esta etiqueta:</p>
<pre class="code">&lt;<strong>project</strong> name="MiProyecto" default="run" basedir="."&gt;
  &lt;description&gt;
    Ejemplo de fichero build.xml
  &lt;/description&gt;

  &lt;!-- Propiedades --&gt;
  ...

  &lt;!-- Declaraci&oacute;n de tareas --&gt;
  ...

  &lt;!-- Objetivos --&gt;
  ...

&lt;/<strong>project</strong>&gt;</pre>
<p>Dentro del proyecto encontramos los siguientes elementos:</p>
<ul>
  
<li>
<strong>Propiedades</strong>: Nos permiten parametrizar el fichero <em>build.xml</em>. 
    Podemos asignar valor a una serie de propiedades (atributos) que luego podremos 
    utilizar dentro de este fichero.
  </li>
  
<li>
<strong>Declaraci&oacute;n de tareas</strong>: Si queremos utilizar tareas 
    adicionales, que no son propias de <em>Ant</em>, deberemos declararlas.
  </li>
  
<li>
<strong>Objetivos</strong>: Podemos definir una serie de objetivos (<em>targets</em>) 
    para construir la aplicaci&oacute;n, al igual que hac&iacute;amos en el <span class="codefrag">Makefile</span>. 
    Para cada objetivo se definir&aacute;n las tareas que se ejecutar&aacute;n 
    para cumplirlo, pudiendo establecer una dependencia entre los diferentes objetivos 
    definidos.</li>

</ul>
<p>En la etiqueta <span class="codefrag">project</span> indicaremos el nombre del proyecto al que 
  corresponde este fichero <span class="codefrag">build.xml</span>, y adem&aacute;s podremos establecer 
  cu&aacute;l ser&aacute; el objetivo a cumplir por defecto, si en la l&iacute;nea 
  de comandos no se ha especificado ninguno.</p>
<a name="N100E6"></a><a name="Propiedades"></a>
<h3 class="underlined_5">Propiedades</h3>
<p>Podemos definir una serie de propiedades para parametrizar estos ficheros de 
  configuraci&oacute;n de <em>Ant</em>. Estas propiedades son parejas <em>&lt;nombre, 
  valor&gt;</em> donde normalmente el nombre se compone de una serie de palabras 
  separadas por puntos y pueden tomar cualquier cadena como valor. </p>
<p>Podemos definir todas las propiedades que queramos, defini&eacute;ndolas con 
  nombres de este tipo, y asignarles un valor a cada una. Por ejemplo, podr&iacute;amos 
  definir una propiedad de nombre <span class="codefrag">bin.home</span> que contenga el nombre 
  del directorio donde se guardar&aacute; la aplicaci&oacute;n compilada:</p>
<pre class="code">
<strong>bin.home</strong>=bin</pre>
<p>Posteriormente, podremos utilizar esta propiedad dentro del c&oacute;digo de 
  <strong>Ant</strong>. Para acceder al valor de la propiedad pondremos el nombre 
  de &eacute;sta entre llaves precedido por el signo '<span class="codefrag">$</span>', de la forma 
  <span class="codefrag">${nombre.propiedad}</span>. Por ejemplo, cuando necesitemos crear el directorio 
  para guardar la aplicaci&oacute;n haremos:</p>
<pre class="code">&lt;mkdir dir="<strong>${bin.home}</strong>"/&gt;</pre>
<p>De esta forma siempre que necesitemos especificar este directorio donde se 
  va a construir la aplicaci&oacute;n, en lugar de especificar directamente el 
  nombre del directorio podemos utilizar la propiedad. De esta forma si queremos 
  cambiar esto m&aacute;s adelante, ser&aacute; suficiente con modificar el valor 
  de la propiedad, sin tener que ir cambiando este valor en cada lugar del fichero 
  de configuraci&oacute;n que aparezca.</p>
<p>Tenemos varias opciones para definir las propiedades y sus valores:</p>
<ul>
  
<li>
<strong>En el fichero <span class="codefrag">build.xml</span></strong>. Al comienzo del fichero 
    <span class="codefrag">build.xml</span>, dentro del bloque <span class="codefrag">project</span>, podemos definir 
    estas propiedades de la siguiente forma: 
  
<pre class="code">&lt;<strong>property</strong> name="bin.home" value="bin"&gt;</pre>
  
</li>
  
<li>
<strong>En un fichero independiente</strong>. Tambi&eacute;n podemos definir 
    las propiedades en un fichero de propiedades, sin mezclarlas con el contenido 
    del fichero <span class="codefrag">build.xml</span>, de forma que si alguien quiere cambiarlas 
    no tenga que editar el c&oacute;digo del <span class="codefrag">build.xml</span>. El fichero 
    de propiedades definir&aacute; en cada l&iacute;nea una propiedad, asign&aacute;ndole 
    su valor mediante el s&iacute;mbolo '<span class="codefrag">=</span>'. Por ejemplo, podemos 
    llamar a este fichero <span class="codefrag">build.properties</span>, y en &eacute;l podemos 
    tener el siguiente contenido: 
    
<pre class="code">bin.home=bin</pre>

  
</li>

</ul>
<p>Para que las propiedades aqu&iacute; definidas puedan ser utilizadas dentro 
    del fichero <span class="codefrag">build.xml</span>, deberemos importar el fichero de propiedades 
    desde este fichero. Esto lo haremos mediante la siguiente etiqueta de definici&oacute;n 
    de propiedades:</p>
<pre class="code"> &lt;property <strong>file</strong>="build.properties"/&gt;</pre>
<ul>
  
<li>
<strong>En la l&iacute;nea de comando</strong>. Tambi&eacute;n podremos 
    establecer estas propiedades directamente desde la l&iacute;nea de comando 
    al invocar <span class="codefrag">ant</span>. Esto lo haremos mediante el par&aacute;metro 
    <span class="codefrag">-D</span>, con el que especificaremos nombre de la propiedad y valor: 
    
<pre class="code">ant <strong>-Dbin.home=bin</strong>
</pre>

    
<p>Si especificamos una propiedad en l&iacute;nea de comando, este valor tendr&aacute; 
      preferencia sobre el valor que se haya definido dentro del fichero <span class="codefrag">build.xml</span>, 
      si se ha definido alguno.</p>
  
</li>

</ul>
<a name="N1016E"></a><a name="Declaraci%C3%B3n+de+tareas"></a>
<h3 class="underlined_5">Declaraci&oacute;n de tareas</h3>
<p>
<em>Ant</em> soporta un amplio conjunto de tareas predefinidas, que normalmente 
  nos permitir&aacute;n realizar todos los pasos necesarios para construir nuestra 
  aplicaci&oacute;n: compilar, copiar ficheros, empaquetar, ejecutar, etc. </p>
<p>Sin embargo, puede que necesitemos realizar alguna funci&oacute;n que no venga 
  implementada como tarea de <em>Ant</em>. Esto no ser&aacute; una limitaci&oacute;n, 
  ya que podremos a&ntilde;adir tareas adicionales que nos permitan realizar estas 
  funciones. Estas tareas se implementar&aacute;n en clases Java, que podremos 
  desarrollar nosotros mismos, o bien obtener librer&iacute;as de tareas proporcionadas 
  por terceros.</p>
<p>Estas librer&iacute;as de tareas consistir&aacute;n normalmente en un fichero 
  JAR que contenga todas las clases que implementan estas tareas que vamos a a&ntilde;adir. 
  Para que <em>Ant</em> pueda localizar estas clases deberemos incluir esta librer&iacute;a 
  en el <span class="codefrag">CLASSPATH</span> o bien copiarla al directorio <span class="codefrag">${ANT_HOME}/lib</span>. 
</p>
<p>Una vez tenemos la librer&iacute;a de tareas localizable, para poder usarlas 
  deberemos declararlas, indicando cu&aacute;l es la clase principal que implementa 
  cada tarea, y asign&aacute;ndole un nombre de dicha tarea. Declararemos estas 
  tareas dentro del fichero <span class="codefrag">build.xml</span> donde vayamos a usarlas de 
  la siguiente forma:</p>
<pre class="code"> &lt;<strong>taskdef</strong> <strong>name</strong>="mitarea"<strong>classname</strong>=
    "es.ua.j2ee.tareas.MiTarea"/&gt;</pre>
<p>Posteriormente, en el fichero <span class="codefrag">build.xml </span>podremos ejecutar esta 
  tarea como cualquier otra tarea definida en <em>Ant</em>:</p>
<pre class="code">&lt;<strong>mitarea</strong> <em>&lt;atributos&gt;</em>/&gt;</pre>
<a name="N101B2"></a><a name="Objetivos"></a>
<h3 class="underlined_5">Objetivos</h3>
<p>En el fichero <span class="codefrag">build.xml</span> podremos definir una serie de objetivos, 
  y dentro de cada uno especificar las tareas que se deben realizar para cumplir 
  dicho objetivo. Podremos definir tantos objetivos como queramos, y establecer 
  dependencias entre ellos. Por ejemplo podemos crear dos objetivos: <span class="codefrag">compile</span> 
  para compilar la aplicaci&oacute;n, y <span class="codefrag">run</span> para ejecutarla. Dado 
  que para poder ejecutarla es necesario haberla compilado previamente, podemos 
  establecer que el objetivo <span class="codefrag">run</span> depende de <span class="codefrag">compile</span>.</p>
<p>Estos objetivos se especifican dentro de una etiqueta <span class="codefrag">target</span>, 
  que podr&aacute; contener como elementos internos tantas tareas como sea necesario. 
  Por ejemplo, podemos definir el objetivo de compilaci&oacute;n de la siguiente 
  forma:</p>
<pre class="code">&lt;<strong>target</strong> name="compile"&gt;
  &lt;mkdir dir="${bin.home}"&gt;
  &lt;javac srcdir="${src.home}"
    destdir="${bin.home}"&gt;
  &lt;/javac&gt;
&lt;/<strong>target</strong>&gt;</pre>
<p>Con esta tarea estaremos creando el directorio destino, y compilando las clases 
  del directorio de fuentes en este directorio destino. </p>
<p>Podemos definir un objetivo <span class="codefrag">run</span> que dependa de este objetivo anterior 
  de la siguiente forma:</p>
<pre class="code">&lt;<strong>target</strong> name="run" <strong>depends</strong>="compile&gt;
  &lt;java classname="es.ua.j2ee.prueba.Principal"/&gt;
  &lt;/<strong>target</strong>&gt;</pre>
<p>Cuando ejecutemos este objetivo primero se llamar&aacute; al objetivo <span class="codefrag">compile</span> 
  para que realice todas las tareas necesarias para compilar la aplicaci&oacute;n, 
  y una vez hecho esto se ejecutar&aacute; la clase principal de la aplicaci&oacute;n.</p>
<p>Podemos ver un ejemplo completo de fichero <span class="codefrag">build.xml</span> a continuaci&oacute;n:</p>
<pre class="code">&lt;<strong>project</strong> name="MiProyecto" default="run" basedir="."&gt;
  &lt;<strong>description</strong>&gt;
    Ejemplo de fichero build.xml
  &lt;/<strong>description</strong>&gt;

  &lt;!-- Propiedades --&gt;
  &lt;<strong>property</strong> name="src.home" value="src"/&gt;
  &lt;<strong>property</strong> name="bin.home" value="bin"/&gt;

  &lt;!-- Declaraci&oacute;n de tareas --&gt;
  &lt;<strong>taskdef</strong> name="mitarea" classname="es.ua.j2ee.tareas.MiTarea"/&gt;

  &lt;!-- Objetivos --&gt;
  &lt;<strong>target</strong> name="compile"&gt;
    &lt;mkdir dir="${bin.home}"/&gt;
    &lt;javac srcdir="${src.home}"
      destdir="${bin.home}"&gt;
    &lt;/javac&gt;
  &lt;/<strong>target</strong>&gt;

  &lt;<strong>target</strong> name="run" depends="compile"&gt;
    &lt;java classname="es.ua.j2ee.prueba.Principal"
          classpath="${bin.home}"/&gt;
  &lt;/<strong>target</strong>&gt;

  &lt;<strong>target</strong> name="clean"&gt;
    &lt;delete dir="${bin.home}"/&gt;
  &lt;/<strong>target</strong>&gt;

&lt;/<strong>project</strong>&gt;</pre>
<p>En este proyecto el objetivo por defecto es <span class="codefrag">run</span>, por lo que si 
  en la l&iacute;nea de comando escribimos <span class="codefrag">ant</span> sin proporcionar ning&uacute;n 
  par&aacute;metro este ser&aacute; el objetivo que se ejecutar&aacute;, para 
  lo cu&aacute;l antes deber&aacute; ejecutar antes <span class="codefrag">compile</span> ya que 
  depende de &eacute;l.</p>
<p>Si escribimos <span class="codefrag">ant compile</span>, ejecutar&aacute; s&oacute;lo el objetivo 
  de compilaci&oacute;n. </p>
</div>

<a name="N1023B"></a><a name="Definici%C3%B3n+del+classpath"></a>
<h2 class="underlined_10">Definici&oacute;n del classpath</h2>
<div class="section">
<p>Para tareas como la compilaci&oacute;n y la ejecuci&oacute;n de clases Java 
  deberemos establecer el <em>classpath</em> que vamos a utilizar. Cuando desarrollamos 
  aplicaciones J2EE es muchas ocasiones necesitaremos establecer un <em>classpath</em> 
  bastante complejo, en el que se incluyan un gran n&uacute;mero de librer&iacute;as 
  (JAR) distribuidas a lo largo de una serie de directorios. </p>
<p>
<em>Ant</em> nos facilitar&aacute; la tarea de establecimiento del <em>classpath</em>, 
  ya que no ser&aacute; necesario incluir las diferentes librer&iacute;as una 
  a una, sino que podremos incluir en una misma etiqueta un gran conjunto de librer&iacute;as.</p>
<p>Podremos crear un <em>classpath</em> global, que pueda ser reutilizado por 
  diferentes tareas. Este elemento se encontrar&aacute; al mismo nivel que los 
  objetivos en el fichero <span class="codefrag">build.xml</span>, y de esta forma podremos hacer 
  referencia a &eacute;l desde distintas tareas que tengamos dentro de diferentes 
  objetivos. </p>
<p>Definiremos esta estructura de <em>classpath</em> con una etiqueta <span class="codefrag">path</span>, 
  a la que deberemos proporcionar un identificador de forma que podamos referenciarla 
  desde diferentes tareas para utilizar este <em>classpath</em> desde ellas.</p>
<pre class="code">&lt;<strong>path</strong> id="path.compilacion"&gt;
  &lt;!-- Elementos del path --&gt;
  ...
  &lt;/<strong>path</strong>&gt;</pre>
<p>Dentro de esta etiqueta deberemos indicar qu&eacute; elementos van a formar 
  parte de este <em>classpath</em>. Podemos a&ntilde;adir elementos individualmente, 
  especificando uno a uno los nombres de los directorios y ficheros a incluir 
  en el <em>path</em>, o bien incluir conjuntos de ficheros o directorios.</p>
<a name="N1027A"></a><a name="Elementos+individuales"></a>
<h3 class="underlined_5">Elementos individuales</h3>
<p>Podemos definir elementos del <em>path</em> individuales mediante etiquetas 
  <span class="codefrag">pathelement</span>. Como atributo <span class="codefrag">location</span> de esta etiqueta 
  indicaremos el directorio o fichero JAR que queremos incluir en el <em>path</em>:</p>
<pre class="code">&lt;path id="path.compilacion"&gt;
  &lt;<strong>pathelement</strong> location="classes"/&gt;
  &lt;<strong>pathelement</strong> location="lib/libreria.jar"/&gt;
&lt;/path&gt;</pre>
<p>Mediante esta etiqueta tambi&eacute;n podemos especificar una lista de elementos 
  del <em>path</em> en un mismo atributo, especificados como si se tratase del 
  valor de la variable de entorno <span class="codefrag">CLASSPATH</span>.</p>
<pre class="code">&lt;path id="path.compilacion"&gt;
  &lt;<strong>pathelement</strong> path="/usr/aplic/classes;/usr/aplic/lib/libreria.jar"/&gt;
&lt;/path&gt;</pre>
<p>Para separar los distintos elementos del <em>path</em> dentro de este atributo 
  podremos utilizar tanto el car&aacute;cter '<span class="codefrag">:</span>' como '<span class="codefrag">;</span>', 
  <em>Ant</em> se encargar&aacute; de adaptarlo a la plataforma sobre la que se 
  est&eacute; ejecutando.</p>
<p>Ser&aacute; recomendable a&ntilde;adir cada elemento del <em>path</em> en una 
  etiqueta distinta utilizando el atributo <span class="codefrag">location</span> como hemos visto 
  en el primer caso. La segunda forma podremos utilizarla por ejemplo si queremos 
  importar la variable de entorno <span class="codefrag">CLASSPATH</span> desde <em>Ant</em>:</p>
<pre class="code">&lt;path id="path.compilacion"&gt;
  &lt;<strong>pathelement</strong> path="${classpath}"/&gt;
&lt;/path&gt;</pre>
<a name="N102CF"></a><a name="Conjuntos"></a>
<h3 class="underlined_5">Conjuntos</h3>
<p>Muchas veces deberemos incluir en el <em>classpath</em> un gran conjunto de 
  librer&iacute;as (ficheros JAR) que se encuentran bajo un mismo directorio. 
  A&ntilde;adir una a una estas librer&iacute;as, adem&aacute;s de ser una tarea 
  tediosa, podr&aacute; producir que se nos olvide incluir alg&uacute;n elemento.</p>
<p> Para facilitar esta tarea <em>Ant</em> nos permitir&aacute; incluir todo un 
  conjunto de ficheros en el <em>classpath</em> mediante una &uacute;nica etiqueta. 
  Esto lo haremos con la etiqueta <span class="codefrag">fileset</span>:</p>
<pre class="code">&lt;path id="path.compilacion"&gt;
  &lt;<strong>fileset</strong> dir="lib"&gt;
    &lt;include name="**/*.jar"/&gt;
  &lt;/<strong>fileset</strong>&gt;
&lt;/path&gt;</pre>
<p>Con esto estaremos indicando que se incluyan todos los ficheros JAR dentro 
  del directorio <span class="codefrag">lib</span> y subdirectorios.</p>
<p>En el atributo <span class="codefrag">dir</span> estamos indicado el directorio bajo el cual 
  est&aacute;n los ficheros a a&ntilde;adir. Podemos a&ntilde;adir varios elementos 
  <span class="codefrag">include</span>, especificando en ellos los patrones de los ficheros que 
  queramos incluir dentro de este directorio indicado en <span class="codefrag">dir</span>. De 
  la misma forma podemos especificar una serie de elementos <span class="codefrag">exclude</span> 
  que indiquen los ficheros que queramos excluir. </p>
<p>Por ejemplo, si queremos a&ntilde;adir todas las librer&iacute;as JAR y ZIP 
  que se encuentran bajo el directorio <span class="codefrag">lib</span>, pero no queremos incluir 
  aquellas librer&iacute;as de <em>debug</em>, podemos utilizar el siguiente conjunto 
  de ficheros:</p>
<pre class="code">&lt;path id="path.compilacion"&gt;
  &lt;<strong>fileset</strong> dir="lib"&gt;
    &lt;include name="**/*.jar"/&gt;
    &lt;include name="**/*.zip"/&gt;
    &lt;exclude name="**/*debug*"/&gt;
  &lt;/<strong>fileset</strong>&gt;
&lt;/path&gt;</pre>
<p>Tambi&eacute;n podemos incluir conjuntos de directorios, en el caso en que 
  en lugar de una serie de librer&iacute;as JAR queramos incluir varios directorios 
  donde tenemos clases compiladas sin empaquetar. Por ejemplo, si sabemos que 
  dentro de nuestra estructura de directorios tenemos varios directorios con clases 
  compiladas, y todos estos directorios tienen el nombre <span class="codefrag">classes</span>, 
  podremos incluirlos todos con la etiqueta <span class="codefrag">dirset</span>:</p>
<pre class="code">&lt;path id="path.compilacion"&gt;
  &lt;<strong>dirset</strong> dir="${tomcat.home}"&gt;
    &lt;include name="**/classes"/&gt;
  &lt;/<strong>dirset</strong>&gt;
&lt;/path&gt;</pre>
<p>De esta forma se incluir&aacute;n en el <em>classpath</em> todos los directorios 
  <span class="codefrag">classes</span> que se encuentren dentro del directorio del Tomcat. Por 
  ejemplo, si tenemos los directorios <span class="codefrag">server/classes</span>, <span class="codefrag">common/classes</span> 
  y <span class="codefrag">shared/classes</span>, todos ellos ser&aacute;n incluidos en el <em>classpath</em>.</p>
<p>Normalmente combinaremos varios de los elementos vistos anteriormente para 
  establecer el <em>classpath</em>. Si nuestra aplicaci&oacute;n tiene un directorio 
  <span class="codefrag">lib</span> con todas las librer&iacute;as necesarias, y un directorio 
  <span class="codefrag">classes</span> con las clases compiladas, podremos establecer el <em>classpath</em> 
  necesario para ejecutarla con:</p>
<pre class="code">&lt;path id="path.compilacion"&gt;
  &lt;<strong>pathelement</strong> location="classes"/&gt;
  &lt;<strong>fileset</strong> dir="lib"&gt;
    &lt;include name="**/*.jar"/&gt;
  &lt;/<strong>fileset</strong>&gt;
&lt;/path&gt;</pre>
<p>De esta forma hemos visto c&oacute;mo se pueden construir estructuras de <em>path</em> 
  en <em>Ant</em>. Este tipo de estructuras se utilizar&aacute; en un gran n&uacute;mero 
  de elementos como por ejemplo los distintos tipos de <em>classpath</em> que 
  se utilizar&aacute;n para compilar y para ejecutar nuestras aplicaciones. Todos 
  estos elementos se definir&aacute;n de la forma que hemos visto en este apartado. 
</p>
</div>

<a name="N1036B"></a><a name="Tareas+b%C3%A1sicas"></a>
<h2 class="underlined_10">Tareas b&aacute;sicas</h2>
<div class="section">
<p>Vamos a ver ahora las tareas b&aacute;sicas que tenemos disponibles en <em>Ant</em>. 
  El n&uacute;mero de tareas incluidas en el n&uacute;cleo de <em>Ant</em> es 
  muy extenso, pero nos centraremos en las principales.</p>
<a name="N1037A"></a><a name="Compilaci%C3%B3n"></a>
<h3 class="underlined_5">Compilaci&oacute;n</h3>
<p>Una tarea fundamental en el construcci&oacute;n de la aplicaci&oacute;n es 
  la compilaci&oacute;n de los fuentes. Para compilar desde <em>Ant</em> utilizaremos 
  la tarea <span class="codefrag">javac</span>, que podr&aacute; utilizar de forma interna distintos 
  compiladores, entre ellos JDK.</p>
<p>En esta tarea especificaremos como atributos <span class="codefrag">srcdir</span> y <span class="codefrag">destdir</span> 
  los directorios de donde cogeremos los fuentes y donde generaremos las clases 
  compiladas respectivamente. Podemos invocar esta tarea de forma sencilla de 
  la siguiente forma:</p>
<pre class="code">&lt;<strong>javac</strong> srcdir="${src.home}" 
       destdir="${bin.home}"&gt;
&lt;/<strong>javac</strong>&gt;</pre>
<p>Es posible que nuestros fuentes est&eacute;n utilizando alguna librer&iacute;a 
  externa, por lo que deberemos incluir estas librer&iacute;as en el <em>classpath</em> 
  al compilar. Para especificar el <em>classpath</em> utilizaremos la etiqueta 
  interna <span class="codefrag">classpath</span>:</p>
<pre class="code">&lt;javac srcdir="${src.home}" destdir="${bin.home}"&gt;
  &lt;<strong>classpath</strong>&gt;
    &lt;fileset dir="lib"&gt;
      &lt;include name="**/*.jar"/&gt;
    &lt;/fileset&gt;
  &lt;/<strong>classpath</strong>&gt;
&lt;/javac&gt;</pre>
<p>De esta forma especificamos el <em>classpath</em> internamente en la tarea 
  <span class="codefrag">javac</span>. Puede resultar m&aacute;s conveniente utilizar un <em>classpath</em> 
  definido externamente, como hemos visto anteriormente, para poder de esta forma 
  reutilizarlo en diferentes tareas. Para ello haremos referencia a su identificador 
  de la siguiente forma:</p>
<pre class="code">&lt;javac srcdir="${src.home}" destdir="${bin.home}"&gt;
  &lt;<strong>classpath</strong> refid="path.compilacion"/&gt;
&lt;/javac&gt;</pre>
<p>Vimos que Java realiza la b&uacute;squeda de clases en tres niveles. Empieza 
  buscando entre las clases del n&uacute;cleo de Java, conocidas como <em>bootstrap 
  classes</em>, continua con el directorio de extensiones instaladas, y finaliza 
  buscando en el <em>classpath</em>. Podemos establecer la localizaci&oacute;n 
  de estos tres elementos al compilar desde <em>Ant</em>. Todos ellos se definir&aacute;n 
  como estructuras de <em>path</em> donde tendremos los directorios y ficheros 
  correspondientes a cada uno, de la misma forma que en el caso del <em>classpath</em> 
  que acabamos de ver.</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
  
<tr>
<th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th>
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">bootclasspath</span></td>
    <td colspan="3" rowspan="1">Ruta de las clases del n&uacute;cleo de Java</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">extdirs</span></td>
    <td colspan="3" rowspan="1">Ruta de los directorios de extensiones</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">classpath</span></td>
    <td colspan="3" rowspan="1">Ruta del <em>classpath</em></td>
  
</tr>

</table>
<p>Podremos definir todos estos elementos como etiquetas internas a <span class="codefrag">javac</span>, 
  igual que hac&iacute;amos en el caso del <em>classpath</em>.</p>
<pre class="code">&lt;javac srcdir="${src.home}" destdir="${bin.home}"&gt;
  &lt;<strong>classpath</strong> refid="path.compilacion"/&gt;
  &lt;<strong>extdirs</strong> refid="directorios.ext"/&gt;
  &lt;<strong>bootclasspath</strong> refid="path.nucleo"/&gt;
&lt;/javac&gt;</pre>
<p>Podemos especificar con m&aacute;s detalle los fuentes que queremos compilar. 
  La tarea <span class="codefrag">javac</span> se comporta impl&iacute;citamente como un elemento 
  <span class="codefrag">fileset</span>, de forma que podremos definir mediante las etiquetas <span class="codefrag">include</span> 
  y <span class="codefrag">exclude</span> los ficheros fuente dentro del directorio <span class="codefrag">srcdir</span> 
  que queremos incluir o excluir respectivamente.</p>
<pre class="code">&lt;javac srcdir="${src.home}" destdir="${bin.home}"&gt;
  &lt;<strong>include</strong> name="es/ua/j2ee/aplic1/**"/&gt;
  &lt;<strong>include</strong> name="es/ua/j2ee/aplic2/**"/&gt;
  &lt;<strong>exclude</strong> name="es/ua/j2ee/aplic1/prueba/**"/&gt;
  &lt;classpath refid="path.compilacion"/&gt;
&lt;/javac&gt;</pre>
<p>De esta forma estaremos incluyendo todos los fuentes de los paquetes <span class="codefrag">es.ua.j2ee.aplic1</span> 
  y <span class="codefrag">es.ua.j2ee.aplic2</span>, excepto aquellos que est&eacute;n en <span class="codefrag">es.ua.j2ee.aplic1.prueba</span>. 
  Puede que queramos tomar los fuentes de dos directorios distintos. Esto podremos 
  hacerlo especificando varios elementos <span class="codefrag">src</span>:</p>
<pre class="code">&lt;javac destdir="${bin.home}"&gt;
  &lt;<strong>src</strong> path="${src}"/&gt;
  &lt;<strong>src</strong> path="${src2}"/&gt;
  &lt;classpath refid="path.compilacion"/&gt;
&lt;/javac&gt;</pre>
<p>NOTA: Cada directorio de fuentes debe contener una estructura de directorios 
  correspondiente a la estructura de paquetes de las clases que contiene.</p>
<p>Esta tarea adem&aacute;s puede tomar una serie de atributos que indiquen la 
  forma en la que se va a compilar el c&oacute;digo, como vemos en el siguiente 
  ejemplo:</p>
<pre class="code">&lt;javac srcdir="${src.home}" 
       destdir="${bin.home}"
       <strong>debug</strong>="off"
       <strong>optimize</strong>="on"
       <strong>deprecation</strong>="off"&gt;
   &lt;classpath refid="path.compilacion"/&gt;
&lt;/javac&gt;</pre>
<p>Algunos de estos atributos son:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
  
<tr>
<th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th>
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">debug</span></td>
    <td colspan="4" rowspan="1">Genera informaci&oacute;n para la depuraci&oacute;n del c&oacute;digo 
      (<span class="codefrag">on</span> &oacute; <span class="codefrag">off</span>)</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">optimize</span></td>
    <td colspan="4" rowspan="1">Genera c&oacute;digo optimizado (<span class="codefrag">on</span> &oacute; <span class="codefrag">off</span>)</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">deprecation</span></td>
    <td colspan="4" rowspan="1">Muestra errores si se utiliza c&oacute;digo desaprobado (<span class="codefrag">on</span> 
      &oacute; <span class="codefrag">off</span>)</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">nowarn</span></td>
    <td colspan="4" rowspan="1">No muestra advertencias (<span class="codefrag">on</span> &oacute; <span class="codefrag">off</span>)</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">target</span></td>
    <td colspan="4" rowspan="1">M&aacute;quina virtual para la cu&aacute;l se compila (<span class="codefrag">1.1</span>, 
      <span class="codefrag">1.2</span>, etc)</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">fork</span></td>
    <td colspan="4" rowspan="1">Compilar utilizando un compilador externo (<span class="codefrag">yes</span> &oacute; <span class="codefrag">no</span>)</td>
  
</tr>

</table>
<a name="N10505"></a><a name="Documentaci%C3%B3n"></a>
<h3 class="underlined_5">Documentaci&oacute;n</h3>
<p>Podemos utilizar tareas <em>Ant</em> para generar la documentaci&oacute;n de 
  nuestra aplicaci&oacute;n en formato Javadoc. Utilizaremos la tarea <span class="codefrag">javadoc</span> 
  de la siguiente forma: </p>
<pre class="code">&lt;<strong>javadoc</strong> sourcepath="${src.home}"
         destdir="${docs.home}"
         packagenames="*"&gt;
  &lt;classpath refid="path.compilacion"/&gt;
&lt;/<strong>javadoc</strong>&gt;</pre>
<p>En ella especificamos el directorio donde tenemos los fuentes de donde se extraer&aacute; 
  la informaci&oacute;n (<span class="codefrag">sourcepath</span>) y el directorio donde guardaremos 
  los documentos generados (<span class="codefrag">destdir</span>). Adem&aacute;s especificamos 
  los paquetes de los cuales se quiere generar documentaci&oacute;n (con <span class="codefrag"> 
  *</span> indicamos todos los paquetes). Definiremos el <em>classpath</em> de 
  la misma forma en que lo hemos definido para la tarea de compilaci&oacute;n.</p>
<a name="N1052E"></a><a name="Empaquetamiento"></a>
<h3 class="underlined_5">Empaquetamiento</h3>
<p>Para distribuir la aplicaci&oacute;n normalmente la empaquetaremos en un fichero 
  JAR. Este paso lo podremos hacer desde <em>Ant</em> con la tarea <span class="codefrag">jar</span>. 
</p>
<pre class="code">&lt;<strong>jar</strong> destfile="${dist.home}/aplic.jar"
     basedir="${bin.home}"/&gt;</pre>
<p>En <span class="codefrag">basedir</span> especificamos el directorio que contiene los ficheros 
  que queremos empaquetar, y <span class="codefrag">destfile</span> ser&aacute; el nombre del fichero 
  JAR que vamos a crear.</p>
<p>Esta tarea se puede comportar de forma similar a un <span class="codefrag">fileset</span>, permiti&eacute;ndonos 
  controlar los ficheros que se incluyen y se excluyen mediante los elementos 
  <span class="codefrag">include</span> y <span class="codefrag">exclude</span>.</p>
<pre class="code">&lt;jar destfile="${dist.home}/aplic.jar"
     basedir="${bin.home}"&gt;
  <strong>&lt;include </strong>name="build/**/*.class"/&gt;
  <strong>&lt;include </strong>name="build/**/*.gif"/&gt;
  <strong>&lt;exclude</strong> name="build/prueba/**"/&gt;
&lt;/jar&gt;</pre>
<p>En los ficheros JAR existe un fichero <span class="codefrag">MANIFEST.MF</span> en el que podemos 
  incluir informaci&oacute;n de configuraci&oacute;n sobre el paquete. Podremos 
  incluir esta informaci&oacute;n directamente desde <em>Ant</em> utilizando la 
  etiqueta interna <span class="codefrag">manifest</span>:</p>
<pre class="code">&lt;jar destfile="${dist.home}/aplic.jar"
     basedir="${bin.home}"&gt;
  &lt;<strong>manifest</strong>&gt;
    &lt;<strong>attribute</strong> name="Main-Class" value="es.ua.j2ee.prueba.Principal"/&gt;
  &lt;/<strong>manifest</strong>&gt;
&lt;/jar&gt;</pre>
<p>Dentro de este elemento <span class="codefrag">manifest</span> podremos incluir tanto atributos 
  como queramos, cada uno de ellos mediante una etiqueta <span class="codefrag">attribute</span>. 
  Estos ser&aacute;n los atributos que se incluyan en el fichero <span class="codefrag">MANIFEST.MF</span>.</p>
<a name="N1058C"></a><a name="Ejecuci%C3%B3n"></a>
<h3 class="underlined_5">Ejecuci&oacute;n</h3>
<p>Una vez compilada la ejecuci&oacute;n podremos ejecutarla para probarla. Podemos 
  utilizar el mismo fichero de <em>Ant</em> para ejecutar la aplicaci&oacute;n 
  mediante la tarea <span class="codefrag">java</span>, que ejecutar&aacute; la aplicaci&oacute;n 
  en una m&aacute;quina virtual Java.</p>
<pre class="code">&lt;<strong>java</strong> classname="es.ua.j2ee.prueba.Principal"&gt;
  &lt;classpath&gt;
    &lt;pathelement location="${bin.home}"/&gt;
  &lt;/classpath&gt;
&lt;/<strong>java</strong>&gt;</pre>
<p>Podremos especificar el <em>classpath</em> con el que ejecutamos de la misma 
  forma en que especific&aacute;bamos el <em>classpath</em> al compilar. Normalmente 
  como <em>classpath</em> deberemos especificar al menos el directorio donde tengamos 
  las clases compiladas, para que sea capaz de ejecutarlas.</p>
<p>Muchas veces al ejecutar una aplicaci&oacute;n Java tenemos que proporcionar 
  par&aacute;metros en la l&iacute;nea de comando. Podremos incluir estos par&aacute;metros 
  mediante etiquetas <span class="codefrag">arg</span> dentro de <span class="codefrag">java</span>.</p>
<pre class="code">&lt;java classname="es.ua.j2ee.prueba.Principal"&gt;
  &lt;<strong>arg</strong> value="-f"/&gt; 
  &lt;<strong>arg</strong> value="datos.txt"/&gt; 
  &lt;classpath&gt;
    &lt;pathelement location="${bin.home}"/&gt;
  &lt;/classpath&gt;
&lt;/java&gt;</pre>
<p>Podemos establecer una serie de atributos en la etiqueta <span class="codefrag">java</span> 
  para controlar la forma en la que se ejecuta la aplicaci&oacute;n:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
  
<tr>
<th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th>
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">fork</span></td>
    <td colspan="4" rowspan="1">Ejecuta la aplicaci&oacute;n en una nueva m&aacute;quina virtual 
      (<span class="codefrag">true</span> &oacute; <span class="codefrag">false</span>)</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">failonerror</span></td>
    <td colspan="4" rowspan="1">Si la aplicaci&oacute;n sale con c&oacute;digo de error (es decir, distinto 
      de <span class="codefrag">0</span>) se detendr&aacute; el proceso de construcci&oacute;n 
      de <em>Ant</em> (<span class="codefrag">true</span> &oacute; <span class="codefrag">false</span>)</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">maxmemory</span></td>
    <td colspan="4" rowspan="1">Memoria m&aacute;xima que se le asignar&aacute; a la m&aacute;quina virtual 
      para la ejecuci&oacute;n de la aplicaci&oacute;n. Por ejemplo, con "<span class="codefrag">128m</span>" 
      especificamos 128 MB.</td>
  
</tr>

</table>
<p>Por ejemplo, podemos establecer estos atributos de la siguiente forma:</p>
<pre class="code">&lt;java classname="es.ua.j2ee.prueba.Principal"
      <strong>fork</strong>="true"
      <strong>failonerror</strong>="true"
      <strong>maxmemory</strong>="128m"&gt;
  &lt;classpath&gt;
    &lt;pathelement location="${bin.home}"/&gt;
  &lt;/classpath&gt;
&lt;/java&gt;</pre>
<p>Si tenemos un fichero JAR ejecutable, en el que hayamos definido una clase 
  principal (<span class="codefrag">Main-Class</span>) dentro del <span class="codefrag">MANIFEST</span>, podemos 
  ejecutar la aplicaci&oacute;n directamente especificando este fichero JAR. En 
  este caso deberemos especificar obligatoriamente <span class="codefrag">fork="true"</span>:</p>
<pre class="code">&lt;<strong>java</strong> <strong>jar</strong>="${dist.home}/aplic.jar" fork="true"/&gt;</pre>
<p>NOTA: Al utilizar un JAR autoejecutable no se puede especificar ning&uacute;n 
  classpath. S&oacute;lo se tendr&aacute;n en cuenta las clases dentro del JAR 
  que estemos ejecutando y la informaci&oacute;n contenida en &eacute;l. De esta 
  forma, si queremos incluir alguna librer&iacute;a externa no podemos ejecutarlo 
  de este modo. Para ejecutar una clase dentro de un JAR pudiendo especificar 
  m&aacute;s elementos en el classpath, deberemos utilizar el m&eacute;todo de 
  ejecuci&oacute;n anterior, en el que especificamos el nombre de la clase principal 
  a ejecutar. En este caso, como classpath estableceremos el fichero JAR que contiene 
  esta clase principal que vamos a ejecutar, y todos los dem&aacute;s elementos 
  necesarios.</p>
<a name="N10647"></a><a name="Sistema+de+ficheros"></a>
<h3 class="underlined_5">Sistema de ficheros</h3>
<p>Para construir la aplicaci&oacute;n es posible que necesitemos crear directorios 
  y copiar ficheros de un directorio a otro, para ir a&ntilde;adiendo todos los 
  recursos necesarios a la aplicaci&oacute;n final que vamos a distribuir. <em>Ant</em> 
  nos permitir&aacute; hacer todas estas operaciones con el sistema de ficheros.</p>
<p>Podremos crear directorios con la tarea <span class="codefrag">mkdir</span>:</p>
<pre class="code">&lt;<strong>mkdir</strong> dir="${bin.home}"/&gt;</pre>
<p>Con la tarea <span class="codefrag">copy</span> podremos copiar ficheros de un directorio a 
  otro:</p>
<pre class="code">&lt;<strong>copy</strong> todir="${bin.home}"&gt;
  &lt;fileset dir="${res.home}"/&gt;
&lt;/<strong>copy</strong>&gt;</pre>
<p>Debemos especificar en <span class="codefrag">todir</span> el directorio destino donde vamos 
  a copiar los ficheros, y el conjunto de ficheros a copiar lo definiremos mediante 
  una etiqueta de tipo <span class="codefrag">fileset</span>. </p>
<p>Muchas veces tendremos un objetivo <span class="codefrag">clean</span> que nos permita limpiar 
  todo lo que se haya construido de la aplicaci&oacute;n para poder volverla a 
  construir desde cero. Para hacer esto deberemos borrar todos los ficheros que 
  hayamos construido. Utilizaremos la tarea <span class="codefrag">delete</span>, que nos permitir&aacute; 
  borrar tanto ficheros individuales como directorios:</p>
<pre class="code">&lt;<strong>delete</strong> dir="${bin.home}"/&gt;
&lt;<strong>delete</strong> file="${dist.home}/aplic.jar"/&gt;</pre>
<p>Tambi&eacute;n podemos especificar un conjunto de ficheros para borrar, mediante 
  un elemento <span class="codefrag">fileset</span>.</p>
<a name="N10693"></a><a name="Comandos+externos"></a>
<h3 class="underlined_5">Comandos externos</h3>
<p>En alg&uacute;n caso es posible que queramos invocar un comando externo del 
  sistema. Esto no es recomendable, ya que perdemos la portabilidad, pero puede 
  facilitarnos la tarea si queremos utilizar alguna herramienta externa cuya funci&oacute;n 
  no tenemos implementada como tarea.</p>
<p>Para invocar estos comandos utilizaremos la tarea <span class="codefrag">exec</span>:</p>
<pre class="code">&lt;<strong>exec</strong> executable="genera.exe"&gt;
  &lt;arg line="-o datos.txt"/&gt;
&lt;/<strong>exec</strong>&gt;</pre>
<p>Podemos incluir como etiquetas <span class="codefrag">arg</span> internas los argumentos que 
  queramos proporcionar en la l&iacute;nea de comandos.</p>
<p>Podemos a&ntilde;adir una serie de atributos que indiquen como se ejecutar&aacute; 
  este comando:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
  
<tr>
<th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th><th colspan="1" rowspan="1"></th>
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">failonerror</span></td>
    <td colspan="5" rowspan="1">Por defecto el c&oacute;digo de salida de la aplicaci&oacute;n 
      es ignorado. Con este atributo a <span class="codefrag">true</span> en caso de salir con 
      c&oacute;digo distinto de <span class="codefrag">0</span> se interrumpir&aacute; el proceso 
      de construcci&oacute;n de <em>Ant</em> (<span class="codefrag">true</span> &oacute; <span class="codefrag">false</span>).</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">dir</span></td>
    <td colspan="5" rowspan="1">Nos permite especificar el directorio desde donde se deber&aacute; ejecutar 
      este comando.</td>
  
</tr>
  
<tr> 
    
<td colspan="1" rowspan="1"><span class="codefrag">os</span></td>
    <td colspan="5" rowspan="1">Podemos definir aqu&iacute; en que Sistemas Operativos podr&aacute; ejecutarse 
      este comando. De esta manera podremos hacer que pueda adaptarse a diferentes 
      plataformas, indicando el comando adecuado para cada sistema operativo.</td>
  
</tr>

</table>
<p>Por ejemplo, podemos definir el siguiente comando para Windows 2000:</p>
<pre class="code">&lt;<strong>exec</strong> executable="genera.exe" 
      dir="${tools.home}" 
      os="Windows 2000"&gt;
  &lt;arg line="-o datos.txt"/&gt;
&lt;/<strong>exec</strong>&gt;</pre>
<a name="N10713"></a><a name="Impresi%C3%B3n+de+texto"></a>
<h3 class="underlined_5">Impresi&oacute;n de texto</h3>
<p>Podemos imprimir cadenas de texto dentro del fichero de <em>Ant</em> para por 
  ejemplo mostrar detalles del proceso al usuario o instrucciones de uso con los 
  posibles objetivos que podamos especificar. </p>
<p>Esto lo haremos con la etiqueta <span class="codefrag">echo</span>:</p>
<pre class="code">&lt;<strong>echo</strong> message="Instrucciones de uso:"/&gt;</pre>
<p>Podemos indicar el nivel al que estamos mostrando este mensaje lo cual nos 
  permitir&aacute; distinguir mensajes de error, de advertencia, de informaci&oacute;n, 
  etc. </p>
<pre class="code">&lt;echo message="Instrucciones de uso:" <strong>level</strong>="info"/&gt;</pre>
<p>Los posibles niveles que podemos especificar son "<span class="codefrag">error</span>", 
  "<span class="codefrag">warning</span>", "<span class="codefrag">info</span>", "<span class="codefrag">verbose</span>" 
  y "<span class="codefrag">debug</span>".</p>
</div>

<a name="N1074A"></a><a name="Integraci%C3%B3n+con+Eclipse"></a>
<h2 class="underlined_10">Integraci&oacute;n con Eclipse</h2>
<div class="section">
<p>El entorno de desarrollo Eclipse integra la herramienta <em>Ant</em>. Esto 
  a&ntilde;ade flexibilidad a este entorno, ya que desde &eacute;l podremos ejecutar 
  f&aacute;cilmente cualquier tarea soportada por <em>Ant</em>, lo que nos permitir&aacute; 
  personalizar la forma en la que se construyen las aplicaciones.</p>
<a name="N10759"></a><a name="Configuraci%C3%B3n"></a>
<h3 class="underlined_5">Configuraci&oacute;n</h3>
<p>Lo primero que deberemos hacer es configurar el <em>plugin</em> de <em>Ant</em> 
  integrado en el entorno. Para ello iremos a la opci&oacute;n <strong>Window 
  &gt; Preferences</strong> y dentro de esta ventana al apartado <strong>Ant &gt; 
  Runtime</strong>. Veremos una ventana como la siguiente:</p>
<p>   

<img alt="Configuracion de Ant" content-width="10cm" height="296" src="imagenes/ant/eclipse_ant.jpg" width="400">
 </p>
<p>En el cuadro de abajo (<em>Additional classpath entries</em>) deberemos a&ntilde;adir 
  todas las librer&iacute;as de tareas adicionales que queramos utilizar con <em>Ant</em>. 
</p>
<p>NOTA: Si cuando compilemos con <em>Ant</em> se produce un error que indique 
  que no puede encontrar el compilador <span class="codefrag">javac</span>, nos deberemos asegurar 
  de tener el fichero <span class="codefrag">tools.jar</span> en el cuadro de arriba de la ventana 
  anterior (<em>Runtime classpath</em>). Podemos encontrar este fichero dentro 
  del directorio <span class="codefrag">${JAVA_HOME}$/lib</span>.</p>
<a name="N10794"></a><a name="Ejecuci%C3%B3n+de+tareas"></a>
<h3 class="underlined_5">Ejecuci&oacute;n de tareas</h3>
<p>Una vez nos hemos asegurado de tener configurado correctamente el entorno para 
  trabajar con <em>Ant</em>, vamos a ver como crear y utilizar ficheros de configuraci&oacute;n 
  de <em>Ant</em> desde Eclipse. Lo primero que deberemos hacer es crear el fichero 
  de <em>Ant</em>. Para crear este fichero deberemos tener un proyecto abierto, 
  para el cual vamos a crear este fichero. Si no tenemos ning&uacute;n proyecto 
  deberemos crear uno. </p>
<p>Una vez tengamos seleccionado el proyecto con el que vamos a trabajar, crearemos 
  el fichero de configuraci&oacute;n de <em>Ant</em> mediante la opci&oacute;n 
  <strong>New &gt; File</strong>, que nos permitir&aacute; crear un fichero gen&eacute;rico. 
  Llamaremos al fichero <span class="codefrag">build.xml</span>, y escribiremos en &eacute;l todo 
  el c&oacute;digo que queramos incluir en este fichero de configuraci&oacute;n 
  de <em>Ant</em>. Podremos editar el c&oacute;digo de este fichero dentro del 
  editor de Eclipse, pulsando sobre el nombre de este fichero en el explorador 
  de paquetes. Una vez escrito este fichero lo grabaremos.</p>
<p>Ahora deberemos utilizar la ventana de <em>Ant</em>, desde la cual podremos 
  trabajar con este fichero de configuraci&oacute;n. Para que esta ventana se 
  muestre deberemos estar en la perspectiva de Java, y seleccionar <strong>Window 
  &gt; Show View &gt; Ant</strong>. Con esto veremos una ventana como la siguiente:</p>
<p>   

<img alt="Ventana de Ant" content-width="4cm" height="169" src="imagenes/ant/eclipse_ant_2.gif" width="193">
 </p>
<p>Pulsaremos sobre el primero de los botones que vemos en esta ventana para a&ntilde;adir 
  un fichero <span class="codefrag">build.xml</span>, y seleccionaremos el fichero <span class="codefrag">build.xml</span> 
  de nuestro proyecto. Una vez hecho esto, si todo est&aacute; configurado correctamente 
  y el fichero de configuraci&oacute;n es correcto, en esta ventana se mostrar&aacute;n 
  los objetivos que se hayan definido dentro de este fichero <span class="codefrag">build.xml</span>:</p>
<p>   

<img alt="Buildfiles agregados" content-width="4cm" height="177" src="imagenes/ant/eclipse_ant_3.gif" width="193">
 </p>
<p>Ahora podremos ejecutar cada uno de estos objetivos simplemente pulsando sobre 
  ellos. De esta forma podremos ejecutar desde el entorno cualquier conjunto de 
  tareas definidas en un fichero de <em>Ant</em> simplemente con una pulsaci&oacute;n 
  del rat&oacute;n. El objetivo marcado en azul ser&aacute; el objetivo que hayamos 
  definido como objetivo por defecto.</p>
</div>


<p class="pageBreakAfter"></p>


</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006 Depto. CCIA</div>
</div>
</body>
</html>
