<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Casos de prueba: JUnit</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Java y Herramientas de Desarrollo" src="images/baner_j2ee_der.gif" title="Java y Herramientas de Desarrollo"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Java y Herramientas de Desarrollo</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 7</div>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html">Sesion 8</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html">Sesion 8</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion07-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Casos de prueba: JUnit</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n+a+JUnit">Introducci&oacute;n a JUnit</a>
</li>
<li>
<a href="#Integraci%C3%B3n+de+JUnit+en+Eclipse">Integraci&oacute;n de JUnit en Eclipse</a>
</li>
<li>
<a href="#Un+ejemplo+sencillo">Un ejemplo sencillo</a>
<ul class="minitoc">
<li>
<a href="#Nuestro+primer+caso+de+prueba">Nuestro primer caso de prueba</a>
</li>
<li>
<a href="#Ejecuci%C3%B3n+de+pruebas">Ejecuci&oacute;n de pruebas</a>
</li>
<li>
<a href="#Pruebas+con+lanzamiento+de+excepciones">Pruebas con lanzamiento de excepciones</a>
</li>
</ul>
</li>
<li>
<a href="#M%C3%BAltiples+pruebas">M&uacute;ltiples pruebas</a>
<ul class="minitoc">
<li>
<a href="#M%C3%BAltiples+pruebas+de+una+clase">M&uacute;ltiples pruebas de una clase</a>
</li>
<li>
<a href="#Inicializaci%C3%B3n+y+terminaci%C3%B3n">Inicializaci&oacute;n y terminaci&oacute;n</a>
</li>
<li>
<a href="#Suites+de+pruebas">Suites de pruebas</a>
</li>
</ul>
</li>
</ul>
</div>


<p>En este tema veremos <strong>JUnit</strong>, una librer&iacute;a desarrollada para poder probar el funcionamiento de las clases y m&eacute;todos que componen nuestra aplicaci&oacute;n, y asegurarnos de que se comportan como deben ante distintas situaciones de entrada.</p>


<a name="N10012"></a><a name="Introducci%C3%B3n+a+JUnit"></a>
<h2 class="underlined_10">Introducci&oacute;n a JUnit</h2>
<div class="section">
<p>Cuando probamos un programa, lo ejecutamos con unos datos de entrada (casos de prueba) para verificar que el funcionamiento cumple los requisitos esperados. Definimos <strong>prueba unitaria</strong> como la prueba de uno de los m&oacute;dulos que componen un programa.</p>
<p>En los &uacute;ltimos a&ntilde;os se han desarrollado un conjunto de herramientas que facilitan la elaboraci&oacute;n de pruebas unitarias en diferentes lenguajes. Dicho conjunto se denomina <em>XUnit</em>. De entre dicho conjunto, <strong>JUnit</strong> es la herramienta utilizada para realizar pruebas unitarias en Java.</p>
<p>El concepto fundamental en estas herramientas es el <strong>caso de prueba</strong> (<em>test case</em>), y la <strong>suite</strong> de prueba (<em>test suite</em>). Los casos de prueba son clases o m&oacute;dulos que disponen de m&eacute;todos para probar los m&eacute;todos de una clase o m&oacute;dulo concreta/o. As&iacute;, para cada clase que quisi&eacute;ramos probar definir&iacute;amos su correspondiente clase de caso de prueba. Mediante las suites podemos organizar los casos de prueba, de forma que cada suite agrupa los casos de prueba de m&oacute;dulos que est&aacute;n funcionalmente relacionados.</p>
<p>Las pruebas que se van construyendo se estructuran as&iacute; en forma de &aacute;rbol, de modo que las hojas son los casos de prueba, y podemos ejecutar cualquier sub&aacute;rbol (suite).</p>
<p>De esta forma, construimos programas que sirven para probar nuestros m&oacute;dulos, y que podremos ejecutar de forma autom&aacute;tica. A medida que la aplicaci&oacute;n vaya avanzando, se dispondr&aacute; de un conjunto importante de casos de prueba, que servir&aacute; para hacer pruebas de regresi&oacute;n. Eso es importante, puesto que cuando cambiamos un m&oacute;dulo que ya ha sido probado, el cambio puede haber afectado a otros m&oacute;dulos, y ser&iacute;a necesario volver a ejecutar las pruebas para verificar que todo sigue funcionando.</p>
<p>Aplicando lo anterior a Java, JUnit es un conjunto de clases opensource que nos permiten probar nuestras aplicaciones Java. Podemos encontrar informaci&oacute;n actualizada de JUnit en <a href="http://www.junit.org">http://www.junit.org</a>
</p>
<p>Encontraremos una distribuci&oacute;n de JUnit, en la que habr&aacute; un fichero JAR, <strong>junit.jar</strong>, que contendr&aacute; las clases que deberemos tener en el CLASSPATH a la hora de implementar y ejecutar los casos de prueba.</p>
</div>


<a name="N10049"></a><a name="Integraci%C3%B3n+de+JUnit+en+Eclipse"></a>
<h2 class="underlined_10">Integraci&oacute;n de JUnit en Eclipse</h2>
<div class="section">
<p>Eclipse incorpora opciones para poder trabajar con JUnit desde &eacute;l. Antes de nada, debemos tener nuestro proyecto Java ya creado, o bien crearlo nuevo. Despu&eacute;s, hacemos click con el bot&oacute;n derecho sobre el proyecto, y vamos sus <em>Properties</em>. En ellas, vamos a <em>Java Build Path</em>, y en <em>Libraries</em> pulsamos en <em>Add Library</em> y elegimos la de JUnit:</p>
<p>
<img alt="A&ntilde;adir la librer&iacute;a JUnit a nuestro proyecto Eclipse" content-width="16cm" height="617" src="imagenes/herramientas/junit_eclipse.gif" width="630"></p>
<p>Una vez a&ntilde;adida la librer&iacute;a, ya podemos crear las clases de nuestro proyecto y sus respectivos casos de prueba, como explicaremos a continuaci&oacute;n</p>
</div>


<a name="N1006A"></a><a name="Un+ejemplo+sencillo"></a>
<h2 class="underlined_10">Un ejemplo sencillo</h2>
<div class="section">
<p>Supongamos que definimos una clase <span class="codefrag">Matriz</span> para manejar matrices de enteros, y una operaci&oacute;n <span class="codefrag">sumar</span> que permite sumar dos matrices. La clase tambi&eacute;n tiene un m&eacute;todo <span class="codefrag">equals</span> que compara dos matrices para ver si son iguales:</p>
<pre class="code">public class Matriz
{
	int[][] elem;

	public Matriz(int[][] elem)
	{
		... // C&oacute;digo del constructor
	}

	public Matriz sumar(Matriz m)
	{
		... // C&oacute;digo del m&eacute;todo
	}

	public boolean equals(Matriz m)
	{
		... // Compara la matriz actual con m
	}
}</pre>
<a name="N10080"></a><a name="Nuestro+primer+caso+de+prueba"></a>
<h3 class="underlined_5">Nuestro primer caso de prueba</h3>
<p>Vamos a utilizar JUnit para probar la funci&oacute;n de suma. Para realizar casos de prueba, debemos definir clases que hereden de la clase <strong><span class="codefrag">junit.framework.TestCase</span></strong> de JUnit, y que implementen m&eacute;todos <span class="codefrag">testXXX()</span>(sin par&aacute;metros), que ser&aacute;n los que hagan las pruebas necesarias.</p>
<p>Para hacerlo desde Eclipse, una vez hechos los pasos del apartado anterior para configurar JUnit, vamos al men&uacute; <em>File - New - Other </em> y buscamos entre las opciones (normalmente dentro de<em> Java</em>) la de<em> JUnit TestCase</em> podemos tambi&eacute;n crear un caso de prueba, eligiendo el nombre del caso, y el nombre de la clase a probar:</p>
<p>
<img alt="Crear un caso de prueba en Eclipse" content-width="10cm" height="503" src="imagenes/herramientas/junit_eclipse5.gif" width="497"></p>
<p>Pulsando en <em>Next</em> tambi&eacute;n podemos marcar los m&eacute;todos para los cuales queremos definir m&eacute;todos de prueba <span class="codefrag">testXXX()</span>.</p>
<p>En nuestro caso, definimos un subtipo de <span class="codefrag">TestCase</span> llamado <span class="codefrag">MatrizTest</span> (como convenci&oacute;n se suele poner el mismo nombre de la clase que probamos, terminado en <em>Test</em>), y definimos un m&eacute;todo <span class="codefrag">testSuma()</span> para comprobar la suma de matrices.</p>
<p>Una vez relleno el c&oacute;digo de nuestra clase de prueba, quedar&iacute;a algo como:</p>
<pre class="code">import junit.framework.*;

public class MatrizTest extends TestCase
{
	final static int[][] MATRIZ =  {{1, 0, 0},
					{0, 1, 0},
					{0, 0, 1}};

	final static int[][] SUMA   =  {{2, 0, 0},
					{0, 2, 0},
					{0, 0, 2}};

	public MatrizTest(String nombre)
	{
		super(nombre);
	}

	public void testSuma()
	{
		Matriz m1        = new Matriz(MATRIZ);
		Matriz m2        = new Matriz(MATRIZ);
		Matriz msumaOK   = new Matriz(SUMA);
		Matriz msumaTest = m1.sumar(m2);

		assertTrue(msumaOK.equals(msumaTest));
	}
}</pre>
<p>El constructor nos sirve para dar un nombre a la prueba. Aparte de eso, hemos definido un par de constantes que ser&aacute;n las matrices que usaremos en las pruebas. Construimos dos objetos <span class="codefrag">Matriz</span>, <span class="codefrag">m1</span> y <span class="codefrag">m2</span>, cuyos valores son los de la constante <span class="codefrag">MATRIZ</span>. Despu&eacute;s en <span class="codefrag">msumaTest</span> calculamos la suma de las dos. Finalmente, con el m&eacute;todo <span class="codefrag">assertTrue</span> de la clase <span class="codefrag">TestCase</span> comprobamos que la matriz calculada coincide con <span class="codefrag">msumaOK</span>, que contiene el resultado correcto, el de la constante <span class="codefrag">SUMA</span>.</p>
<p>En general la construcci&oacute;n de pruebas sigue siempre estos mismos patrones: construir los objetos de prueba, y llamar al m&eacute;todo <strong>assertTrue(...)</strong> (o cualquier otro m&eacute;todo <span class="codefrag">assertXXX(...)</span> de <span class="codefrag">TestCase</span>) cada vez que queramos comprobar algo en el m&eacute;todo de prueba. En el caso de que se cumplan todos los <em>assertXXX</em> que hayamos puesto, la prueba habr&aacute; sido satisfactoria (en nuestro caso, comparar la matriz calculada con la que deber&iacute;a haber salido).</p>
<p>Se aconseja colocar las clases de prueba en el mismo paquete que las clases a las que prueban, para facilitar despu&eacute;s el mantenimiento y la localizaci&oacute;n. Adem&aacute;s, de esta forma las clases de prueba podr&iacute;an tener acceso a campos y m&eacute;todos internos a los que no podr&iacute;an acceder desde fuera del paquete.</p>
<p>
<strong>Crear clases a partir de las pruebas</strong>
</p>
<p>Eclipse tambi&eacute;n nos permite <strong>definir las clases de prueba antes que las clases que probamos</strong>, por ejemplo, podemos definir un caso de prueba <span class="codefrag">MiPruebaTest</span>, para probar el m&eacute;todo <span class="codefrag">miMetodo()</span> de una clase <span class="codefrag">MiPrueba</span> a&uacute;n no definida, que debe devolver <em>"Hola"</em>:</p>
<pre class="code">public class MiPruebaTest extends TestCase
{
	public void testMiMetodo()
	{
		MiPrueba mp = new MiPrueba();
		assertTrue(mp.miMetodo().equals("Hola"));
	}
}</pre>
<p>Al escribir este c&oacute;digo la l&iacute;nea que declara <span class="codefrag">MiPrueba</span> aparece con una luz amarilla a la izquierda. Pinchando sobre ella nos aparecen varias opciones:</p>
<p>
<img alt="Crear clases a partir de pruebas" content-width="11cm" height="252" src="imagenes/herramientas/junit_eclipse3.gif" width="573"></p>
<p>Eligiendo <em>Create class</em>... podremos crear la clase a partir de la prueba. Nos crear&aacute; la clase vac&iacute;a, que tendremos que rellenar con los m&eacute;todos apropiados. Tambi&eacute;n podr&iacute;amos forzar a que los constructores y ciertos m&eacute;todos <span class="codefrag">getXXX(...) </span>y <span class="codefrag">setXXX(...)</span> los dejara hechos tambi&eacute;n, pero en algunas versiones de Eclipse no funciona bien esta caracter&iacute;stica.</p>
<a name="N10128"></a><a name="Ejecuci%C3%B3n+de+pruebas"></a>
<h3 class="underlined_5">Ejecuci&oacute;n de pruebas</h3>
<p>Cuando tengamos definida la clase de prueba que queramos ejecutar, y la clase a probar, vamos desde la clase de prueba a <em>Run - Run As - JUnit test</em>. Nos aparecer&aacute; la ventana de JUnit en Eclipse con los resultados:</p>
<p>
<img alt="Ventana de JUnit en Eclipse" content-width="6cm" height="322" src="imagenes/herramientas/junit_eclipse4.gif" width="250"></p>
<p>Arriba tendremos una barra roja o verde (seg&uacute;n si ha habido fallos o no), despu&eacute;s las pruebas err&oacute;neas y la jerarqu&iacute;a de todas las pruebas realizadas, y finalmente los errores producidos.</p>
<p>Se puede relanzar un test pulsando <em>Ctrl + F11</em>, y haciendo doble click en los errores iremos a la l&iacute;nea de c&oacute;digo que los provoc&oacute;. Tambi&eacute;n podemos definir cuantos tests queramos en la clase de prueba, y se ejecutar&aacute;n todos ellos.</p>
<p>
<strong>Ejecutar pruebas fuera de Eclipse</strong>
</p>
<p>Para ejecutar pruebas por s&iacute; solas, debemos utilizar un ejecutor de pruebas (<em>test runner</em>). JUnit proporciona algunos de ellos, como <strong>junit.textui.TestRunner</strong> (para mostrar los resultados en modo texto), o <strong>junit.swingui.TestRunner</strong> (para mostrar los resultados gr&aacute;ficamente). Para ejecutarlos podemos incluir el jar <em>junit.jar</em> en el CLASSPATH al ejecutar:</p>
<pre class="code">java -cp ./junit.jar junit.swingui.TestRunner</pre>
<p>Nos aparecer&iacute;a una ventana donde indicamos el nombre del caso de prueba que queremos ejecutar (o lo elegimos de una lista), y luego pulsando <em>Run</em> nos mostrar&aacute; los resultados:</p>
<p>
<img alt="Ejemplo de uso de TestRunner" content-width="10cm" height="484" src="imagenes/herramientas/junit_testrunner.gif" width="488"></p>
<p>La barra verde aparece si las pruebas han ido bien, y si no aparecer&aacute; en rojo. En la pesta&ntilde;a <em>Failures </em>podemos ver qu&eacute; pruebas han fallado, y en <em>Test Hierarchy </em>podemos ver todas las pruebas que se han realizado, y los resultados para cada una. En el cuadro inferior nos aparecen los errores que se han producido en las pruebas err&oacute;neas.</p>
<p>Para ejecutar el <em>TestRunner</em> u otro ejecutor de pruebas, podemos tambi&eacute;n definirnos un m&eacute;todo <span class="codefrag">main</span> en nuestra clase de prueba que lance el ejecutor, en nuestro caso:</p>
<pre class="code">public static void main (String[] args)
{
	String[] nombresTest = {MatrizTest.class.getName()};
	junit.swingui.TestRunner.main(nombresTest);
}</pre>
<p>Vemos que al <span class="codefrag">main</span> del <em>TestRunner</em> se le pueden pasar como par&aacute;metros los nombres de las clases de prueba que queremos probar.</p>
<a name="N1018A"></a><a name="Pruebas+con+lanzamiento+de+excepciones"></a>
<h3 class="underlined_5">Pruebas con lanzamiento de excepciones</h3>
<p>Imaginemos que queremos probar un m&eacute;todo <span class="codefrag">miMetodo()</span> en la clase <span class="codefrag">Matriz</span> que funciona bien si lanza una excepci&oacute;n de tipo <span class="codefrag">IOException</span>, y en caso contrario su comportamiento es err&oacute;neo. En ese caso, el c&oacute;digo del m&eacute;todo de prueba ser&iacute;a:</p>
<pre class="code">public void testMiMetodo()
{
	Matriz m = new Matriz(...);
	try
	{
		m.miMetodo();
		fail("Deber&iacute;a haber saltado una excepci&oacute;n");
	} catch (IOException e) {
	}
}</pre>
<p>Se utiliza el m&eacute;todo <strong>fail(...)</strong> para generar el error en el caso de que no se lance la excepci&oacute;n (se coloca despu&eacute;s del m&eacute;todo que deber&iacute;a lanzarla). Si no se ejecuta el <span class="codefrag">fail</span>, es porque hemos saltado al <span class="codefrag">catch</span>, y la prueba saldr&aacute; satisfactoria (no es necesario ninguna llamada a un m&eacute;todo <span class="codefrag">assert...()</span>).</p>
</div>


<a name="N101B1"></a><a name="M%C3%BAltiples+pruebas"></a>
<h2 class="underlined_10">M&uacute;ltiples pruebas</h2>
<div class="section">
<p>Veremos ahora c&oacute;mo definir varias pruebas dentro de una misma clase, c&oacute;mo establecer configuraciones globales para todas las pruebas de dicha clase, y c&oacute;mo categorizar diferentes clases de prueba dentro de una suite de pruebas.</p>
<a name="N101BA"></a><a name="M%C3%BAltiples+pruebas+de+una+clase"></a>
<h3 class="underlined_5">M&uacute;ltiples pruebas de una clase</h3>
<p>Imaginemos que definimos una nueva operaci&oacute;n en nuestra clase <span class="codefrag">Matriz</span>, para restar dos matrices:</p>
<pre class="code">public Matriz resta(Matriz m)
{
	... // C&oacute;digo del m&eacute;todo
}</pre>
<p>Para probar esta nueva operaci&oacute;n, definimos un nuevo m&eacute;todo <span class="codefrag">testResta()</span> en nuestra clase <span class="codefrag">MatrizTest</span>, con las constantes adicionales necesarias:</p>
<pre class="code">import junit.framework.*;

public class MatrizTest extends TestCase
{
	...

	final static int[][] RESTA  =  {{0, 0, 0},
					{0, 0, 0},
					{0, 0, 0}};

	...

	public void testResta()
	{
		Matriz m1         = new Matriz(MATRIZ);
		Matriz m2         = new Matriz(MATRIZ);
		Matriz mrestaOK   = new Matriz(RESTA);
		Matriz mrestaTest = m1.restar(m2);

		assertTrue(mrestaOK.equals(mrestaTest));
	}
}</pre>
<p>En este caso, al probarlo la clase <span class="codefrag">MatrizTest</span> se mostrar&aacute;n los resultados de las dos pruebas:</p>
<p>
<img alt="Ejemplo de ejecuci&oacute;n de varias pruebas" content-width="10cm" height="485" src="imagenes/herramientas/junit_testrunner2.gif" width="488"></p>
<a name="N101E6"></a><a name="Inicializaci%C3%B3n+y+terminaci%C3%B3n"></a>
<h3 class="underlined_5">Inicializaci&oacute;n y terminaci&oacute;n</h3>
<p>Observemos en la clase <span class="codefrag">MatrizTest</span> que en los m&eacute;todos <span class="codefrag">testSuma()</span> y <span class="codefrag">testResta()</span> hay c&oacute;digo repetido, en concreto el c&oacute;digo referido a construir los objetos de prueba (<span class="codefrag">m1 </span>y <span class="codefrag">m2</span>). Cuando tengamos c&oacute;digo com&uacute;n en las pruebas, podemos redefinir el m&eacute;todo <span class="codefrag">setUp()</span> de <span class="codefrag">TestCase</span> para colocar dicho c&oacute;digo que se ejecutar&aacute; antes de realizar las pruebas:</p>
<pre class="code">import junit.framework.*;

public class MatrizTest extends TestCase
{
	...
	<strong>Matriz m1, m2;</strong>
	...

	<strong>public void setUp()
	{
		m1 = new Matriz(MATRIZ);
		m2 = new Matriz(MATRIZ);
	}</strong>

	public void testSuma()
	{
		Matriz msumaOK   = new Matriz(SUMA);
		Matriz msumaTest = m1.sumar(m2);

		assertTrue(msumaOK.equals(msumaTest));
	}

	...
}</pre>
<p>Tambi&eacute;n tenemos un m&eacute;todo <strong>tearDown()</strong> en el caso de que queramos liberar algunos recursos. En este caso no es necesario, porque el <em>garbage collector</em>  de Java se encargar&aacute; de eliminarlos de memoria, pero s&iacute; ser&iacute;a &uacute;til utilizarlo si por ejemplo hemos insertado registros de prueba en una base de datos, para borrarlos y as&iacute; no dejar rastros con la prueba.</p>
<a name="N10218"></a><a name="Suites+de+pruebas"></a>
<h3 class="underlined_5">Suites de pruebas</h3>
<p>Imaginemos que definimos otra operaci&oacute;n de resta en la clase <span class="codefrag">Matriz</span>, para restar matrices a la inversa (si <span class="codefrag">resta()</span> hac&iacute;a A - B, el nuevo m&eacute;todo <span class="codefrag">resta2()</span> har&aacute; B - A):</p>
<pre class="code">public Matriz resta2(Matriz m)
{
	... // C&oacute;digo del m&eacute;todo
}</pre>
<p>Paralelamente, definimos nuestro m&eacute;todo de prueba <span class="codefrag">testRestar()</span> en nuestra clase <span class="codefrag">MatrizTest</span>:</p>
<pre class="code">public void testResta2()
{
	Matriz mrestaOK   = new Matriz(RESTA);
	Matriz mrestaTest = m1.resta2(m2);

	assertTrue(mrestaOK.equals(mrestaTest));
}</pre>
<p>A medida que vamos acumulando m&eacute;todos de prueba, nos podr&iacute;a interesar organizarlos o agruparlos de determinada forma. Mediante las <strong>suites</strong> podemos asignar m&eacute;todos de prueba a grupos. Para ello, a&ntilde;adimos a nuestra clase de prueba (<span class="codefrag">MatrizTest</span>, en nuestro caso), un m&eacute;todo <strong>suite() </strong>que devuelva una instancia de la clase <span class="codefrag">junit.framework.TestSuite</span> (de la interfaz <span class="codefrag">junit.framework.Test</span> que implementa dicha clase). Recordemos que tambi&eacute;n podemos estructurar las suites en forma de &aacute;rbol.</p>
<p>Para crear suites de pruebas en Eclipse, podemos ir a <em>File - New - Other </em>y buscar (normalmente dentro de <em>Java</em>) la opci&oacute;n<em> JUnit TestSuite</em>. Ah&iacute; le indicamos el nombre de la suite, y las clases de prueba que queremos incluir en ella.</p>
<p>
<img alt="Crear suites con Eclipse" content-width="10cm" height="512" src="imagenes/herramientas/junit_eclipse6.gif" width="496"></p>
<p>Crear&aacute; una clase con un m&eacute;todo est&aacute;tico llamado <strong>suite</strong>, donde construiremos la estructura de la suite de pruebas. Por ejemplo, a continuaci&oacute;n creamos una suite principal, a partir de la cual generamos dos subsuites, una para la prueba de suma y otra para las pruebas de resta. Para ello a&ntilde;adimos lo siguiente en <span class="codefrag">MatrizTest</span>:</p>
<pre class="code">public static Test suite()
{
	TestSuite suite  = new TestSuite("suiteRaiz");
	TestSuite suiteA = new TestSuite("suiteSuma");
	TestSuite suiteB = new TestSuite("suiteResta");

	suiteA.addTest(new MatrizTest("testSuma"));

	suiteB.addTest(new MatrizTest("testResta"));
	suiteB.addTest(new MatrizTest("testResta2"));

	suite.addTest(suiteA);
	suite.addTest(suiteB);

	return suite;
}</pre>
<p>Para ejecutar la suite, la ejecutamos (<em>Run As</em>) como un <em>JUnit Test</em>. Aparecer&aacute; la ventana de JUnit con los tests realizados:</p>
<p>
<img alt="Resultados de la suite" content-width="6cm" height="316" src="imagenes/herramientas/junit_eclipse7.gif" width="251"></p>
<p>Observar que podemos, en una suite, definir pruebas de distintas clases (no s&oacute;lo de <span class="codefrag">MatrizTest</span>, en este caso), y as&iacute; poder controlar todo desde una sola estructura de &aacute;rbol, si nos conviene. Tambi&eacute;n podemos a&ntilde;adir con el m&eacute;todo <span class="codefrag">addTest</span> todas las pruebas de una clase entera, construyendo la suite con el campo <span class="codefrag">class</span> de la clase que se quiere probar:</p>
<pre class="code">public static Test suite()
{
	TestSuite suite  = new TestSuite();
	suite.addTest(new TestSuite(MatrizTest.class));

	return suite;
}</pre>
<p>
<strong>Ejecutar suites desde fuera de Eclipse</strong>
</p>
<p>Definimos el main como:</p>
<pre class="code">public static void main (String[] args)
{
	junit.swingui.TestRunner.run(MatrizTest.class);
}</pre>
<p>El m&eacute;todo <span class="codefrag">run()</span> de <span class="codefrag">TestRunner</span> internamente llama al m&eacute;todo est&aacute;tico <span class="codefrag">suite()</span> que hemos definido, y al cargar el <span class="codefrag">TestRunner</span> nos aparecer&aacute; una vista en &aacute;rbol de las suites creadas:</p>
<p>
<img alt="Ejemplo de estructuraci&oacute;n en suites" content-width="10cm" height="485" src="imagenes/herramientas/junit_testrunner_suite.gif" width="487"></p>
</div>


<p class="pageBreakAfter"></p>


</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006 Depto. CCIA</div>
</div>
</body>
</html>
