<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Servidor de aplicaciones JBoss</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores de aplicaciones" src="images/baner_j2ee_der.gif" title="Servidores de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores de aplicaciones</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores de Aplicaciones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menupage">
<div class="menupagetitle">Apendice</div>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion07-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Servidor de aplicaciones JBoss</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n">Introducci&oacute;n</a>
</li>
<li>
<a href="#Caracter%C3%ADsticas+de+JBoss">Caracter&iacute;sticas de JBoss</a>
</li>
<li>
<a href="#Instalaci%C3%B3n+y+ejecuci%C3%B3n">Instalaci&oacute;n y ejecuci&oacute;n</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+de+servicios">Configuraci&oacute;n de servicios</a>
<ul class="minitoc">
<li>
<a href="#Configuraci%C3%B3n+de+servidor">Configuraci&oacute;n de servidor</a>
</li>
<li>
<a href="#Despliegue+de+una+aplicaci%C3%B3n">Despliegue de una aplicaci&oacute;n</a>
</li>
<li>
<a href="#Acceso+a+una+BD">Acceso a una BD</a>
</li>
</ul>
</li>
<li>
<a href="#Instalaci%C3%B3n+de+la+aplicaci%C3%B3n+Duke%27s+Bank">Instalaci&oacute;n de la aplicaci&oacute;n Duke's Bank</a>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Introducci%C3%B3n"></a>
<h2 class="underlined_10">Introducci&oacute;n</h2>
<div class="section">
<p>Como ya hemos comentado, existen varios servidores de aplicaciones que cumplen 
  las especificaciones J2EE. Bea WebLogic es uno de ellos, pero es necesario obtener 
  una licencia para su uso. Existen otros cuyo uso es libre. En este tema vamos 
  a ver las caracter&iacute;sticas, instalaci&oacute;n y configuraci&oacute;n 
  de uno de los m&aacute;s usados, el servidor JBoss en su versi&oacute;n 4.0. 
  No entraremos en tanto detalle como en WebLogic, sino que veremos los puntos 
  en com&uacute;n y las diferencias con WebLogic.</p>
</div>

<a name="N10016"></a><a name="Caracter%C3%ADsticas+de+JBoss"></a>
<h2 class="underlined_10">Caracter&iacute;sticas de JBoss</h2>
<div class="section">
<p>JBoss empez&oacute; como un contenedor de EJBs y ha evolucionado a un servidor 
  de aplicaciones completo. Las principales caracter&iacute;sticas de JBoss son:</p>
<ul>
  
<li>Cumple con las especificaciones J2EE 1.4. </li>
  
<li>Permite el <em>clustering</em> de EJBs y aplicaciones web. </li>
  
<li>Incorpora la programaci&oacute;n orientada a aspectos (AOP).</li>
  
<li>Hace uso de Tomcat como contenedor de servlets.</li>
  
<li>Su uso es libre y se distribuye en c&oacute;digo abierto.</li>
  
<li>La documentaci&oacute;n disponible es amplia.</li>
  
<li>Existen multitud de proyectos relacionados con JBoss, como Hibernate y un 
    IDE para Eclipse.</li>

</ul>
<p>La distribuci&oacute;n binaria de JBoss contiene los siguientes directorios:</p>
<ul>
  
<li>
<em>bin</em>: contiene los <em>scripts</em> de arranque y parada del servidor 
    y algunos otros que veremos m&aacute;s adelante. Existen <em>scripts</em> 
    duplicados: por ejemplo, tenemos el <em>run.sh</em> (para sistemas Unix) y 
    <em>run.bat</em> (para sistemas Windows).</li>
  
<li>
<em>client</em>: contiene ficheros de configuraci&oacute;n y librer&iacute;as 
    (.jar) las cuales pueden ser usadas por una aplicaci&oacute;n cliente. El 
    fichero <em>jbossall-client.jar</em> es el que contiene el resto de librer&iacute;as.</li>
  
<li>
<em>docs</em>: informaci&oacute;n sobre JBoss: DTDs, ejemplos, licencias, 
    etc.</li>
  
<li>
<em>lib</em>: librer&iacute;as .jar para el funcionamiento de JBoss. No 
    es aconsejable incorporar aqu&iacute; nuevas librer&iacute;as.</li>
  
<li>
<em>server</em>: cada directorio dentro de &eacute;ste es una configuraci&oacute;n 
    de servidor distinta. Por defecto vienen tres: <em>minimal</em> es el arraque 
    con el m&iacute;nimo n&uacute;mero de componentes (no incorpora EJBs, JMS, 
    contenedor web); <em>standar</em> (<em>default</em>) no incluye JAXR, RMI/IIOP 
    ni servicio de <em>clustering</em>; <em>all</em> arranca todos los servicios.</li>

</ul>
</div>

<a name="N10078"></a><a name="Instalaci%C3%B3n+y+ejecuci%C3%B3n"></a>
<h2 class="underlined_10">Instalaci&oacute;n y ejecuci&oacute;n</h2>
<div class="section">
<p>La instalaci&oacute;n es muy sencilla y salvo problemas de configuraci&oacute;n 
  de variables no tiene que dar ning&uacute;n problema. Lo primero es descarg&aacute;rselo 
  de su p&aacute;gina <a href="http://www.jboss.org">http://www.jboss.org</a> 
  Podemos descargar una versi&oacute;n binaria o el c&oacute;digo fuente para 
  compilar. La versi&oacute;n binaria suele ser suficiente para empezar a trabajar. 
  Una vez descargada simplemente la descomprimimos en cualquier directorio de 
  nuestro sistema (por ejemplo /usr/local). JBoss requiere Java JDK 1.4 o superior 
  y la variable JAVA_HOME debe estar inicializada con el directorio donde tengamos 
  instalado JDK. Tambi&eacute;n el ejecutable de Java debe estar en el <em>path</em>.</p>
<p>Entramos en el directorio <em>bin </em>de JBoss y ejecutamos un <em>script</em> 
  llamado <em>run.sh</em> (caso de sistemas Linux) o <em>run.bat</em> (caso de 
  Windows). Si todo va bien (no hay errores) deber&aacute; aparecer un mensaje 
  como el siguiente (cambiando algunos datos):</p>
<p>
<em>11:29:39,944 INFO [Server] JBoss (MX MicroKernel) [4.0.0 (build: CVSTag=JBoss_4_0_0 
  date= 200409200418)] Started in 1m:18s:941ms</em>
</p>
<p>El servidor ya est&aacute; arrancado y escuchando peticiones. El puerto por 
  defecto es el 8080 (debemos de verificar que no hay otra aplicaci&oacute;n escuchando 
  en el mismo puerto). Ahora abrimos un navegador y escribimos <em>http://localhost:8080/jmx-console</em> 
  Esta es la consola de administraci&oacute;n.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/jboss/jboss1.jpg"></p>
<p>Pinchando sobre un servicio (por ejemplo, dentro de <strong>jboss</strong> 
  <em>service=JNDIView</em>) nos muestra los m&eacute;todos a los que se puede 
  llamar de ese MBean. Si el m&eacute;todo admite par&aacute;metros, se puede 
  introducir el valor. En el caso anterior (JNDI) nos permite visualizar el &aacute;rbol 
  JNDI. </p>
<p>Las llamadas que se ven son MBeans (beans de gesti&oacute;n) que son los que 
  gestionan todas las operaciones en el servidor. Podemos modificar su configuraci&oacute;n 
  as&iacute; como parar o poner en marcha servicios. Existe otra consola (llamada 
  consola web) que dispone de un applet a la izquierda. Su 
  aspecto es el siguiente.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/jboss/jboss2.jpg"></p>
<p>El servidor se puede parar de tres maneras distintas: con ctrl+C en el terminal 
  donde lo hemos arrancado; ejecutando el <em>script</em> <em>shutdown</em> del 
  directorio <em>bin</em> o en la consola buscamos <em>type=server</em> en la 
  secci&oacute;n <em>jboss.system</em> y ejecutamos <em>halt</em>.</p>
</div>

<a name="N100CF"></a><a name="Configuraci%C3%B3n+de+servicios"></a>
<h2 class="underlined_10">Configuraci&oacute;n de servicios</h2>
<div class="section">
<a name="N100D5"></a><a name="Configuraci%C3%B3n+de+servidor"></a>
<h3 class="underlined_5">Configuraci&oacute;n de servidor</h3>
<p>Como ya hemos comentado, existen tres tipos de servidores predefinidos. Podemos 
  arrancar uno u otro simplemente pasando el par&aacute;metro -c nombre_servidor 
  al script de arranque. Por ejemplo, con <em>run.sh -c all</em> arrancamos el 
  servidor que contiene todos los servicios. Cada directorio dentro del directorio 
  server contiene lo necesario para gestionar el servidor. La estructura de directorios 
  es la siguiente dentro de un servidor es la siguiente:</p>
<ul>
  
<li>
<em>conf: </em>contiene ficheros de configuraci&oacute;n (como el <em>jndi.properties</em>) 
    de servicios</li>
  
<li>
<em>data</em>: almacena los datos de la BD Hypersonic y la implementaci&oacute;n 
    de JMS</li>
  
<li>
<em>deploy</em>: es donde debemos copiar las aplicaciones que queremos que 
    despliegue JBoss. Tambi&eacute;n contiene las fuentes de datos, servicios 
    de correo, etc. Este directorio se comprueba constantemente en busca de nuevas 
    aplicaciones.</li>
  
<li>
<em>lib</em>: directorio que contiene las librer&iacute;as adicionales necesarias 
    para funcionar. Por ejemplo, aqu&iacute; ser&aacute; donde copiemos los driver 
    JDBC.</li>
  
<li>
<em>log</em>: ficheros log del sistema</li>
  
<li>
<em>tmp</em>: directorio temporal usado en el despliegue de aplicaciones</li>
  
<li>
<em>work</em>: usado por Tomcat para la compilaci&oacute;n de JSPs.</li>

</ul>
<p>Si queremos crear un nuevo servidor (para cambiar su configuraci&oacute;n), 
  lo habitual es copiar uno de los directorios dentro de server. Dentro del nuevo 
  directorio debemos editar los ficheros de configuraci&oacute;n para decir qu&eacute; 
  servicios queremos que est&eacute;n activos y c&oacute;mo se deben configurar.</p>
<a name="N1010E"></a><a name="Despliegue+de+una+aplicaci%C3%B3n"></a>
<h3 class="underlined_5">Despliegue de una aplicaci&oacute;n</h3>
<p>El despliegue de una aplicaci&oacute;n es muy sencillo. Se copia el fichero 
  (.war, .ear, .jar) en el directorio <em>deploy </em>del servidor. Si el servidor 
  est&aacute; en marcha, al cabo de unos segundos sacar&aacute; mensajes como 
  que ha realizado el despliegue. Si queremos quitar la aplicaci&oacute;n, simplemente 
  borramos el fichero y el servidor elimina la aplicaci&oacute;n. Podemos volver 
  a desplegar la misma aplicaci&oacute;n. El redespliegue no funciona bien (necesita 
  rearrancar el servidor), por lo que conviene borrar el fichero y volverlo a 
  desplegar.</p>
<a name="N1011B"></a><a name="Acceso+a+una+BD"></a>
<h3 class="underlined_5">Acceso a una BD</h3>
<p>Como ya vimos con el servidor WebLogic, una BD se puede acceder desde dentro 
  del servidor (desde una aplicaci&oacute;n desplegada) o bien desde una aplicaci&oacute;n 
  cliente. Para ambas, lo primero es configurar la fuente de datos. Detallamos 
  los pasos para crear una fuente de datos:</p>
<ul>
  
<li>Copiar el driver (<em>connector</em>) para la base de datos a usar al directorio 
    <em>server/default/lib</em> (si usamos el servidor default).</li>
  
<li>Hay que definir la fuente de datos en un fichero xml. Existen ejemplos de 
    fuentes de datos para las BD m&aacute;s usadas, en el directorio <em>docs/examples/jca 
    </em>Un posible ejemplo (para MySQL) es el siguiente:</li>

</ul>
<pre class="code">
&lt;datasources&gt;   
    &lt;local-tx-datasource&gt;
    &lt;jndi-name&gt;MySQLDS&lt;/jndi-name&gt;
    &lt;connection-url&gt;jdbc:mysql://localhost:3306/BD&lt;/connection-url&gt;
    &lt;driver-class&gt;com.mysql.jdbc.Driver&lt;/driver-class&gt;
    &lt;use-java-context&gt;false&lt;/use-java-context&gt;
    &lt;user-name&gt;admin&lt;/user-name&gt;
    &lt;password&gt;admin&lt;/password&gt;
    &lt;/local-tx-datasource&gt;
&lt;/datasources&gt;
</pre>
<ul>
    
<li>
<em>jndi-name</em> es el campo l&oacute;gico ligado a esta fuente de datos.</li>
    
<li>
<em>connection-url </em> es la url tal como la vimos en JDBC</li>
    
<li>
<em>use-java-context </em>Si cierto, esta fuente de datos s&oacute;lo 
      ser&aacute; accesible desde aplicaciones desplegadas en el servidor. La 
      forma de acceder al recurso ser&aacute; con <em>java:MySQLDS</em> Si falso, 
      ser&aacute; accesible desde aplicaciones cliente externas al servidor y 
      se acceder&aacute; con <em>MySQLDS</em>
</li>
    
<li>Nombre y contrase&ntilde;a del usuario de la BD</li>
    
<li>Esta fuente de datos es local y admite transacciones (local-tx-datasource). 
      Existen otros tipos de fuentes de datos. Consultar el manual.</li>
  
</ul>
<p>El fichero anterior se puede llamar, por ejemplo, mysql-ds.xml Se tiene 
    que copiar al directorio <em>deploy</em> del servidor que estemos usando. 
    Una vez desplegado en el servidor, ya ser&aacute; accesible a trav&eacute;s 
    de JNDI.</p>
<p>Ahora vamos a ver c&oacute;mo podemos acceder desde un programa Java. Tanto 
  si nuestra aplicaci&oacute;n es de servidor (se desplegar&aacute; en el servidor) 
  como si es un cliente externo, nuestro c&oacute;digo es el mismo:</p>
<pre class="code">
Context miContexto = new InitialContext (); 
DataSource ds = (DataSource) miContexto.lookup ("java:MySQLDS");</pre>
<p>Si nos fijamos en el nombre, <em>java:MySQLDS</em>, este nombre lo usar&iacute;amos 
  si tenemos el valor de <em>use-java-context</em> a cierto. </p>
<p>En el caso de estar desarrollando una aplicaci&oacute;n externa, debemos hacer 
  dos cosas. La primera es crear un fichero con nombre <em>jndi.properties</em> 
  que lo dejaremos en el classpath de nuestra aplicaci&oacute;n. El contenido 
  del fichero ser&aacute; el siguiente:</p>
<pre class="code">
java.naming.factory.initial=org.jnp.interfaces.NamingContextFactory
java.naming.provider.url=jnp://localhost:1099
java.naming.factory.url.pkgs=org.jboss.naming:org.jnp.interfaces
</pre>
<p>Este fichero indica qu&eacute; clases van a gestionar JNDI y qui&eacute;n va 
  a proporcionar. En el caso de JBoss, el servicio que proporciona el &aacute;rbol 
  JNDI se encuentra en el puerto 1099 del servidor.</p>
<p>Lo segundo que tenemos que hacer es incluir la librer&iacute;a con las clases 
  de JBoss para gestionar JNDI. Debemos incluir en el classpath el fichero
  <em>client/jbossall-client.jar</em>
</p>
</div>

<a name="N10181"></a><a name="Instalaci%C3%B3n+de+la+aplicaci%C3%B3n+Duke%27s+Bank"></a>
<h2 class="underlined_10">Instalaci&oacute;n de la aplicaci&oacute;n Duke's Bank</h2>
<div class="section">
<p>El tutorial de J2EE de Sun incorpora una aplicaci&oacute;n llamada Duke's Bank, 
  que demuestra las posibilidades de varias tecnolog&iacute;as J2EE, tales como 
  EJB, componentes web y acceso a BD, creando una aplicaci&oacute;n de un banco. 
  Como ejemplo, vamos a realizar las tareas necesarias para hacer funcionar esta 
  aplicaci&oacute;n bajo JBoss y poder consultar algunas caracter&iacute;sticas 
  del servidor.</p>
<p>Descargad la plantilla de esta sesi&oacute;n y descomprimidla. La aplicaci&oacute;n 
  se encuentra en un directorio (es un proyecto de Eclipse) llamada DukeBank. 
  La import&aacute;is como proyecto de Eclipse. Editamos el fichero <em>jboss-build.properties</em> 
  y asignamos el valor a la variable <em>jboss.home</em> para que apunte al directorio 
  donde tengamos instalado JBoss. Si usamos un servidor distinto de <em>default</em> 
  debemos indicarlo en la variable <em>jboss.server</em>.</p>
<pre class="code">
# Set the path to the JBoss directory containing the JBoss application server
# (This is the one containing directories like "bin", "client" etc.)

jboss.home=/usr/local/j2ee/jboss

jboss.server=${jboss.home}/server/default
jboss.deploy.dir=${jboss.server}/deploy
</pre>
<p>Ahora vamos a ejecutar algunos comandos del fichero Ant llamado <em>jboss-build.xml</em>. 
  En concreto tenemos que seguir los siguientes pasos:</p>
<ul>
  
<li>
<em>ant -f jboss-build.xml compile</em> Compilamos los fuentes.</li>
  
<li>
<em>ant -f jboss-build.xml package-ejb</em> Empaquetamos los EJBs.</li>
  
<li>
<em>ant -f jboss-build.xml package-web</em> Empaquetamos la web.</li>
  
<li>
<em>ant -f jboss-build.xml assemble-app</em> Empaquetamos la aplicaci&oacute;n 
    completa.</li>
  
<li>La aplicaci&oacute;n usa una BD propia de JBoss: Hypersonic. Primero hay que crear la fuente de datos correspondiente. Vamos a <em>docs/examples/jca</em> y copiamos el fichero <em>hsqldb-ds.xml</em> al directorio de despliegue del servidor. Antes tenemos que editarlo para permitir las conexiones externas. En la l&iacute;nea 88, debemos descomentar el mbean para permitir conexiones externas. Tambi&eacute;n en la l&iacute;nea 16 debemos descomentar esa l&iacute;nea. Una vez desplegada la fuente de datos podemos crear la BD que va a usar la aplicaci&oacute;n. La aplicaci&oacute;n 
    contiene los comandos SQL necesarios para crear la BD (tened en cuenta que 
    JBoss debe estar funcionando): 
    <ul>
      
<li>
<em>ant -f jboss-build.xml db-create-table</em> Crea las tablas.</li>
      
<li>
<em>ant -f jboss-build.xml db-insert</em> Inserta los datos.</li>
      
<li>
<em>ant -f jboss-build.xml db-list</em> Si la creaci&oacute;n ha sido 
        correcta debemos ver un listado con datos.</li>
      
<li>Podemos lanzar un gestor de BD llamado HSQL. Para ello, en la consola 
        <em>jmx</em> vamos a <em>jboss</em>, <em>service=Hypersonic</em> e invocamos 
        a <em>startDatabaseManager</em>. Nos aparecer&aacute; una imagen como 
        la siguiente. Podemos ejecutar comandos SQL para consultar las distintas 
        tablas. </li>
    
</ul>
  
</li>

</ul>
<p>
<img alt="" content-width="12cm" src="imagenes/jboss/jboss20.jpg"></p>
<p>Ya s&oacute;lo queda desplegar la aplicaci&oacute;n. Ejecutamos</p>
<p>
<em>ant -f jboss-build.xml deploy</em>
</p>
<p>Este comando &uacute;nicamente copia el fichero JBossDukesBank.ear en el directorio 
  <em>server/default/deploy</em> que es donde se encuentran las aplicaciones del 
  servidor. Con s&oacute;lo copiar el fichero al cabo de un momento el servidor 
  desplegar&aacute; la aplicaci&oacute;n.</p>
<p>La aplicaci&oacute;n se puede probar de dos maneras distintas. La primera es 
  desde el navegador. Escribimos la direcci&oacute;n http://localhost:8080/bank/main 
  y nos tiene que aparecer una ventana de identificaci&oacute;n como la siguiente:</p>
<p>
<img alt="" content-width="12cm" src="imagenes/jboss/jboss21.jpg"></p>
<p>Podemos usar el cliente 200 con contrase&ntilde;a j2ee. Entramos en la aplicaci&oacute;n, 
  donde podemos consultar las cuentas del cliente y hacer movimientos entre ellas. 
</p>
<p>
<img alt="" content-width="12cm" src="imagenes/jboss/jboss22.jpg"></p>
<p>Vamos a echar un vistazo al &aacute;rbol JNDI del servidor, para comprobar 
  los EJBs de la aplicaci&oacute;n. Para abrir el &aacute;rbol JNDI vamos a la 
  consola <em>jmx, </em>en el apartado <em>jboss</em>, <em>service=JNDIView</em> 
  e invocamos a <em>list().</em> Nos tiene que aparecer una ventana como la siguiente.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/jboss/jboss23.jpg"></p>
<p>La otra forma de usar la aplicaci&oacute;n es con un cliente Java puro. Desde 
  Eclipse, ejecutamos <em>ant -f jboss-build.xml run-client</em> y nos aparecer&aacute; 
  la siguiente aplicaci&oacute;n:</p>
<p>
<img alt="" content-width="12cm" src="imagenes/jboss/jboss24.jpg" width="820"></p>
<p>Tambi&eacute;n podemos consultar los clientes y sus cuentas.</p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
