<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Despliegue de aplicaciones</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores de aplicaciones" src="images/baner_j2ee_der.gif" title="Servidores de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores de aplicaciones</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores de Aplicaciones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 3</div>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Apendice</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion03-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Despliegue de aplicaciones</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Despliegue+de+una+aplicaci%C3%B3n+en+un+fichero+war">Despliegue de una aplicaci&oacute;n en un fichero war</a>
</li>
<li>
<a href="#Despliegue+de+una+aplicaci%C3%B3n+en+un+directorio">Despliegue de una aplicaci&oacute;n en un directorio</a>
</li>
<li>
<a href="#Manejo+y+despliegue+con+Workshop+for+Weblogic">Manejo y despliegue con Workshop for Weblogic</a>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Despliegue+de+una+aplicaci%C3%B3n+en+un+fichero+war"></a>
<h2 class="underlined_10">Despliegue de una aplicaci&oacute;n en un fichero war</h2>
<div class="section">
<p>Para desplegar una aplicaci&oacute;n contenida en un fichero <em>war </em>se 
    procede de la siguiente manera. Primero pinchamos la opci&oacute;n <em>Deployments</em>. Nos aparecer&aacute; una ventana como la 
    siguiente en la cual se nos muestra las aplicaciones disponibles y se nos 
    permite configurar nuevas. Vamos a pinchar en <em>Install</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/64-2005.jpg"> </p>
<p>El primer paso es localizar el fichero que contendr&aacute; nuestra aplicaci&oacute;n. 
    Podemos hacer dos cosas. La primera es pinchar en <em>upload your file</em>, la cual nos permite cargar un fichero. La otra opci&oacute;n es pinchar en <em>localhost</em> y movernos por los directorios de nuestro sistema hasta encontrar el fichero a cargar.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/65-2005.jpg"></p>
<p>Cuando encontremos el fichero, simplemente debemos seleccionarlo y pinchar 
      en <em>Next</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/66-2005.jpg"></p>
<p>La siguiente opci&oacute;n nos indica que tenemos que indicar si es una aplicaci&oacute;n o bien una librer&iacute;a que podr&aacute; ser usada por otras aplicaciones. Pinchamos en <em>Next</em>
</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/67-2005.jpg"> </p>
<p>Ahora nos indica en qu&eacute; servidor o servidores queremos desplegar nuestra 
    aplicaci&oacute;n. Seleccionamos los servidores (deben estar en ejecuci&oacute;n) 
    y pinchamos en <em>Next</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/68-2005.jpg"> </p>
<p>Ahora se nos permite configurar una serie de opciones (mostradas en la siguiente figura). Lo primero es c&oacute;mo queremos que se llame la aplicaci&oacute;n dentro del sistema. Lo siguiente son opciones de seguridad: si queremos que se use la informaci&oacute;n contenida en el descriptor de la aplicaci&oacute;n, configurar nosotros la pol&iacute;tica de privacidad. El &uacute;ltimo grupo de opciones indican d&oacute;nde van a quedar los fuentes (el fichero .war) situados.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/69-2005.jpg"> </p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/70-2005.jpg"> </p>
<p>Hemos llegado a las &uacute;ltimas opciones (ver la siguiente figura) donde le podemos decir que nos lleve a la ventana de configuraci&oacute;n de los despliegues. Seleccionamos esta opci&oacute;n y pinchamos en <em>Finish</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/71-2005.jpg"> </p>
<p>Hemos pasado a la siguiente ventana, a la que podemos llegar desde la opci&oacute;n de <em>Deployments</em>, donde ya nos tiene que aparecer la aplicaci&oacute;n reci&eacute;n desplegada. En esta primera opci&oacute;n podemos modificar el orden de despliegue (<em>Deployment order</em>). Esta opci&oacute;n nos permite configurar cu&aacute;ndo queremos que se despliegue una aplicaci&oacute;n. Si nuestro sistema tiene varias aplicaciones y queremos que una de ellas se despliegue antes que otra (debido a que la segunda necesita alg&uacute;n elemento de la primera), simplemente le damos un valor de orden menor a la primera.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/72-2005.jpg"> </p>
<p>La solapa <em>Configuration -&gt;General</em> nos permite visualizar y modificar parte del contenido del descriptor de la aplicaci&oacute;n.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/73-2005.jpg"> </p>
<p>La solapa <em>Configuration -&gt;Logging</em> permite definir qu&eacute; informaci&oacute;n se genera de la aplicaci&oacute;n (fichero log) y de qu&eacute; forma se guarda. </p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/74-2005.jpg"> </p>
<p>La solapa de seguridad la veremos m&aacute;s adelante. La solapa <em>Targets</em> permite modificar los servidores o cluster donde se despliega esta aplicaci&oacute;n.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/75-2005.jpg"> </p>
<p>Pasamos a <em>Control</em>, donde podemos poner en marcha o parar una aplicaci&oacute;n. Tenemos los botones de <em>Start</em> y <em>Stop</em>. Dentro del primero podemos arrancar la aplicaci&oacute;n para que responda a todas las peticiones o s&oacute;lo a las administrativas (para configurar la aplicaci&oacute;n). En la opci&oacute;n de parar, podemos elegir entre parar cuando el trabajo de la aplicaci&oacute;n termine, forzar la parada ahora o parar al servidor pero permitir conexiones de administraci&oacute;n.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/76-2005.jpg"> </p>
<p>Si pinchamos en <em>Start</em> nos pedir&aacute; confirmaci&oacute;n de lo que queremos hacer (siguiente figura).</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/77-2005.jpg"> </p>
<p>La opci&oacute;n de <em>Testing</em> permite probar la aplicaci&oacute;n. Si nos fijamos, nos est&aacute; diciendo la url asociada a la aplicaci&oacute;n, incluso su p&aacute;gina principal.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/79-2005.jpg"> </p>
<p>La aplicaci&oacute;n desplegada responde en el servidor <em>adminserver</em>. Tenemos que poner el puerto de escucha.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/78-2005.jpg"> </p>
<p>Por &uacute;ltimo, la solapa de <em>Monitoring</em> nos permite monitorizar el estado de la aplicaci&oacute;n, indic&aacute;ndonos, entre otros, los servlets que contiene la aplicaci&oacute;n o el n&uacute;mero de sesiones abiertas.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/80-2005.jpg"> </p>
<p>Siguiendo con las opciones de monitorizado, <em>Servlets</em> nos permite echar un vistazo a los servlets de la aplicaci&oacute;n, su tiempo de respuesta, etc.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/81-2005.jpg"> </p>
<p>Tambi&eacute;n se puede monitorizar las sesiones.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/82-2005.jpg"> </p>
</div>

<a name="N1010D"></a><a name="Despliegue+de+una+aplicaci%C3%B3n+en+un+directorio"></a>
<h2 class="underlined_10">Despliegue de una aplicaci&oacute;n en un directorio</h2>
<div class="section">
<p>Si tenemos una aplicaci&oacute;n en un directorio, podemos desplegarla directamente. Lo que hace WebLogic es copiarla a un directorio de despliegue. Cualquier modificaci&oacute;n que hagamos en el directorio original no se ver&aacute; reflejada en la aplicaci&oacute;n. La aplicaci&oacute;n sin comprimir la podemos dejar en cualquier 
    directorio del sistema. Seguimos los mismos pasos que para una aplicaci&oacute;n en un fichero: creamos una nueva aplicaci&oacute;n y buscamos el directorio donde tenemos la aplicaci&oacute;n. Nos aparecer&aacute; un icono distinto a la aplicaci&oacute;n desplegada como fichero comprimido.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/83-2005.jpg"></p>
<p>Sin embargo, algunas veces es necesario tener desplegada la aplicaci&oacute;n e ir modificando el fichero de descripci&oacute;n u otras partes de la aplicaci&oacute;n. Esto lo podemos hacer en modo desarrollo. Existe un directorio, dentro del dominio, llamado <em>autodeploy</em>. En este directorio, cualquier aplicaci&oacute;n, tanto en fichero comprimido como en directorio, que copiemos aparecer&aacute; en la lista de aplicaciones desplegadas. Si nos fijamos en la lista de aplicaciones de la siguiente figura veremos que indica que la aplicaci&oacute;n ha sido <em>autodeployed</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/84-2005.jpg"></p>
</div>

<a name="N1012C"></a><a name="Manejo+y+despliegue+con+Workshop+for+Weblogic"></a>
<h2 class="underlined_10">Manejo y despliegue con Workshop for Weblogic</h2>
<div class="section">
<p>El Workshop es un conjunto de plugins para Eclipse que permiten una integraci&oacute;n completa con
Weblogic. Para empezar a trabajar con &eacute;l, lo arrancamos desde <em>Bea Products-&gt;Workshop for Weblogic
Platform</em>. Podemos crear un nuevo proyecto con las configuraciones necesarias seg&uacute;n el tipo
de aplicaci&oacute;n a realizar: servicio web, aplicaci&oacute;n web, EJB, etc.</p>
<p>
<img alt="" content-width="10cm" src="imagenes/administracion/109-2007.jpg"></p>
<p>Si pinchamos con el bot&oacute;n derecho en un proyecto y le decimos <em>Run as...</em> nos aparecer&aacute;
una ventana como la mostrada en la siguiente figura. En ella podemos elegir entre ejecutar
la aplicaci&oacute;n del proyecto actual en un servidor existente o bien crear un nuevo servidor (Apache
o Weblogic). Dentro de Weblogic nos permite incluso buscar otras versiones instaladas. </p>
<p>
<img alt="" content-width="6cm" src="imagenes/administracion/110-2007.jpg"></p>
<p>A continuaci&oacute;n nos permite elegir un dominio ya definido o bien crear un nuevo dominio (simplemente,
llama a la aplicaci&oacute;n de Weblogic para crear el dominio).</p>
<p>
<img alt="" content-width="6cm" src="imagenes/administracion/111-2007.jpg"></p>
<p>Despu&eacute;s se nos permite elegir qu&eacute; aplicaciones tienen que ejecutarse en este servidor.</p>
<p>
<img alt="" content-width="6cm" src="imagenes/administracion/112-2007.jpg"></p>
<p>En la parte inferior, nos aparece una solapa, <em>Servers</em>, que nos permite arrancar y/o parar 
servidores y desplegar, redesplegar o parar aplicaciones.</p>
<p>
<img alt="" content-width="6cm" src="imagenes/administracion/113-2007.jpg"></p>
<p>Al crear un nuevo proyecto, Workshop incluye las librer&iacute;as necesarias para funcionar dentro
de Weblogic. Si tenemos una aplicaci&oacute;n que corre en otro servidor y queremos pasarla a Weblogic
usando Workshop, s&oacute;lo tendremos que copiar las clases .java y los ficheros de configuraci&oacute;n
y de presentaci&oacute;n (html, jsp, etc.).</p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
