<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Administraci&oacute;n del servidor de aplicaciones</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores de aplicaciones" src="images/baner_j2ee_der.gif" title="Servidores de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores de aplicaciones</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores de Aplicaciones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 2</div>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Apendice</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion02-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Administraci&oacute;n del servidor de aplicaciones</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Revisi%C3%B3n+de+conceptos">Revisi&oacute;n de conceptos </a>
</li>
<li>
<a href="#Creaci%C3%B3n+y+configuraci%C3%B3n+de+dominio">Creaci&oacute;n y configuraci&oacute;n de dominio</a>
<ul class="minitoc">
<li>
<a href="#Arranque+de+servidores">Arranque de servidores</a>
</li>
<li>
<a href="#Definici%C3%B3n+de+servidores+dentro+del+dominio">Definici&oacute;n de servidores dentro del dominio</a>
</li>
<li>
<a href="#Definici%C3%B3n+de+m%C3%A1quinas">Definici&oacute;n de m&aacute;quinas</a>
</li>
</ul>
</li>
<li>
<a href="#Administraci%C3%B3n+desde+l%C3%ADnea+de+comandos">Administraci&oacute;n desde l&iacute;nea de comandos</a>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Revisi%C3%B3n+de+conceptos"></a>
<h2 class="underlined_10">Revisi&oacute;n de conceptos </h2>
<div class="section">
<p>Vamos a revisar algunos de los conceptos ya vistos con anterioridad. Dentro 
  de un dominio debemos disponer de un servidor de administraci&oacute;n. Este 
  servidor se encargar&aacute;, entre otras, de las siguientes tareas:</p>
<ul>
  
<li> Mantenimiento del fichero de log. Todos los mensajes de los distintos servidores 
    as&iacute; como los propios del dominio se almacenar&aacute;n en el fichero 
    log del dominio.</li>
  
<li>Leer y escribir en el fichero <em>config.xml</em>. Este fichero contiene toda 
    la configuraci&oacute;n del dominio (nombre de los servidores, puertos, aplicaciones 
    disponibles, etc.).</li>
  
<li>Proporciona informaci&oacute;n de configuraci&oacute;n cuando arrancan los 
    servidores administrados. Por ello, el servidor de administraci&oacute;n debe 
    estar en marcha cuando arranquen el resto de servidores. Una vez arrancados 
    todos podemos parar el de administraci&oacute;n. </li>
  
<li>Permite monitorizar el comportamiento de los servidores y cambiar su configuraci&oacute;n.</li>

</ul>
<p>
<img alt="" src="imagenes/cuarta.jpg"></p>
</div>

<a name="N1002D"></a><a name="Creaci%C3%B3n+y+configuraci%C3%B3n+de+dominio"></a>
<h2 class="underlined_10">Creaci&oacute;n y configuraci&oacute;n de dominio</h2>
<div class="section">
<p>Como ya hemos visto anteriormente, WebLogic incorpora una herramienta para 
  crear el dominio, definiendo los servidores que formar&aacute;n parte del dominio. 
  Si necesitamos a&ntilde;adir nuevos servidores veremos m&aacute;s adelante que 
  podemos hacer uso de la consola de administraci&oacute;n.</p>
<a name="N10036"></a><a name="Arranque+de+servidores"></a>
<h3 class="underlined_5">Arranque de servidores</h3>
<p>Una vez creado el dominio junto con sus servidores, cuando arrancamos un servidor 
  nos va a pedir el nombre y la contrase&ntilde;a del usuario de administraci&oacute;n. El servidor 
  de administraci&oacute;n se arranca simplemente ejecutando <em>startWebLogic.cmd</em>. 
  Para los servidores administrados debemos indicar la direcci&oacute;n del servidor 
  de administraci&oacute;n:</p>
<pre class="code">bin/startManagedServer.cmd servidor2 http://localhost:7001</pre>
<p>donde <em>servidor2</em> es el nombre del servidor que queremos arrancar y a 
  continuaci&oacute;n indicamos la direcci&oacute;n y el puerto de escucha del 
  servidor de administraci&oacute;n. </p>
<a name="N1004D"></a><a name="Definici%C3%B3n+de+servidores+dentro+del+dominio"></a>
<h3 class="underlined_5">Definici&oacute;n de servidores dentro del dominio</h3>
<p>Un servidor de aplicaciones no es m&aacute;s que una instancia de la clase 
  <em>weblogic.Server</em>. Vamos a ver c&oacute;mo podemos crear nuevos servidores desde
  la consola de administraci&oacute;n.
  Pinchamos en la opci&oacute;n <em>servers</em> (desde la estructura de dominio, dentro de <em>environment</em> o desde la p&aacute;gina inicial) y nos aparecer&aacute; una p&aacute;gina 
  como la siguiente donde tenemos los servidores definidos en nuestro dominio 
  y podemos definir nuevos.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/44-2005.jpg"> </p>
<p>Podemos hacer tres cosas: crear un nuevo servidor, clonar o borrar uno ya existente (seleccion&aacute;ndolo antes). 
  Recordad que debemos pinchar en <em>Lock and Edit</em> para editar.</p>
<p>Si pinchamos en crear uno nuevo (<em>New</em>) nos aparece la siguiente ventana:</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/45-2007.jpg"> </p>
<p>Aqu&iacute; damos el nombre, direcci&oacute;n y puerto de escucha. Dejamos para m&aacute;s adelante
  lo referente al cluster. El servidor nos aparecer&aacute; en la lista de servidores y podemos pasar a configurarlo. Esto lo podemos hacer para cualquier servidor en nuestro dominio. Pinchamos sobre el nombre del servidor y nos aparecer&aacute; esta ventana:</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/46-2005.jpg"> </p>
<p>Las opciones disponibles son:</p>
<ul>
  
<li>
<strong>Name</strong>: el nombre del servidor. Debe ser &uacute;nico en el dominio.</li>
  
<li>
<strong>Machine</strong>: si ya tenemos definidas m&aacute;quinas podemos asignar 
    este servidor a una de ellas. Esta operaci&oacute;n la podemos hacer m&aacute;s 
    adelante.</li>
  
<li>
<strong>Cluster</strong>: &iacute;dem al anterior pero con los clusters.</li>
  
<li>
<strong>Listen Address</strong>: la direcci&oacute;n (IP o DNS) de escucha del servidor. 
  </li>
  
<li>
<strong>Listen Port Enabled</strong>: al activar esta opci&oacute;n permitimos la 
    escucha por un puerto.</li>
  
<li>
<strong>Listen Port</strong>: el puerto de escucha del servidor. Dos servidores en 
    la misma m&aacute;quina no pueden tener el mismo puerto de escucha. </li>
  
<li>
<strong>SSL Listen Port Enabled:</strong> nos permite activar el puerto 
    de escucha con protocolo seguro.</li>
  
<li>
<strong>SSL Listen Port</strong>: El puerto de escucha seguro.</li>
  
<li>
<strong>Client Cert Proxy Enabled</strong>: con esta opci&oacute;n especificamos 
    que se env&iacute;e un encabezado especial con el certificado del cliente.</li>
  
<li>
<strong>Java Compiler</strong>: indica el compilador de java a emplear en 
    todas las aplicaciones de este servidor.</li>

</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/47-2005.jpg"> </p>
<p>Sin pinchamos en opciones avanzadas nos aparecen las opciones mostradas en la anterior figura (comentamos las m&aacute;s utilizadas):</p>
<ul>
  
<li>
<strong>Startup Mode:</strong> Podemos arrancar un servidor en dos modos: 
    RUNNING en el cual se ejecuta normalmente y STANDBY en el que permite comandos 
    del servidor de administraci&oacute;n pero no reponde a peticiones de sus 
    aplicaciones.</li>
  
<li>
<strong>Prepend/append to classpath:</strong> directorios a a&ntilde;adir 
    antes o despu&eacute;s del CLASSPATH actual.</li>
  
<li>
<strong>External Listen Address:</strong> es la direcci&oacute;n de escucha 
    tal como se ve desde fuera de nuestro sistema.</li>

</ul>
<p>Nos saltamos las siguientes solapas hasta <em>Health Monitoring</em>:</p>
<ul>
  
<li>
<strong>Auto Restart</strong>: indica que el servidor se intentar&aacute; 
    reiniciar despu&eacute;s de un fallo.</li>
  
<li>
<strong>Auto Kill if Failed</strong>: si la activamos, el <em>node manager</em> 
    matar&aacute; al servidor si este ha tenido alg&uacute;n fallo.</li>
  
<li>
<strong>Max Restarts Within Interval:</strong> n&uacute;mero de veces que 
    se intentar&aacute; reiniciar al servidor durante un intervalo de tiempo predefinido.</li>
  
<li>
<strong>Restart Delay Seconds:</strong> numero de segundos a esperar antes 
    de intentar reiniciar.</li>

</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/48-2005.jpg"></p>
<p>Pasamos a la solapa de protocolos. En la subsolapa de HTTP tenemos 
  las siguientes opciones:</p>
<ul>
  
<li>
<strong>Post Timeout/Max Post Size:</strong> se utiliza para prevenir los 
    ataques DoS. Un ataque DoS (<em>Denial of Service</em>: denegaci&oacute;n de 
    servicio) tiene como consecuencia la ca&iacute;da del servidor. Lo suelen 
    utilizar <em>hackers</em> para echar abajo un sistema. El ataque puede ser llevado 
    a cabo de dos maneras: 
    <ul>
      
<li>Por el env&iacute;o de sucesivos paquetes incompletos. Cuando enviamos 
        un paquete incompleto, el servidor queda esperando el resto del paquete. 
        El env&iacute;o de muchos de estos paquetes puede colapsar el servidor. 
        Para combatir este tipo de ataque debemos configurar <strong>Post Timeout </strong> 
        que es el tiempo de espera m&aacute;ximo para recibir el siguiente paquete.</li>
      
<li>Por el env&iacute;o de un paquete de datos demasiado grande que sobrepasa 
        la memoria del sistema. La protecci&oacute;n que podemos realizar es indicar 
        en la opci&oacute;n <strong>Max Post Size</strong> el tama&ntilde;o m&aacute;ximo 
        de paquete a recibir. Por defecto est&aacute; en -1 que indica que no 
        existe limitaci&oacute;nd e tama&ntilde;o.</li>
    
</ul>
  
</li>
  
<li>
<strong>Enable Keepalives</strong>: permite el mantenimiento de una conexi&oacute;n 
    permanente al servidor.</li>
  
<li>
<strong>Duration</strong>: tiempo transcurrido antes de cerrar una conexi&oacute;n 
    inactiva.</li>
  
<li>
<strong>HTTPS Duration:</strong> &iacute;dem conexi&oacute;n segura.</li>

</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/49-2005.jpg"></p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/50-2005.jpg"></p>
<p>En la solapa <em>Logging</em> podemos configurar las opciones del fichero que 
  contendr&aacute; los mensajes del servidor. En la siguiente figura se muestran 
  los datos m&aacute;s gen&eacute;ricos, ya explicados en el apartado del log 
  de dominio. La siguiente 
  solapa, <em>Rotation Type</em>, permite modificar el tipo de rotaci&oacute;n del 
  fichero log. Las opciones tambi&eacute;n se detallaron anteriormente. La &uacute;ltima opci&oacute;n, <em>Rotate file rotation on startup</em>, indica que nada m&aacute;s arrancar el servidor
se inicializa el fichero log.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/51-2005.jpg"> </p>
<p>Las opciones avanzadas del logging nos permiten monitorizar los mensajes de error, seg&uacute;n el tipo y el nivel de seguridad: <em>Stdout severity threshold</em> permite cambiar 
	  el nivel de error que muestra los mensajes. Por defecto se mostrar&aacute; un 
	  mensaje si existe un error. Podemos bajar o subir el nivel de error para que 
	  muestre un mensaje, por ejemplo, cuando existe una advertencia. </p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/52-2005.jpg"> </p>
<p>En <em>Debug</em> se nos permite seleccionar qu&eacute; opciones (servicios, elementos, etc.) de nuestro sistema y servidor queremos que se monitorice. Advertencia: hay que tener mucho cuidado con seleccionar JDBC: el nivel de informaci&oacute;n puede desbordar nuestro disco.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/53-2005.jpg"> </p>
<p>En <em>Monitoring, </em>pinchamos en las opciones avanzadas y nos proporciona 
  toda la informaci&oacute;n tanto del servidor de aplicaciones como del sistema 
  operativo y Java (el servidor tiene que estar activo para que nos proporcione esta
  informaci&oacute;n).</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/54-2007.jpg"></p>
<p>La opci&oacute;n <em>Health</em> nos muestra el funcionamiento de distintos servicios. Para cada uno nos proporciona informaci&oacute;n indicando si algo ha fallado.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/55-2005.jpg"></p>
<p>
<em>Workload</em> nos indica el trabajo realizado y el pendiente por realizar de algunas clases.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/56-2005.jpg"></p>
<p>La solapa <em>Security</em> nos permite monitorizar los intentos de entrada al 
  sistema inv&aacute;lidos y el n&uacute;mero de usuarios bloqueados. Puede servir 
  para monitorizar intentos de acceso inv&aacute;lidos.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/57-2005.jpg"> </p>
<p>En la solapa <em>Control-&gt;Start/Stop</em> podemos arrancar y parar el servidor 
en distintos modos. La opci&oacute;n <em>Graceful Shutdown timeout</em> indica el tiempo 
que esperaremos antes de forzar el apagado del servidor (siempre con el apagado <em>Graceful</em> que espera a que todas las sesiones HTTP hayan terminado). Indicando el valor cero estamos diciendo que esperar&aacute; indefinidamente. Si activamos la <em>Ignore Sessions During Shutdown</em>, no se tendr&aacute;n en cuenta las sesiones. Tambi&eacute;n podemos asignar un tiempo de espera antes del arranque. M&aacute;s abajo tenemos las opciones de arranque y parada. La primera que nos aparece (<em>Start</em>) arranca el servidor (para hacerlo necesitaremos el Node Manager). La segunda reinicia el servidor. <em>Suspend</em> puede suspender la ejecuci&oacute;n del servidor ahora mismo o dejarlo terminar la tarea actual. <em>Shutdown</em> para el servidor, permitiendo igual que antes forzarlo o esperar a que termine.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/58-2005.jpg"></p>
<a name="N101B4"></a><a name="Definici%C3%B3n+de+m%C3%A1quinas"></a>
<h3 class="underlined_5">Definici&oacute;n de m&aacute;quinas</h3>
<p>Una m&aacute;quina es un reflejo de una m&aacute;quina f&iacute;sica que soporta 
  nuestro sistema. Weblogic se puede instalar en multitud de plataformas (Unix, 
  Windows, Solaris, etc.). Una de las principales ventajas de Weblogic es que 
  se pueden utilizar distintos tipos de m&aacute;quinas en el mismo sistema. Por 
  ejemplo, podemos tener una m&aacute;quina Linux con un par de servidores y otra 
  m&aacute;quina Windows NT con otro par, funcionando todo dentro del mismo dominio 
  y dando el mismo servicio. Cuando pinchamos en la opci&oacute;n <em>Machines</em> nos 
  permite visualizar las m&aacute;quinas que tiene nuestro sistema y tambi&eacute;n 
  nos permite configurar nuevas m&aacute;quinas. </p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/59-2005.jpg"></p>
<p>Cuando pinchamos en <em>New</em> nos aparece la figura 
  siguiente donde podemos dar nombre a la m&aacute;quina. Este nombre es propio 
  de Weblogic, es decir, no es nombre DNS ni IP. Podemos configurar una m&aacute;quina 
  de tipo Unix (Linux, etc.) o un tipo distinto de m&aacute;quina.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/60-2005.jpg"></p>
<p>La diferencia es que en las m&aacute;quinas de tipo Unix nos permite configurar opciones adicionales (en las otras s&oacute;lo nos deja el nombre). Las siguientes opciones, que 
s&oacute;lo aparecen en m&aacute;quinas Unix, son el nombre de usuario y de 
grupo con los que se ejecutar&aacute;n los procesos instanciados en esa m&aacute;quina.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/61-2005.jpg"></p>
<p>Para asignar servidores a una m&aacute;quina, nos iremos a cada servidor y en la pesta&ntilde;a de <em>Configuration-&gt;General</em> asociamos ese servidor a esa m&aacute;quina.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/62-2005.jpg"></p>
<p>De vuelta a las m&aacute;quinas, los servidores asociados a esta m&aacute;quina aparecer&aacute;n en la pesta&ntilde;a <em>Configuration-&gt;servers</em>.
Desde este punto tambi&eacute;n podemos a&ntilde;adir servidores a la m&aacute;quina.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/63-2007.jpg"></p>
<p>Para a&ntilde;adir servidores, pinchamos en <em>Add</em> y seleccionamos los servidores que queramos
a&ntilde;adir.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/631-2007.jpg"></p>
</div>

<a name="N10201"></a><a name="Administraci%C3%B3n+desde+l%C3%ADnea+de+comandos"></a>
<h2 class="underlined_10">Administraci&oacute;n desde l&iacute;nea de comandos</h2>
<div class="section">
<p>La administraci&oacute;n desde l&iacute;nea de comandos es una herramienta 
    &uacute;til para el control del sistema. Nos permite realizar varias tareas 
    de monitorizaci&oacute;n y comprobaci&oacute;n del sistema. Tambi&eacute;n 
    es &uacute;til en modo producci&oacute;n, pues normalmente se deshabilita 
    la consola de administraci&oacute;n por motivos de seguridad.</p>
<p>El comando a ejecutar es el siguiente:</p>
<pre class="code">java -cp $BEA_HOME/weblogic92/server/lib/weblogic.jar weblogic.Admin -url URL 
   -username usuario -password contrase&ntilde;a COMANDO argumentos</pre>
<p>El comando no es m&aacute;s que una llamada a la clase <em>weblogic.Admin</em> 
    que se encuentra en el fichero <em>weblogic.jar</em> proporcionado por BEA. 
    El par&aacute;metro URL especifica la direcci&oacute;n URL del servidor de 
    administraci&oacute;n o bien del servidor contra el que vayamos a realizar 
    el comando. Debemos especificar tambi&eacute;n el puerto en la direcci&oacute;n. 
    El usuario y su contrase&ntilde;a asociada deben ser v&aacute;lidos para el 
    comando que vamos a ejecutar. Los posibles comandos a utilizar pueden ser 
    algunos de los siguientes:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	  
<tr>
<td colspan="1" rowspan="1"></td><td colspan="1" rowspan="1"></td><td colspan="1" rowspan="1"></td><td colspan="1" rowspan="1"></td>
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>CONNECT</strong></td>
      <td colspan="3" rowspan="1">Realiza el especificado n&uacute;mero de conexiones y devuelve 
        el tiempo (en milisegundos) total y medio de conexi&oacute;n.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic CONNECT 25</em>

<pre class="code">
Connection: 0 - 18 ms
Connection: 1 - 7 ms
Connection: 2 - 7 ms
Connection: 3 - 7 ms
Connection: 4 - 9 ms
Connection: 5 - 7 ms
Connection: 6 - 10 ms</pre>
</td>

</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
	    
<td colspan="1" rowspan="1">
<p>
<strong>DISCOVERMANAG</strong>
</p>
		    
<p>
<strong>EDSERVER</strong>
</p>
</td>
      <td colspan="3" rowspan="1">Provoca que el servidor de administraci&oacute;n reestablezca el control 
        administrativo sobre los servidores administrados.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username system -password 
        weblogic DISCOVERMANAGEDSERVER -serverName servidor2 -listenPort 6001 
        -listenAddress localhost </em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>FORCESHUTDOWN</strong></td>
      <td colspan="3" rowspan="1">Termina de forma inmediata un proceso servidor pasado como 
        argumento. </td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic FORCESHUTDOWN servidor2</em>

<pre class="code">Server "servidor2" was force shutdown successfully ...
</pre>
</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>GETSTATE</strong></td>
      <td colspan="3" rowspan="1">Devuelve el estado del servidor pasado como argumento. </td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic GETSTATE servidor2</em>

<pre class="code">Current state of "servidor2" : RUNNING
</pre>
</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>HELP</strong></td>
      <td colspan="3" rowspan="1">Muestra ayuda de un comando o de todos (ALL).</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic HELP GETSTATE</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>LICENSES</strong></td>
      <td colspan="3" rowspan="1">Lista las licencias instaladas en la m&aacute;quina.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic LICENSES</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>PING</strong></td>
      <td colspan="3" rowspan="1">Env&iacute;a un mensaje para verificar que un servidor est&aacute; 
        disponible y aceptando peticiones. Opcionalmente podemos pasarle dos argumentos: 
        el n&uacute;mero de veces intentos y el tama&ntilde;o de cada paquete.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic PING 10 1000</em>

<pre class="code">Sending 10 pings of 1.000 bytes.
	
RTT = ~185 milliseconds, or ~18 milliseconds/packet
</pre>
</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>SERVERLOG</strong></td>
      <td colspan="3" rowspan="1">Muestra el fichero log de un servidor. Se puede especificar 
        un intervalo de tiempo a mostrar. En el ejemplo se muestra desde las 14:00 
        horas del 24 de diciembre a las 10:00 horas del 31 de diciembre.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic SERVERLOG "2002/12/24 14:00" "2002/12/31 
        10:00" </em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>SHUTDOWN</strong></td>
      <td colspan="3" rowspan="1">Para la ejecuci&oacute;n de un servidor (<em>Graceful</em>). 
        Podemos especificar los mismo par&aacute;metros que desde la consola: 
        que ignore las sesiones abiertas y el <em>timeout </em>en segundos que 
        esperar&aacute; antes de pararlo.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic SHUTDOWN -ignoreExistingSessions -timeout 10 
        servidor1</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>START</strong></td>
      <td colspan="3" rowspan="1">Arranca un servidor si tenemos disponible el Node Manager. 
      </td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic START servidor1</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>THREAD_DUMP</strong></td>
      <td colspan="3" rowspan="1">Muestra informaci&oacute;n de los hilos de ejecuci&oacute;n que se est&aacute;n 
        ejecutando en el servidor, por la salida est&aacute;ndar de este. </td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username system -password 
        weblogic THREAD_DUMP servidor1</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>VERSION</strong></td>
      <td colspan="3" rowspan="1">Muestra la versi&oacute;n del software Weblogic.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1"><em>java weblogic.Admin -url t3://localhost:7001 -username 
        system -password weblogic VERSION</em></td>
    
</tr>
  
</table>
<p>Existen otros comandos y utilidades adicionales que se detallan a continuaci&oacute;n. 
    En todos ellos hace falta incluir el fichero <em>weblogic.jar</em> en el classpath.</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
	  
<tr>
<td colspan="1" rowspan="1"></td><td colspan="1" rowspan="1"></td><td colspan="1" rowspan="1"></td><td colspan="1" rowspan="1"></td>
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>dbping</strong></td>
      <td colspan="3" rowspan="1">Realiza una conexi&oacute;n a la base de datos especificada 
        utilizando una clase de las proporcionadas por WebLogic.</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">java utils.dbping ORACLE_THIN system oracle localhost:1521:j2eebd 
        <p>**** Success!!! ****</p>
        
<p>You can connect to the database in your app using:</p>
        
<p> java.util.Properties props = new java.util.Properties();
          props.put("user", "system");
          props.put("password", "oracle");</p>
</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>system</strong></td>
      <td colspan="3" rowspan="1">Obtiene informaci&oacute;n del sistema: la versi&oacute;n 
        y el desarrollador de Java, el classpath, el nombre, arquitectura y versi&oacute;n 
        del sistema operativo</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1">java utils.system 
        <p>* * * * * * * java.version * * * * * * *
          1.4.2_01</p>
        
<p>* * * * * * * java.vendor * * * * * * *
          Sun Microsystems Inc.</p>
        
<p>* * * * * * * java.class.path * * * * * * *
          weblogic.jar</p>
        
<p>* * * * * * * os.name * * * * * * *
          Windows XP</p>
        
<p>* * * * * * * os.arch * * * * * * *
          x86</p>
        
<p>* * * * * * * os.version * * * * * * *
          5.1</p>
</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>myip</strong></td>
      <td colspan="3" rowspan="1">Obtiene la direcci&oacute;n IP y el nombre DNS de la m&aacute;quina</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo</td>
      <td colspan="3" rowspan="1">java utils.myip
        Host portatil-miguel is assigned IP address: 169.254.100.36</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">&nbsp;</td>
      <td colspan="3" rowspan="1">&nbsp;</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>Deployer</strong></td>
      <td colspan="3" rowspan="1">Controla el despliegue de aplicaciones</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo:
        desplegar una aplicaci&oacute;n</td>
<td colspan="3" rowspan="1"> 
<p>java weblogic.Deployer -adminurl t3://localhost:7001 
          -username system -password weblogic -name faqs -targets adminServer,servidor2 
          -deploy c:/myapps/faqs.war</p>
</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo: eliminar una aplicaci&oacute;n</td>
      <td colspan="3" rowspan="1">
<p>java weblogic.Deployer -adminurl t3://localhost:7001 
          -username system -password weblogic -name faqs -targets adminServer 
          -undeploy </p>
</td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">ejemplo: reactivar una aplicaci&oacute;n</td>
      <td colspan="3" rowspan="1">
<p>java weblogic.Deployer -adminurl t3://localhost:7001 
          -username system -password weblogic -name faqs -targets adminServer 
          -redeploy </p>
</td>
    
</tr>
  
</table>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
