<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Creaci&oacute;n de un cluster</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores de aplicaciones" src="images/baner_j2ee_der.gif" title="Servidores de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores de aplicaciones</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores de Aplicaciones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 5</div>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Apendice</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion05-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Creaci&oacute;n de un cluster</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n">Introducci&oacute;n</a>
</li>
<li>
<a href="#Uso+del+NodeManager">Uso del NodeManager</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+b%C3%A1sica+de+un+cluster">Configuraci&oacute;n b&aacute;sica de un cluster</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+de+un+servidor+proxy">Configuraci&oacute;n de un servidor proxy</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+de+la+replicaci%C3%B3n+de+memoria">Configuraci&oacute;n de la replicaci&oacute;n de memoria</a>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Introducci%C3%B3n"></a>
<h2 class="underlined_10">Introducci&oacute;n</h2>
<div class="section">
<p>Este tema contiene las instrucciones b&aacute;sicas para obtener las caracter&iacute;sticas 
  m&aacute;s potentes de un servidor de aplicaciones: la escalabilidad y la recuperaci&oacute;n 
  ante fallos. Para ello aprenderemos a configurar un cluster y determinadas caracter&iacute;sticas 
  adicionales como un servidor proxy y la replicaci&oacute;n de memoria.</p>
<p>Un cluster es una asociaci&oacute;n de servidores WebLogic que act&uacute;an 
  como si fueran uno solo. Una aplicaci&oacute;n desplegada en un cluster 
  es respondida por cada servidor dentro del cluster. Si nuestro sistema observa 
  un aumento en el n&uacute;mero de peticiones, podemos incorporar nuevos servidores 
  para soportar dicho aumento. Otra caracter&iacute;stica, la recuperaci&oacute;n 
  ante fallos, es muy importante en sistemas de alta disponibilidad. WebLogic 
  nos va a permitir replicar las sesiones HTTP e incluso los servicios (por ejemplo, 
  JDBC) para que se permita realizar copias de las sesiones en otros servidores. 
  De esta forma, si el servidor que est&aacute; sirviendo actualmente tiene alg&uacute;n 
  problema o no responde, el servidor que contiene la copia de la sesi&oacute;n 
  puede seguir respondiendo sin necesidad de comenzar una nueva sesi&oacute;n.</p>
</div>

<a name="N10019"></a><a name="Uso+del+NodeManager"></a>
<h2 class="underlined_10">Uso del NodeManager</h2>
<div class="section">
<p>Como ya hemos visto, un servidor de aplicaciones no es m&aacute;s que una instancia 
  de la clase weblogic.Server. El NodeManager es una clase Java que nos va a permitir 
  instanciar otras clases y as&iacute; poder arrancar los servidores de aplicaciones. 
  En concreto nos va a permitir arrancar servidores administrados uno a uno, todo 
  un cluster o un dominio a la vez. El NodeManager es independiente del servidor 
  de aplicaciones y debemos instanciar uno por cada m&aacute;quina f&iacute;sica 
  que contenga servidores administrados. Recibe peticiones directamente del servidor 
  de administraci&oacute;n a trav&eacute;s de la consola y puede ser ejecutado 
  como un demonio Unix o un servicio Windows. </p>
<p>
<img alt="" content-width="10cm" src="imagenes/quinta.jpg"></p>
<p>El NodeManager realiza las tareas mostradas en la anterior figura: permite 
  arrancar un servidor que se encuentre en su m&aacute;quina; forzar su paro (s&oacute;lo 
  para casos en los que no responda) y pararlo. Esta &uacute;ltima opci&oacute;n, 
  la de paro normal, tambi&eacute;n la puede realizar el servidor de administraci&oacute;n 
  directamente.</p>
<p>Para configurar el NodeManager debemos seguir los siguientes pasos:</p>
<ol>
  
<li>
<p>Configurar el NodeManager y arrancarlo en todas las m&aacute;quinas. Para 
    ello vamos a configurar el script de arranque. En las m&aacute;quinas de la EPS, debemos
    quitar el <em>path</em> de Windows, por problemas a la hora de ejecutar. Abrimos
    el fichero $WEBLOGIC/common/bin/commonEnv.cmd y de la l&iacute;nea que empieza <em>
    if "%WL_USE_X86DLL%"</em> quitamos la referencia a %PATH%.</p>

<p>Por cuestiones de seguridad, desde la versi&oacute;n 9.0 WebLogic obliga a suscribir cada m&aacute;quina 
con el servidor de administraci&oacute;n. En este proceso se pretende copiar en cada 
m&aacute;quina del dominio los ficheros de configuraci&oacute;n necesarios 
(seguridad, configuraci&oacute;n, etc.) para que cuando nos conectemos con el nodemanager, 
&eacute;ste tenga los datos necesarios para el arranque. Para realizar esta suscripci&oacute;n 
vamos a usar una herramienta que proporciona WebLogic, el 
WLST (<em>WebLogic Scripting Tool</em>). Para arrancar esta herramienta 
ejecutamos:</p>

<pre class="code">
java -cp weblogic.jar weblogic.WLST
</pre>

<p>o bien, si estamos en Windows, en Programas-&gt;Bea products-&gt;Tools-&gt;Weblogic Scripting
tool. Nos aparecer&aacute; un <em>prompt</em> en el cual podemos introducir comandos:</p>

<pre class="code">
wls:/offline&gt;
</pre>

<p>Debemos tener el servidor de administraci&oacute;n funcionando (IMPORTANTE: comprobad que la 
direcci&oacute;n de escucha del servidor de administraci&oacute;n es la correcta). 
Primero nos tenemos que conectar con el servidor de administraci&oacute;n, indicando 
el usuario de administraci&oacute;n y su contrase&ntilde;a, as&iacute; como la direcci&oacute;n de escucha 
del servidor de adminitraci&oacute;n. Despu&eacute;s ejecutamos <em>nmEnroll()</em> que realiza 
la suscripci&oacute;n (copia los ficheros necesarios en la m&aacute;quina). Esto lo tenemos que 
ejecutar por cada m&aacute;quina donde vaya a correr el nodemanager.</p>

<pre class="code">
ls:/offline&gt;  connect('system','weblogic','t3://172.16.33.136:7001')
	
Connecting to weblogic server instance running at t3://172.16.33.136:7001 as username system ...
	
Successfully connected to Admin Server 'admin' that belongs to domain 'prueba1'.
	Warning: An insecure protocol was used to connect to the server.
	To ensure on-the-wire security, the SSL port or Admin port
	should be used instead.
	
wls:/prueba1/serverConfig&gt; nmEnroll()
	
Enrolling this machine with the domain directory at /home/miguel/bea/weblogic90/common/nodemanager/. ...
	
Successfully enrolled this machine with the domain directory at /home/miguel/bea/weblogic90/common/nodemanager/.
</pre>

<p>
    Ya podemos ejecutar el fichero
    <em>$BEA_HOME/weblogic92/server/bin/startNodeManager.cmd</em> El NodeManager 
    est&aacute; funcionando. No es necesario que el NodeManager est&eacute; funcionando 
    cuando arrancamos el servidor de administraci&oacute;n. Este ejecutable acepta 
    dos par&aacute;metros: el nombre del dominio (o direcci&oacute;n IP) en el 
    que estar&aacute; escuchando y el puerto.</p> 
  
</li>
  
<li>En dominios de desarrollo es posible que no queramos preocuparnos por la seguridad.
  En nuestro caso, la EPS tiene un problema en los certificados y tenemos que decir que
  no realice la comprobaci&oacute;n. Para ello, editamos el fichero 
  users_projects/domains/prueba1/bin/startWeblogic.cmd. Casi al final del fichero,
  en la l&iacute;nea <em>if "%WLS_REDIRECT_LOG%"=="" (</em> introducimos la siguiente l&iacute;nea
  antes de -Dweblogic.name: 
    -Dweblogic.security.SSL.ignoreHostnameVerification=true
    </li>
  
<li>Con el NodeManager funcionando, vamos a configurar el servidor de administraci&oacute;n 
    para que lo pueda utilizar. Entramos en la consola de administraci&oacute;n 
    y pichamos en la m&aacute;quina donde va a estar el NodeManager. Entramos 
    en la solapa de <em>Configuration</em> y pinchamos en <em>Node Manager</em>. Podemos 
    configurar la direcci&oacute;n de escucha y el puerto (por defecto est&aacute; 
    el 5555).
  </li>

</ol>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/60-2005.jpg"> </p>
<p>Con el NodeManager configurado ya podemos utilizarlo. En la solapa de <em>Monitoring</em> 
    podemos comprobar si podemos establecer comunicaci&oacute;n con el NodeManager 
    de la m&aacute;quina seleccionada. Tambi&eacute;n podemos consultar el fichero 
    log para detectar posibles fallos.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/61-2005.jpg"> </p>
<p>Tambi&eacute;n podemos consultar el log del <em>Node Manager</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/62-2005.jpg"></p>
<p>Por cada servidor que querramos arrancar, debemos configurar los datos del 
    arranque remoto. Para ello pinchamos en el servidor y en la solapa de <em>Configuration</em>, 
    en la subsolapa <em>Server Start</em>. La siguiente informaci&oacute;n hace 
    referencia siempre a directorios de la m&aacute;quina remota (NOTA: esta informaci&oacute;n s&oacute;lo es necesaria si queremos cambiar estos datos con respecto a la configuraci&oacute;n del propio nodemanager):</p>
<ul>
  
<li>
<strong>Java Home</strong>: directorio donde tenemos instalado Java (/home/j2ee/bea/jdk...)</li>
  
<li>
<strong>BEA Home</strong>: directorio donde tenemos instalado BEA (/home/j2ee/bea)</li>
  
<li>
<strong>Root Directory</strong>: directorio de trabajo del servidor. Podemos utilizar 
    el mismo nombre de dominio dentro del directorio <em>users_projects.</em> (/home/j2ee/bea/users_projects/midominio)</li>
  
<li>
<strong>Class Path</strong>: aqu&iacute; podemos pasarle el <em>classpath</em> al comando 
    Java. Como m&iacute;nimo debemos a&ntilde;adir el fichero <em>weblogic.jar</em> 
    que se encuentra en
    $BEA_HOME/weblogic90/server/lib/weblogic.jar.</li>
  
<li>
<strong>Arguments</strong>: argumentos adicionales para el comando Java. Al menos 
    -Xms32m -Xmx32m que indican la cantidad m&iacute;nima y m&aacute;xima de memoria 
    a utilizar.</li>
  
<li>
<strong>Security Policy File</strong>: fichero de pol&iacute;tica de seguridad utilizado 
    por Weblogic. Por defecto podemos usar el fichero:
    $BEA_HOME/weblogic90/server/lib/weblogic.policy</li>
  
<li>
<strong>Username</strong>: el nombre de usuario para arrancar el servidor.</li>
  
<li>
<strong>Password</strong>: contrase&ntilde;a. Debemos indicarle la contrase&ntilde;a 
    asociada al usuario.</li>

</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/63-2005.jpg"></p>
<p>Para arrancar un servidor a trav&eacute;s del NodeManager, seleccionamos el servidor 
que queramos arrancar y pinchamos en la solapa <em>Control -&gt;Start/Stop</em>.
      Nos aparecer&aacute; la figura mostrada m&aacute;s abajo en la cual podemos 
      poner en marcha el servidor (o servidores), pararlo, rearrancarlo o suspenderlo. 
</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/64-2005.jpg"></p>
<p>Para comprobar si realmente se ha arrancado, nos vamos a la solapa de <em>Monitoring</em> y veremos si se ha arrancado. Tened en cuenta que tardar&aacute; un tiempo en arrancar. Tambi&eacute;n podemos comprobar el log del NodeManager o la salida est&aacute;ndar del propio NodeManager.</p>
<p>Por &uacute;ltimo, si queremos que el NodeManager se arranque cuando se encienda 
    la m&aacute;quina, debemos indicar al sistema operativo que lo haga. Vamos 
    a detallar c&oacute;mo se puede arrancar en Linux. Vamos a utilizar el fichero 
    /etc/rc.local En este fichero vamos a a&ntilde;adir un par de l&iacute;neas 
    que arrancar&aacute;n el NodeManager. Las l&iacute;neas a a&ntilde;adir ser&aacute;n:</p>
<pre class="code">su - miguel -c "cd /home/weblogic/bea/weblogic90/server/bin;
	./startNodeManager.sh &amp;"</pre>
<p>El comando <em>su</em> permite cambiar de usuario. Aqu&iacute; cambiamos a 
    <em>miguel</em> que es quien ha instalado el servidor de aplicaciones. Con la 
    opci&oacute;n <em>-c</em> indicamos que ejecute un comando que es el que viene 
    a continuaci&oacute;n, cambiando al directorio indicado y ejecutando el NodeManager. 
    Tambi&eacute;n podemos hacer lo mismo con el servidor de administraci&oacute;n, 
    utilizando el siguiente comando:</p>
<pre class="code">su - miguel -c "cd /home/weblogic/bea/users_projects/domains/MiDominio;
	./startWebLogic.sh &amp;"</pre>
<p> Para hacerlo en Windows tenemos que crear servicios que llamen a los comandos
	indicados</p>
</div>

<a name="N100FF"></a><a name="Configuraci%C3%B3n+b%C3%A1sica+de+un+cluster"></a>
<h2 class="underlined_10">Configuraci&oacute;n b&aacute;sica de un cluster</h2>
<div class="section">
<p>Para configurar un cluster pinchamos en <em>Environment-&gt;Cluster</em>, luego
 en <em>Lock and Edit</em> y en <em>New</em>.</p>
<p>En la siguiente figura debemos empezar a configurar el cluster. Damos el nombre y la direcci&oacute;n y el puerto de multicast.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/87-2005.jpg"></p>
<p>Una vez creado vamos a ver las opciones que podemos configurar. Pinchamos sobre el nombre del cluster reci&eacute;n creado. La primera opci&oacute;n que aparece nos permite configurar tres cosas: </p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/88-2005.jpg"></p>
<ul>

<li>
<strong>Default Load Algorithm</strong>: es el algoritmo de carga a utilizar. Este 
algoritmo permite el balanceo de la carga (peticiones). Los posibles algoritmos son: 
<ul>
	
<li>
<em>Round-Robin</em>. La primera petici&oacute;n se asigna al primer servidor, 
	la segunda al segundo y as&iacute; sucesivamente hasta que se sobrepasa 
	el &uacute;ltimo y se vuelve a empezar.</li>
	
<li>
<em>Weight-based</em>. Este algoritmo permite balancear la carga ponderando 
	el peso de cada servidor. Utilizando el campo <strong>Cluster Weight</strong> (ver 
	siguiente figura) podemos asignar un determinado peso al servidor, para 
	as&iacute; permitir que servidores en m&aacute;quinas m&aacute;s potentes 
	respondan a m&aacute;s peticiones. Si, por ejemplo, asignamos a un servidor 
	un peso 1, a otro 2 y a otro 3, el algoritmo asigna una petici&oacute;n 
	al primer servidor, las dos siguientes al segundo y las tres siguientes 
	al tercero. 
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/89-2005.jpg"></p>
</li>
	
<li>
<em>Random</em>. Elige el siguiente servidor de manera aleatoria. </li>

</ul>

</li>

<li>
<strong>Cluster Address</strong>: son las distintas direcciones (url:puerto) que participar&aacute;n en el cluster, separadas por comas.</li>

</ul>
<p>En la siguiente solapa debemos chequear la direcci&oacute;n de <em>multicast</em>. 
  El <em>multicast</em> permite la comunicaci&oacute;n entre los servidores del 
  cluster. Por 
  defecto es la mostrada en la siguiente figura (el puerto por defecto es tambi&eacute;n 
  el 7001). Si queremos chequear si funciona la direcci&oacute;n podemos hacer 
  uso de una utilidad de WebLogic. Desde dos sesiones distintas del sistema operativo 
  tecleamos el siguiente comando:</p>
<pre class="code">java -cp $BEA_HOME/weblogic92/server/lib/weblogic.jar utils.MulticastTest 
-N mensaje -A direcci&oacute;n</pre>
<p>donde <em>mensaje</em> es el mensaje que se enviar&aacute; desde a la direcci&oacute;n 
  de multicast y <em>direcci&oacute;n</em> es la direcci&oacute;n multicast a utilizar. 
  Ponemos mensajes distintos en cada sesi&oacute;n y debemos recibir los dos mensajes. 
  Si nuestra m&aacute;quina dispone s&oacute;lo del bucle local (<em>localhost</em>) 
  es posible que nos de alg&uacute;n error al intentar conectarnos con la direcci&oacute;n 
  de multicast. Podemos utilizar el siguiente comando para a&ntilde;adir la direcci&oacute;n 
  de multicast al dispositivo <em>lo</em>.</p>
<pre class="code">route add -net 237.0.0.1 netmask 255.0.0.0 dev lo</pre>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/90-2005.jpg"></p>
<p>Pasamos a la solapa <em>Servers</em> donde podemos ver los servidores que 
participar&aacute;n en el cluster. Para asignar un servidor a un cluster, tenemos que 
a&ntilde;adirlos desde esta opci&oacute;n o bien entrar uno a uno en cada servidor e indicarle en <em>Configuration-&gt;General</em> a qu&eacute; cluster est&aacute; asignado. Los servidores deben estar parados para poder 
asignarlos al cluster. La siguiente figura muestra d&oacute;nde tenemos que indicar el cluster al que pertenece el servidor.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/91-2005.jpg"></p>
<p>La siguiente figura muestra el listado de servidores que contiene este cluster.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/92-2005.jpg"></p>
<p>En la solapa <em>Monitoring</em> podemos saber el estado de los servidores 
  configurados para el cluster. En <em>Control</em> podemos arrancar y parar servidores pertenecientes a este cluster.</p>
<p>Para desplegar una aplicaci&oacute;n al cluster (y as&iacute; que todos los 
  servidores del cluster respondan a la aplicaci&oacute;n) debemos asignar la 
  aplicaci&oacute;n al cluster. Simplemente, cuando estemos desplegando la aplicaci&oacute;n y nos diga d&oacute;nde desplegarla, nos aparecer&aacute; una ventana como la siguiente, donde, adem&aacute;s de los servidores disponibles en el dominio, tendremos el cluster. Podemos seleccionar todos los servidores de un cluster o 
  algunos de ellos. Es muy importante <strong>no</strong> desplegar la misma aplicaci&oacute;n 
  a un cluster y adem&aacute;s a un servidor que forme parte del cluster.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/93-2005.jpg"></p>
<p>De la misma forma que en el despliegue podemos controlas los servicios (&uacute;ltima solapa) que est&aacute;n asignados al cluster.</p>
</div>

<a name="N101A1"></a><a name="Configuraci%C3%B3n+de+un+servidor+proxy"></a>
<h2 class="underlined_10">Configuraci&oacute;n de un servidor proxy</h2>
<div class="section">
<p>Una vez creado el cluster como se indicaba en el apartado anterior ya lo tenemos 
  disponible para su utilizaci&oacute;n. Sin embargo, cada servidor tiene su propia 
  direcci&oacute;n IP, por lo que si tenemos una aplicaci&oacute;n desplegada 
  en el cluster, &iquest;a qu&eacute; direcci&oacute;n IP debe direccionar el 
  cliente su petici&oacute;n?. Podemos pedir a un servidor (que pertenezca al 
  cluster) en concreto y &eacute;ste responder&aacute;, pero perderemos el balanceo 
  de carga. Para solucionar este problema se suele insertar un servidor proxy 
  HTTP entre el cluster y el cliente. Este servidor proxy lo podemos hacer con 
  un servidor de aplicaciones que tendr&aacute; asociada una aplicaci&oacute;n 
  que se encargar&aacute; de realizar el balanceo de carga. Tambi&eacute;n se 
  puede utilizar otro servidor proxy (como Apache) o incluso un proxy hardware. 
  En esta secci&oacute;n vamos a ver c&oacute;mo podemos configurar un servidor 
  proxy haciendo uso de una utilidad que incorpora Weblogic. Esta utilidad no 
  es m&aacute;s que una clase que implementa un servlet para realizar el balanceo 
  de carga.</p>
<p>
<img alt="" content-width="10cm" src="imagenes/cluster/sexta.jpg"></p>
<p>Lo primero a realizar es la creaci&oacute;n de un servidor de aplicaciones, 
  al que llamaremos proxy. Vamos a asociar una aplicaci&oacute;n a este servidor 
  de aplicaciones. Para ello vamos a crear una aplicaci&oacute;n vac&iacute;a, 
  que contendr&aacute; s&oacute;lo el fichero de descripci&oacute;n de aplicaci&oacute;n 
  (<em>web.xml</em>) el cual utilizar&aacute; un servlet de Weblogic y el descriptor 
  de WebLogic (<em>webogic.xml</em>). Creamos un fichero web.xml que contendr&aacute; 
  la siguiente informaci&oacute;n:</p>
<pre class="code">&lt;!DOCTYPE web-app PUBLIC "-//Sun Microsystems, Inc.//DTD Web Application 
 2.3//EN" "http://java.sun.com/j2ee/dtds/web-app_2_3.dtd"&gt;
&lt;web-app&gt;
		&lt;servlet&gt; 
   		&lt;servlet-name&gt;HttpClusterServlet&lt;/servlet-name&gt; 
   		&lt;servlet-class&gt;
		   		weblogic.servlet.proxy.HttpClusterServlet 
   		&lt;/servlet-class&gt; 
			&lt;init-param&gt; 
			   &lt;param-name&gt;WebLogicCluster&lt;/param-name&gt; 
			   &lt;param-value&gt; 
				   localhost:6001:6002|localhost:5001:5002
			   &lt;/param-value&gt; 
			&lt;/init-param&gt;
		&lt;/servlet&gt;
		&lt;servlet-mapping&gt; 
   		&lt;servlet-name&gt;HttpClusterServlet&lt;/servlet-name&gt; 
			&lt;url-pattern&gt;/&lt;/url-pattern&gt;
		&lt;/servlet-mapping&gt;
		&lt;servlet-mapping&gt; 
			&lt;servlet-name&gt;HttpClusterServlet&lt;/servlet-name&gt; 
			&lt;url-pattern&gt;*.jsp&lt;/url-pattern&gt; 
		&lt;/servlet-mapping&gt;
		&lt;servlet-mapping&gt; 
			&lt;servlet-name&gt;HttpClusterServlet&lt;/servlet-name&gt; 
			&lt;url-pattern&gt;*.htm&lt;/url-pattern&gt; 
		&lt;/servlet-mapping&gt;
		&lt;servlet-mapping&gt; 
			&lt;servlet-name&gt;HttpClusterServlet&lt;/servlet-name&gt; 
			&lt;url-pattern&gt;*.html&lt;/url-pattern&gt; 
		&lt;/servlet-mapping&gt;
&lt;/web-app&gt;</pre>
<p>Este fichero de descripci&oacute;n consta de las siguientes partes:</p>
<ul>
  
<li>El nombre del servlet y la clase que lo implementa. Hacemos referencia a 
    la clase <em>weblogic.servlet.proxy.HttpClusterServlet</em>. </li>
  
<li>El primer par&aacute;metro inicial identifica los servidores que forman 
    parte del cluster. Debemos indicar cada uno de los servidores que forman parte 
    del cluster de la siguiente manera: nombre:puerto:puerto_seguro <em>nombre</em> 
    puede ser la direcci&oacute;n DNS o IP del servidor y a continuaci&oacute;n 
    ponemos el puerto y el puerto seguro del servidor. Para poner varios servidores 
    los separamos con el s&iacute;mbolo | . El siguiente par&aacute;metro <em>DebugConfigInfo 
    </em>es &uacute;til en modo desarrollo y proporciona informaci&oacute;n para 
    depuraci&oacute;n de errores.</li>
  
<li> Debemos indicar el mapeado del servlet a patrones URL. En este caso hemos 
    mapeado las extensiones jsp, htm, html, as&iacute; como "/" que 
    indica que cualquier petici&oacute;n que no pueda resolver el proxy se reenv&iacute;a 
    hacia los servidores del cluster.</li>

</ul>
<p>El fichero <em>weblogic.xml</em> contendr&aacute; la siguiente informaci&oacute;n:</p>
<pre class="code">&lt;!DOCTYPE welogic-web-app PUBLIC "-//BEA Systems, Inc.//DTD Web Application    
  9.0//EN" "http://www.bea.com/servers/wls90/dtd/weblogic90-web-jar.dtd"&gt;
&lt;weblogic-web-app&gt;
	&lt;context-root&gt;/&lt;/context-root&gt;
&lt;/weblogic-web-app&gt;
</pre>
<p>Aqu&iacute; le estamos diciendo que esta aplicaci&oacute;n es la aplicaci&oacute;n 
  por defecto del servidor, por lo que no ser&aacute; necesario poner /proxyApp 
  para que responda a la aplicaci&oacute;n.</p>
<p>Una vez creados estos ficheros creamos un directorio WEB-INF y movemos el fichero 
  web.xml dentro de este directorio. Para crear la aplicaci&oacute;n web utilizamos 
  el siguiente comando:</p>
<pre class="code">jar cf proxyApp.war WEB-INF/*</pre>
<p>donde <em>proxyApp.war</em> es el nombre que le hemos dado a la aplicaci&oacute;n. 
  Debemos desplegar la aplicaci&oacute;n dentro de nuestro dominio y asociarla 
  al servidor proxy. </p>
</div>

<a name="N101F0"></a><a name="Configuraci%C3%B3n+de+la+replicaci%C3%B3n+de+memoria"></a>
<h2 class="underlined_10">Configuraci&oacute;n de la replicaci&oacute;n de memoria</h2>
<div class="section">
<p>La &uacute;ltima caracter&iacute;stica por configurar es la recuperaci&oacute;n 
  ante fallos. Cuando un cliente realiza una petici&oacute;n a un servidor, se 
  crea una instancia de la sesi&oacute;n. Si un servidor se viene abajo (ya sea 
  por problemas t&eacute;cnicos o por desconexi&oacute;n por mantenimiento de 
  la m&aacute;quina) y est&aacute; dando servicio a un determinado cliente, la 
  sesi&oacute;n HTTP, los servicios EJB y toda la memoria asociada a ese cliente 
  se pierde. Para solucionar este problema, WebLogic permite configurar la replicaci&oacute;n 
  de memoria. La replicaci&oacute;n de memoria nos permite especificar d&oacute;nde 
  van a ser almacenadas las copias de las sesiones. Vamos a trabajar con grupos 
  de replicaci&oacute;n, que son una agrupaci&oacute;n l&oacute;gica de servidores 
  relacionados en un cluster. Lo recomendable es que los servidores en la misma 
  m&aacute;quina est&eacute;n en el mismo grupo de replicaci&oacute;n. Cuando 
  se crea una sesi&oacute;n, WebLogic crea una r&eacute;plica de la sesi&oacute;n 
  y la env&iacute;a a otro servidor siguiendo este orden de preferencia:</p>
<ol>
  
<li>Primero trata de encontrar un servidor que no est&eacute; en su misma m&aacute;quina 
    y que pertenezca a su grupo secundario preferido. </li>
  
<li>Si ning&uacute;n servidor cumple lo anterior, trata de buscar un servidor 
    que pertenezca a su grupo secundario preferido aunque no est&eacute; en otra 
    m&aacute;quina.</li>
  
<li>La tercera opci&oacute;n es que el servidor no pertenezca a su grupo secundario 
    preferido, pero resida en otra m&aacute;quina.</li>
  
<li>La &uacute;ltima opci&oacute;n es que ni pertenezca a su grupo preferido 
    ni resida en otra m&aacute;quina.</li>

</ol>
<p>Para definir los servidores en un grupo de replicaci&oacute;n y en el secundario, 
  debemos definir, en cada servidor, a qu&eacute; grupo pertenecen. El nombre 
  de los grupos nos definimos nosotros. Pinchando en el nombre del servidor que 
  queramos configurar y yendo a la opci&oacute;n de <em>Configuration</em> -&gt; 
  <em>Cluster</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/cluster/96-2005.jpg"> </p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
