<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Gesti&oacute;n de seguridad</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores de aplicaciones" src="images/baner_j2ee_der.gif" title="Servidores de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores de aplicaciones</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores de Aplicaciones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesion 4</div>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Apendice</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion04-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Gesti&oacute;n de seguridad</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Gesti%C3%B3n+de+seguridad">Gesti&oacute;n de seguridad</a>
<ul class="minitoc">
<li>
<a href="#Configuraci%C3%B3n+general">Configuraci&oacute;n general</a>
</li>
<li>
<a href="#Gesti%C3%B3n+de+usuarios+y+grupos">Gesti&oacute;n de usuarios y grupos</a>
</li>
<li>
<a href="#Gesti%C3%B3n+de+roles">Gesti&oacute;n de roles</a>
</li>
<li>
<a href="#Introduciendo+seguridad+en+una+aplicaci%C3%B3n">Introduciendo seguridad en una aplicaci&oacute;n</a>
</li>
</ul>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Gesti%C3%B3n+de+seguridad"></a>
<h2 class="underlined_10">Gesti&oacute;n de seguridad</h2>
<div class="section">
<p>WebLogic proporciona una gesti&oacute;n de seguridad por defecto. Incorpora los mecanismos b&aacute;sicos de <strong>autentificaci&oacute;n</strong> (comprobar que el usuario y contrase&ntilde;a que estamos introduciendo son correctas) y <strong>autorizaci&oacute;n</strong> (una vez autentificado se debe comprobar si el usuario en cuesti&oacute;n tiene permisos para realizar una determinada acci&oacute;n: acceder a un servlet, modificar alg&uacute;n elemento del dominio, ejecutar una aplicaci&oacute;n, etc.). Sin embargo, esta gesti&oacute;n puede ser llevada a cabo por sistemas externos (el propio sistema operativo, sistema LDAP, etc.) En esta sesi&oacute;n vamos a proceder a comentar c&oacute;mo podemos crear los mecanimos de autentificaci&oacute;n y autorizaci&oacute;n en su forma por defecto. </p>
<p>Debemos dividir el proceso para proporcionar seguridad en varios pasos:</p>
<ul>
  
<li>Cuando desarrollemos una aplicaci&oacute;n, no tenemos que pensar en qu&eacute; usuarios del sistema donde vayamos a desplegar la aplicaci&oacute;n van a usarla. Es posible que lo desconozcamos o que la aplicaci&oacute;n vaya a desplegarse en varios sistemas distintos. La forma m&aacute;s eficaz de trabajar es crear restricciones en la aplicaci&oacute;n (lo veremos m&aacute;s adelante en esta misma sesi&oacute;n). Esto se hace creando roles de seguridad asociados a patrones URL en el descriptor de la aplicaci&oacute;n (web.xml).</li>
  
<li>Por otro lado, nuestro sistema (en nuestro caso WebLogic) tendr&aacute; creados usuarios, grupos y roles (los llamaremos <em>principales</em>) que se podr&aacute;n gestionar de manera distinta.</li>
  
<li>El paso final consiste en mapear restricciones en el descriptor con principales del servidor. En el caso de WebLogic esto se hace con un fichero descriptor adicional llamado <em>weblogic.xml</em>. De esta manera, nuestra aplicaci&oacute;n es independiente del servidor donde vayamos a desplegar.</li>

</ul>
<a name="N10030"></a><a name="Configuraci%C3%B3n+general"></a>
<h3 class="underlined_5">Configuraci&oacute;n general</h3>
<p>En la opci&oacute;n <em>Security Realms</em> de la izquierda tenemos todo lo 
    referente a la gesti&oacute;n de seguridad. Tenemos creado un <em>Realm</em> 
    por defecto, <em>myrealm</em>. Un <em>Realm</em> es un conjunto de usuarios, grupos, roles, proveedores y pol&iacute;ticas de seguridad. 
    Podemos crear nuevos usuarios, grupos y roles. En Weblogic 9.0 la seguridad 
    se maneja mediante pol&iacute;ticas de seguridad. Las pol&iacute;ticas de 
    seguridad permiten definir <em>qui&eacute;n</em> tiene acceso a un determinado 
    recurso. Adicionalmente podemos definir una restricci&oacute;n de tiempo de 
    acceso a un recurso (de qu&eacute; hora a qu&eacute; hora se tiene acceso 
    a un recurso). Por defecto un recurso no tiene protecci&oacute;n hasta que 
    el administrador le asigna una determinada pol&iacute;tica de seguridad. Los 
    recursos a los que se pueden imponer pol&iacute;ticas de seguridad son: la 
    consola de administraci&oacute;n, recursos de aplicaci&oacute;n (web, EJB, 
    ear, jar, etc.), JDBC, JNDI, EIS, JMS.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/85-2005.jpg"> </p>
<p>Vamos a empezar a definir la seguridad. Pinchamos en <em>myrealm</em>, que es el definido por defecto, y nos aparecer&aacute; la siguiente ventana. En ella podemos configurar si la pol&iacute;tica de seguridad vendr&aacute; dada por el descriptor de despliegue (DD) o bien la gestionar&aacute; el propio servidor.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/86b-2005.jpg"> </p>
<p>La opci&oacute;n <em>Configuration-&gt;User Lockout</em> tiene que ver con caracter&iacute;sticas de la contrase&ntilde;a de acceso y el bloqueo de una cuenta por haber intentado acceder con una contrase&ntilde;a incorrecta. Si un usuario intenta acceder al sistema e introduce una contrase&ntilde;a incorrecta, cuando realice un determinado n&uacute;mero de intentos la cuenta ser&aacute; deshabilitada. Las opciones son:</p>
<ul>
	
<li>La opci&oacute;n <em>Lockout enabled</em>, si marcada, permite el bloqueo de una cuenta al intentar acceder con una contrase&ntilde;a err&oacute;nea.</li>
	
<li>La opci&oacute;n <em>Lockout Threshold</em> especifica el n&uacute;mero de intentos err&oacute;neos que provocan el bloqueo de la cuenta.</li>
	
<li>La siguiente es el n&uacute;mero de minutos que se bloquea la cuenta.</li>
	
<li>La opci&oacute;n <em>Lockout Reset Duration</em> indica el n&uacute;mero de minutos durante los cuales se cuenta el n&uacute;mero de intentos fallidos. Si marcamos cinco, si durante cinco minutos se han realizado cinco (el n&uacute;mero indicado por Lockout Threshold) intentos fallidos, se produce el bloqueo.</li>
	
<li>La &uacute;ltima opci&oacute;n es el tama&ntilde;o de la cache de intentos fallidos de cualquier usuario que el sistema almacenar&aacute;.</li>

</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/87-2005.jpg"> </p>
<a name="N10085"></a><a name="Gesti%C3%B3n+de+usuarios+y+grupos"></a>
<h3 class="underlined_5">Gesti&oacute;n de usuarios y grupos</h3>
<p>Vamos a ver c&oacute;mo crear un nuevo usuario. Un usuario puede ser una persona o una entidad software (cliente java). El 
    usuario es &uacute;nico dentro del sistema y se identifica con su nombre y 
    una contrase&ntilde;a. No existe el usuario invitado (<em>Guest</em>). Puede 
    ser creado pero se recomienda no hacerlo por riesgo en la seguridad del sistema. 
    Para crear un nuevo usuario pinchamos en la solapa <em>Users and Groups</em> y nos aparecer&aacute; 
    una p&aacute;gina como la de la siguiente figura. Se nos muestra los usuarios 
    creados y tenemos un enlace para crear un nuevo usuario. Tambi&eacute;n podemos 
    eliminar el usuario.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/88-2005.jpg"> </p>
<p>Al pinchar en <em>New</em> nos aparece la siguiente figura. 
    Los datos indicados son el nombre del usuario, una breve descripci&oacute;n 
    y la contrase&ntilde;a (m&iacute;nimo de 8 caracteres). Una vez introducidos estos datos pinchamos en <em>Ok</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/89-2005.jpg"> </p>
<p>Vamos a ver c&oacute;mo crear grupos. Un grupo es una agrupaci&oacute;n 
    de usuarios con alguna caracter&iacute;stica en com&uacute;n. Un usuario puede 
    pertenecer a m&aacute;s de un grupo. Si asignamos una determinada pol&iacute;tica 
    de seguridad a un grupo, dicha pol&iacute;tica es asignada a todos los usuarios 
    del grupo. Por defecto existen seis grupos (pinchamos en la opci&oacute;n <em>Users and Groups-&gt;Groups</em>):</p>
<ul>
     
<li>
<strong>Administrators</strong>: es el grupo que permite administrar el dominio: 
      arrancar y parar el sistema, visualizar y modificar todos los recursos.</li>
    
<li>
<strong>AppTesters</strong>: Los usuarios de este grupo pueden probar aplicaciones.</li>
    
<li>
<strong>Deployers</strong>: los miembros de este grupo pueden desplegar aplicaciones.</li>
    
    
<li>
<strong>Monitors</strong>: s&oacute;lo se permite la monitorizaci&oacute;n del sistema.</li>
    
<li>
<strong>Operators</strong>: permite cualquier operaci&oacute;n con los servidores.</li>
  
</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/89b-2005.jpg"> </p>
<p>Para crear un nuevo grupo, pinchamos en <em>New</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/90-2005.jpg"> </p>
<p>Damos el nombre y una breve descripci&oacute;n al grupo y pinchamos en <em>OK</em>. 
    Volvemos a la lista de grupos. Si pinchamos sobre uno de ellos podemos modificarlo. Tenemos una solapa, <em>membership</em>, que nos permite definir de qu&eacute; otros grupos hereda sus caracter&iacute;sticas.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/91-2005.jpg"> </p>
<p>Un usuario puede ser asignado a un grupo. Para ello, nos vamos a la lista de usuarios, pinchamos sobre el usuario a modificar (se puede modificar la descripci&oacute;n y la contrase&ntilde;a) y sobre la solapa <em>Groups</em>.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/92-2005.jpg"> </p>
<a name="N100FF"></a><a name="Gesti%C3%B3n+de+roles"></a>
<h3 class="underlined_5">Gesti&oacute;n de roles</h3>
<p>Otro apartado de la seguridad es el de los roles. Un rol es una asociaci&oacute;n 
    entre usuarios y recursos que permite establecer qu&eacute; usuario tiene 
    acceso a qu&eacute; recurso. Un grupo es una agrupaci&oacute;n est&aacute;tica 
    (los usuarios est&aacute;n agrupados siempre de la misma forma). Un rol es 
    din&aacute;mico, porque dependiendo de qui&eacute;n est&eacute; accediendo 
    a un recurso y dependiendo de a qu&eacute; recurso quiera acceder, tendr&aacute; 
    permiso o no. Tambi&eacute;n se puede condicionar el acceso dependiendo de a qu&eacute; hora se intenta acceder, por ejemplo. Se recomienda agrupar usuarios en grupos y 
    crear roles para luego asignar los roles a los grupos. Si pinchamos en el solapa de <em>Roles and Policies</em> tenemos lo mostrado en la siguiente figura.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/administracion/93-2005.jpg"> </p>
<p>Tenemos roles para cada recurso y roles globales. Dentro de los roles globales, por defecto se definen los siguientes, cada uno de estos roles est&aacute; asignado al grupo correspondiente (<em>Admin</em> 
    al de <em>Administrator</em>, <em>Deployer</em> al de <em>Deployers</em>, etc.).</p>
<ul>
    
<li>
<strong>Admin</strong>: permite realizar cualquier operaci&oacute;n dentro del sistema: 
	    despliegues, modificar recursos, etc.</li>
    
<li>
<strong>Anonymous</strong>: es el rol m&aacute;s restrictivo y es asignado a todos 
      los usuarios.</li>

<li>
<strong>AppTester</strong>: permite ejecutar aplicaciones.</li>
    
<li>
<strong>Deployer</strong>: permite ver la configuraci&oacute;n del sistema y realizar 
      despliegues de aplicaciones.</li>
    
<li>
<strong>Monitor</strong>: s&oacute;lo permite visualizar la configuraci&oacute;n 
	    de los servidores.</li>
    
<li>
<strong>Operator</strong>: permite ver la configuraci&oacute;n del sistema y realizar 
      operaciones con los servidores.</li>
  
</ul>
<p>Las pol&iacute;ticas de seguridad por defecto asociadas a los recursos de 
    WebLogic se muestran en la siguiente tabla:</p>
<table class="ForrestTable" cellspacing="1" cellpadding="4">
    
<tr> 
      
<td colspan="1" rowspan="1"><strong>Recurso WebLogic</strong></td>
      <td colspan="1" rowspan="1"><strong>Pol&iacute;tica de seguridad</strong></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">Recursos administrativos</td>
      <td colspan="1" rowspan="1">Rol <em>Admin</em>, <em>Deployer, Operator, Monitor</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">EIS, EJB, JMS, JDBC, JNDI, MBean</td>
      <td colspan="1" rowspan="1">Grupo <em>Everyone</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">Recursos servidor</td>
      <td colspan="1" rowspan="1">Rol <em>Admin, Operator</em></td>
    
</tr>
    
<tr> 
      
<td colspan="1" rowspan="1">Recursos servicios web</td>
      <td colspan="1" rowspan="1">Grupo <em>Everyone</em></td>
    
</tr>
  
</table>
<p>Si pinchamos en <em>View Role policy</em> (la pol&iacute;tica asociada al rol) podemos ver
	  que simplemente es una asignaci&oacute;n al grupo correspondiente.
    Para crear un nuevo rol pinchamos en <em>Configure a new role</em>. Llegados a este punto y volviendo a lo que coment&aacute;bamos al principio de la sesi&oacute;n, no vamos a describir c&oacute;mo crear roles y pol&iacute;ticas para recursos, ya que esto se suele dejar a alg&uacute;n sistema externo.</p>
<a name="N101A0"></a><a name="Introduciendo+seguridad+en+una+aplicaci%C3%B3n"></a>
<h3 class="underlined_5">Introduciendo seguridad en una aplicaci&oacute;n</h3>
<p>Tal como comentamos al principio de esta sesi&oacute;n, la forma de definir la seguridad de una aplicaci&oacute;n es mediante los ficheros <em>web.xml </em>y<em> weblogic.xml.</em>.</p>
<p>La secuencia a seguir para asignar seguridad (restringir el acceso a determinados usuarios) 
    a un recurso es el siguiente, mediante el fichero descriptor es:</p>
<ul>
    
<li>Declarar un patr&oacute;n URL en el fichero <em>web.xml.</em> 
</li>
    
<li>Declarar un rol.</li>
    
<li>Asociar el patr&oacute;n con el rol.</li>
    
<li>Mapear el rol con usuarios o grupos en el fichero <em>weblogic.xml</em>
</li>
  
</ul>
<p>Un ejemplo de la informaci&oacute;n que podemos poner en el fichero <em>web.xml</em> 
    (adem&aacute;s de la de mapeado utilizada hasta ahora) es la siguiente:</p>
<pre class="code">&lt;security-constraint&gt;
	&lt;web-resource-collection&gt;
		&lt;web-resource-name&gt;<strong>nombre aplicacion</strong>&lt;/web-resource-name&gt;
		&lt;url-pattern&gt;<strong>url a proteger</strong>&lt;/url-pattern&gt;
	&lt;/web-resource-collection&gt;
 	&lt;auth-constraint&gt;
  		&lt;role-name&gt;<strong>nombre del rol</strong>&lt;/role-name&gt;
  	&lt;/auth-constraint&gt;
 &lt;/security-constraint&gt;

&lt;security-role&gt;
  	&lt;role-name&gt;<strong>nombre del rol</strong>&lt;/role-name&gt;
&lt;/security-role&gt;
&lt;login-config&gt;
	&lt;auth-method&gt;BASIC&lt;/auth-method&gt;
&lt;/login-config&gt;</pre>
<p>En <em>nombre aplicaci&oacute;n</em> debemos poner el nombre de nuestra aplicaci&oacute;n 
    que queremos proteger. En <em>url a proteger</em> especificamos la url (directorios, 
    jsp, html, etc.) Por ejemplo, /managers/* proteger&iacute;a todo el directorio 
    <em>managers</em> de nuestra aplicaci&oacute;n (cualquier fichero por debajo 
    del directorio). Lo anterior define un recurso web y lo asociamos a un rol. 
    Debemos especificar el nombre del rol y la etiqueta <em>security-role</em> crea 
    el rol. La &uacute;ltima etiqueta, <em>login-config</em>, permite especificar 
    el m&eacute;todo de autentificaci&oacute;n: BASIC pide el nombre de usuario 
    y contrase&ntilde;a mediante una ventana; FORM permite pedir la autentificaci&oacute;n 
    mediante un formulario y CLIENT-CERT mediante un certificado.</p>
<p>Por &uacute;ltimo debemos asociar el rol creado con un grupo o usuario de 
    WebLogic. Para ello disponemos del fichero <em>weblogic.xml</em>. </p>
<pre class="code">&lt;weblogic-web-app&gt;
	&lt;security-role-assignment&gt;
		&lt;role-name&gt;<strong>nombre del rol</strong>&lt;/role-name&gt;
		&lt;principal-name&gt;<strong>nombre de grupo o usuario</strong>&lt;/principal-name&gt;
	&lt;/security-role-assignment&gt;
&lt;/weblogic-web-app&gt;
</pre>
<p>En <em>nombre del rol</em> pondremos el rol previamente definido en el fichero 
    <em>web.xml</em>. Como nombre de grupo o usuario debemos poner uno v&aacute;lido 
    (definido) dentro de WebLogic. </p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
