<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Introducci&oacute;n a los servidores de aplicaciones. Instalaci&oacute;n de Bea WebLogic</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Servidores de aplicaciones" src="images/baner_j2ee_der.gif" title="Servidores de aplicaciones"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Servidores de aplicaciones</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Servidores de Aplicaciones</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menupage">
<div class="menupagetitle">Sesion 1</div>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Apendice</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion01-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Introducci&oacute;n a los servidores de aplicaciones. Instalaci&oacute;n de Bea WebLogic</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n+a+los+servidores+de+aplicaciones">Introducci&oacute;n a los servidores de aplicaciones</a>
<ul class="minitoc">
<li>
<a href="#Aplicaciones+de+empresa">Aplicaciones de empresa</a>
</li>
<li>
<a href="#%C2%BFQu%C3%A9+es+un+servidor+de+aplicaciones%3F">&iquest;Qu&eacute; es un servidor de aplicaciones?</a>
</li>
</ul>
</li>
<li>
<a href="#Instalaci%C3%B3n+del+servidor+Bea+WebLogic+9">Instalaci&oacute;n del servidor Bea WebLogic 9</a>
<ul class="minitoc">
<li>
<a href="#Instalaci%C3%B3n+del+servidor+de+aplicaciones">Instalaci&oacute;n del servidor de aplicaciones</a>
</li>
<li>
<a href="#Arranque+del+dominio+y+consola+de+administraci%C3%B3n">Arranque del dominio y consola de administraci&oacute;n</a>
</li>
<li>
<a href="#Arranque+y+configuraci%C3%B3n">Arranque y configuraci&oacute;n</a>
</li>
</ul>
</li>
</ul>
</div>

<a name="N1000C"></a><a name="Introducci%C3%B3n+a+los+servidores+de+aplicaciones"></a>
<h2 class="underlined_10">Introducci&oacute;n a los servidores de aplicaciones</h2>
<div class="section">
<p>En este tema veremos una peque&ntilde;a introducci&oacute;n a los servidores 
  de aplicaciones. Comentaremos los t&eacute;rminos m&aacute;s utilizados y los 
  conceptos que usaremos m&aacute;s adelante.</p>
<a name="N10015"></a><a name="Aplicaciones+de+empresa"></a>
<h3 class="underlined_5">Aplicaciones de empresa</h3>
<p>El concepto de servidor de aplicaciones est&aacute; relacionado con el concepto 
  de sistema distribuido. Un sistema distribuido, en oposici&oacute;n a un sistema 
  monol&iacute;tico, permite mejorar tres aspectos fundamentales en una aplicaci&oacute;n: 
  la alta disponibilidad, la escalabilidad y el mantenimiento. En un sistema monol&iacute;tico 
  un cambio en las necesidades del sistema (aumento considerable del n&uacute;mero 
  de visitas, aumento del n&uacute;mero de aplicaciones, etc.) provoca un colapso 
  y la adaptaci&oacute;n a dicho cambio puede resultar catastr&oacute;fica. Vamos 
  a ver estas caracter&iacute;sticas con ejemplos. </p>
<ul>
  
<li>La <strong>alta disponibilidad</strong> hace referencia a que un sistema debe estar 
    funcionando las 24 horas del d&iacute;a los 365 d&iacute;as al a&ntilde;o. 
    Para poder alcanzar esta caracter&iacute;stica es necesario el uso de t&eacute;cnicas 
    de balanceo de carga y de recuperaci&oacute;n ante fallos (<em>failover</em>). 
  </li>
  
<li>La <strong>escalabilidad</strong> es la capacidad de hacer crecer un sistema cuando 
    se incrementa la carga de trabajo (el n&uacute;mero de peticiones). Cada m&aacute;quina 
    tiene una capacidad finita de recursos y por lo tanto s&oacute;lo puede servir 
    un n&uacute;mero limitado de peticiones. Si, por ejemplo, tenemos una tienda 
    que incrementa la demanda de servicio, debemos ser capaces de incorporar nuevas 
    m&aacute;quinas para dar servicio.</li>
  
<li>El <strong>mantenimiento</strong> tiene que ver con la versatilidad a la hora de actualizar, 
    depurar fallos y mantener un sistema. La soluci&oacute;n al mantenimiento 
    es la construcci&oacute;n de la l&oacute;gica de negocio en unidades reusables 
    y modulares.</li>

</ul>
<a name="N10037"></a><a name="%C2%BFQu%C3%A9+es+un+servidor+de+aplicaciones%3F"></a>
<h3 class="underlined_5">&iquest;Qu&eacute; es un servidor de aplicaciones?</h3>
<p>El est&aacute;ndar J2EE permite el desarrollo de aplicaciones de empresa de 
  una manera sencilla y eficiente. Una aplicaci&oacute;n desarrollada con las 
  tecnolog&iacute;as J2EE permite ser desplegada en cualquier servidor de aplicaciones 
  o servidor web que cumpla con el est&aacute;ndar. Un servidor de aplicaciones 
  es una implementaci&oacute;n de la especificaci&oacute;n J2EE. La arquitectura 
  J2EE es la siguiente:</p>
<p>
<img alt="Arquitectura J2EE." content-width="8cm" src="imagenes/primera.jpg" width="420"></p>
<p>Definimos a continuaci&oacute;n algunos de los conceptos que aparecen en la 
  figura:</p>
<ul>
  
<li>
<strong>Cliente web (contenedor de applets)</strong>: Es usualmente un navegador e 
    interact&uacute;a con el contenedor web haciendo uso de HTTP. Recibe p&aacute;ginas 
    HTML o XML y puede ejecutar applets y c&oacute;digo JavaScript. </li>
  
<li>
<strong>Aplicaci&oacute;n cliente</strong>: Son clientes que no se ejecutan dentro 
    de un navegador y pueden utilizar cualquier tecnolog&iacute;a para comunicarse 
    con el contenedor web o directamente con la base de datos.</li>
  
<li>
<strong>Contenedor web</strong>: Es lo que com&uacute;nmente denominamos servidor 
    web. Es la parte <em>visible</em> del servidor de aplicaciones. Utiliza los 
    protocolos HTTP y SSL (seguro) para comunicarse.</li>
  
<li>
<strong>Servidor de aplicaciones</strong>: Proporciona servicios que soportan la ejecuci&oacute;n 
    y disponibilidad de las aplicaciones desplegadas. Es el coraz&oacute;n de 
    un gran sistema distribuido. </li>

</ul>
<p>Frente a la tradicional estructura en dos capas de un servidor web (ver siguiente 
  figura) un servidor de aplicaciones proporciona una estructura en tres capas que 
  permite estructurar nuestro sistema de forma m&aacute;s eficiente. Un concepto 
  que debe quedar claro desde el principio es que no todas las aplicaciones de 
  empresa necesitan un servidor de aplicaciones para funcionar. Una peque&ntilde;a 
  aplicaci&oacute;n que acceda a una base de datos no muy compleja y que no sea 
  distribuida probablemente no necesitar&aacute; un servidor de aplicaciones, 
  tan solo con un servidor web (usando servlets y jsp) sea suficiente. </p>
<p>
<img alt="Arquitectura en dos capas frente a tres capas utilizando el servidor de aplicaciones." content-width="7cm" src="imagenes/septima.jpg"></p>
<p>Como hemos comentado, un servidor de aplicaciones es una implementaci&oacute;n 
  de la especificaci&oacute;n J2EE. Existen diversas implementaciones, cada una 
  con sus propias caracter&iacute;sticas que la pueden hacer m&aacute;s atractiva 
  en el desarrollo de un determinado sistema. Algunas de las implementaciones 
  m&aacute;s utilizadas son las siguientes:</p>
<ul>
  
<li>BEA WebLogic</li>
  
<li>JBoss</li>
  
<li>IBM WebSphere</li>
  
<li>Sun-Netscape IPlanet</li>
  
<li>Sun One</li>
  
<li>Oracle IAS</li>
  
<li>Borland AppServer</li>

</ul>
<p>Los dos primeros son los m&aacute;s utilizados en el mercado. Nosotros vamos 
  a utilizar el servidor BEA WebLogic. La principal ventaja de WebLogic es que 
  podemos crear un sistema con varias m&aacute;quinas con distintos sistemas operativos: 
  Linux, Unix, Windows NT, etc. El sistema funciona sin importarle en qu&eacute; 
  m&aacute;quina est&aacute; corriendo el servidor. </p>
<p>Otros conceptos que aparecer&aacute;n a lo largo de este m&oacute;dulo:</p>
<ul>
  
<li>
<strong>Servidor proxy</strong>: Centraliza peticiones de los clientes y las reenv&iacute;a 
    hacia otras m&aacute;quinas. Puede servir como nivel de indirecci&oacute;n 
    y seguridad. Tambi&eacute;n puede ser usado para realizar balanceo de carga.</li>
  
<li>
<strong>Cortafuegos</strong> (<em><strong>firewall</strong></em>): Proporciona servicios de filtrado, 
    autorizaci&oacute;n y autentificaci&oacute;n. Puede actuar como proxy y ayuda 
    a manejar los ataques de los <em>hackers.</em>
</li>
  
<li>
<strong>M&aacute;quina</strong>: Representa una unidad f&iacute;sica donde reside 
    un servidor. Una m&aacute;quina se define como tipo Unix o no Unix (Windows 
    NT, etc.). </li>
  
<li>
<strong>Servidor</strong>: Un servidor es una instancia de la clase <em>weblogic.Server</em> 
    ejecut&aacute;ndose dentro de una m&aacute;quina virtual de Java. Un servidor 
    est&aacute; alojado en una m&aacute;quina, pero una m&aacute;quina puede contener 
    varios servidores. Si un servidor no lo declaramos en ninguna m&aacute;quina 
    WLS asume que est&aacute; en una creada por defecto.</li>
  
<li>
<strong>Dominio</strong>: Un dominio es una unidad administrativa. Sirve para declarar 
    varios servidores, aplicaciones, etc. y que todos ellos est&eacute;n asociados 
    mediante el nombre del dominio.</li>
  
<li>
<strong><em>Clustering</em></strong> (<strong>asociaci&oacute;n</strong>): Los <em>clusters</em> 
    permiten asociar maquinas y servidores para que act&uacute;en de forma conjunta 
    como una &uacute;nica instancia. La creaci&oacute;n de un cluster va a permitir 
    el balanceo de carga y la recuperaci&oacute;n frente a fallos.</li>
  
<li>
<strong>Balanceo de carga</strong>: Es una t&eacute;cnica utilizada para distribuir 
    las peticiones entre varios servidores de tal forma que todos los servidores 
    respondan al mismo n&uacute;mero de peticiones.</li>
  
<li>
<strong>Recuperaci&oacute;n ante fallos</strong> (<strong><em>failover</em></strong>): Permite 
    evitar la ca&iacute;da de un sistema cuando una m&aacute;quina deja de funcionar 
    o funciona incorrectamente. </li>
  
<li>
<strong>Puerto de escucha</strong>: Un servidor tiene varios puertos por los que puede 
    "escuchar" las peticiones. Existen puertos ya asignados a aplicaciones 
    concretas, como por ejemplo el puerto de http que suele ser el 80. Los puertos 
    permiten que varias aplicaciones puedan atender distintas peticiones en la 
    misma m&aacute;quina. Un puerto en una direcci&oacute;n se especifica de la 
    siguiente manera: <em>http://localhost:7001/direc</em> . Con :7001 indicamos 
    el puerto que estamos <em>atacando</em>. Los puertos del 0 al 1023 son reservados 
    por el sistema. Podemos disponer de los puertos del 1024 al 65536. Hay que 
    tener en cuenta que dos servicios no pueden estar escuchando en el mismo puerto.</li>
  
<li>
<strong>Modo producci&oacute;n y modo desarrollo</strong>. Hablaremos muy a menudo 
    de modo desarrollo y modo producci&oacute;n. El modo desarrollo es cuando 
    nos encontramos desarrollando nuestra aplicaci&oacute;n y no est&aacute; disponible 
    exteriormente. El modo producci&oacute;n es cuando est&aacute; funcionando 
    a pleno rendimiento y tenemos clientes que se encuentran utiliz&aacute;ndola. 
    Por defecto, un dominio se arranca en modo desarrollo.</li>

</ul>
<p>
<img alt="" content-width="10cm" src="imagenes/segunda.jpg"></p>
</div>

<a name="N100E5"></a><a name="Instalaci%C3%B3n+del+servidor+Bea+WebLogic+9"></a>
<h2 class="underlined_10">Instalaci&oacute;n del servidor Bea WebLogic 9</h2>
<div class="section">
<p>Los pasos a seguir en la instalaci&oacute;n de un servidor de aplicaciones 
    es la siguiente:</p>
<ol>
    
<li>Instalaci&oacute;n del software. Esta acci&oacute;n copia los ficheros 
      necesarios y crea la estructura inicial de directorios.</li>
    
<li>Configuraci&oacute;n de dominios. Debemos configurar el o los dominios 
      necesarios y todos los componentes dentro de cada dominio (servidores, cluster, 
      m&aacute;quinas, etc.).</li>
  
</ol>
<a name="N100F7"></a><a name="Instalaci%C3%B3n+del+servidor+de+aplicaciones"></a>
<h3 class="underlined_5">Instalaci&oacute;n del servidor de aplicaciones</h3>
<p>Vamos a instalar el servidor de aplicaciones Bea WebLogic. La instalaci&oacute;n 
    descrita aqu&iacute; es para la versi&oacute;n 9.2 y bajo el sistema operativo 
    Windows XP. Los requerimientos del sistema para la instalaci&oacute;n de esta versi&oacute;n 
    son:</p>
<ul>
    
<li>Memoria: 1Gb m&iacute;nimo (2Gb aconsejable)</li>
    
<li>Espacio en disco: 800Mb</li>
    
<li>Versi&oacute;n de Java 2 JDK (se instala junto con el servidor) o 
      superior. Podemos utilizar otra versi&oacute;n de Java, pero es aconsejable 
      consultar la informaci&oacute;n de Bea para comprobar la compatibilidad entre versiones.</li>
  
</ul>
<p>Ejecutamos el fichero <em>server921_win32.exe</em>. Esperamos hasta 
    que nos aparezca la siguiente pantalla.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/1-2004.jpg" width="600"></p>
<p>Nos aparecer&aacute; una ventana de licencia a la que decimos que s&iacute; 
      y pasamos a la siguiente pantalla.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/2-2004.jpg" width="600"></p>
<p>Si ya disponemos de un directorio creado lo podemos elegir de la lista. Si 
    no, podemos dejar el mostrado por defecto, o definir uno distinto.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/4-2004.jpg" width="600"></p>
<p>Podemos escoger el tipo de instalaci&oacute;n que deseamos realizar.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/3-2004.jpg" width="600"></p>
<p>Deseleccionamos la opci&oacute;n siguiente. Es una herramienta para realizar pruebas 
  en los despliegues.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/1-2007.jpg" width="600"></p>
<p>Nos queda elegir el directorio donde queremos que se instale el servidor 
    de aplicaciones. Por defecto lo hace en el directorio <em>weblogic92</em>.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/2-2007.jpg" width="600"></p>
<p>Por &uacute;ltimo, indicamos si queremos que el software est&eacute; disponible para
  todos los usuarios de Windows o s&oacute;lo para el actual.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/3-2007.jpg" width="600"></p>
<p>Despu&eacute;s de los pasos anteriores empezar&aacute; la instalaci&oacute;n, 
    que durar&aacute; unos minutos. Cuando finalice nos aparecer&aacute; la ventana 
    siguiente. Deseleccionamos la opci&oacute;n <em>Run QuickStart </em>y pinchamos 
    en <em>Done.</em> Hemos finalizado la instalaci&oacute;n del servidor.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/7-2004.jpg" width="600"></p>
<p>La estructura de directorios creada en la instalaci&oacute;n es la siguiente:</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/7-2007.jpg"></p>
<p>El directorio <em>jdk150_06</em> contiene la distribuci&oacute;n 1.5 de J2SE 
    de Sun. Si tenemos una versi&oacute;n actualizada de Java simplemente la a&ntilde;adiremos 
    al CLASSPATH. En este punto debemos tener un cuidado especial y comprobar 
    si la versi&oacute;n de Java es soportada por la versi&oacute;n del servidor 
    de aplicaciones. Para comprobarlo visitar la p&aacute;gina de Bea. El siguiente directorio, jrockit90..., contiene una versi&oacute;n de Java propia de Bea. El directorio 
    de <em>logs </em>contiene el fichero log de instalaci&oacute;n. El directorio 
    <em>utils</em> contiene algunas utilidades que iremos viendo conforme las utilicemos. 
    El siguiente directorio, <em>weblogic92</em>, es el que contiene todas las librer&iacute;as, 
    clases y herramientas adicionales para el funcionamiento de nuestro servidor.
    El directorio <em>workshop92</em> contiene la aplicaci&oacute;n Workshop de Bea, que veremos
    m&aacute;s adelante. 
    El fichero <em>license.bea</em> contiene la informaci&oacute;n de nuestra licencia 
    en formato XML. Contendr&aacute; informaci&oacute;n de la fecha de expiraci&oacute;n 
    de la licencia, de qu&eacute; caracter&iacute;sticas disponemos (n&uacute;mero 
    de puestos, n&uacute;mero de IPs, etc.), y toda la informaci&oacute;n necesaria 
    para la ejecuci&oacute;n del servidor. El ejecutable <em>UpdateLicense.cmd</em> 
    nos va a permitir actualizar una nueva licencia.</p>
<p>A su vez, el directorio <em>weblogic92</em> contiene los siguientes subdirectorios:</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/9-2007.jpg"></p>
<p>Nos interesan, de momento, el directorio <em>common</em> y el <em>server</em>. 
    <em>Common</em> contiene los subdirectorios mostrados en la siguiente figura. 
    En el directorio <em>bin</em> tenemos una herramienta para crear dominios. El 
    directorio <em>nodemanager</em> contiene ficheros de configuraci&oacute;n para 
    el Node Manager.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/10-2007.jpg"></p>
<p>El directorio <em>server</em> contiene datos y utilidades relacionadas con 
    el servidor de aplicaciones. En el directorio <em>bin</em> tenemos varias aplicaciones 
    y los <em>scripts</em> para arrancar el servidor de aplicaciones y el Node Manager. 
    El ejecutable para arrancar un servidor que se crea en nuestro dominio llama 
    a estos ejecutables. En otro directorio dentro de <em>server</em>, el subdirectorio 
    <em>lib</em>, tenemos el fichero <em>weblogic.jar</em> que tendremos que incluir 
    en el <em>classpath</em> cuando queramos realizar una aplicaci&oacute;n que 
    utilice los recursos de WebLogic. Tambi&eacute;n disponemos en este directorio 
    de los ficheros que gestionan las pol&iacute;ticas de seguridad.</p>
<p>
<img alt="" content-width="12cm" src="imagenes/instalacion/11-2007.jpg"></p>
<a name="N101CC"></a><a name="Arranque+del+dominio+y+consola+de+administraci%C3%B3n"></a>
<h3 class="underlined_5">Arranque del dominio y consola de administraci&oacute;n</h3>
<p>Antes de empezar a definir los elementos que soportan la ejecuci&oacute;n 
    del servidor de aplicaciones vamos a comentar algunos conceptos sobre los 
    distintos tipos de servidores. </p>
<p>Como ya hemos comentado, nuestra principal unidad de trabajo es el dominio. 
    El dominio no es m&aacute;s que una agrupaci&oacute;n de todos los componentes 
    que utilizamos para nuestro trabajo (servidores, m&aacute;quinas, aplicaciones, 
    etc.). Un ejemplo de uso de dominios es el siguiente. Cuando se desarrolla 
    una aplicaci&oacute;n se suele separar la fase de desarrollo de una aplicaci&oacute;n 
    con la fase de producci&oacute;n (cuando la aplicaci&oacute;n ya est&aacute; 
    funcionando hacia el usuario y dando servicio). Para manejar esta situaci&oacute;n 
    podemos tener creados dos dominios, uno para desarrollo y otro para producci&oacute;n. 
    A pesar de contener exactamente los mismos componentes funcionan de forma 
    independiente. </p>
<p>Dentro de un dominio vamos a tener m&aacute;quinas y servidores. Al menos 
    debemos tener un servidor en nuestro dominio, que llamaremos de <em>administraci&oacute;n</em>. 
    El servidor de administraci&oacute;n es &uacute;nico en el dominio y va a 
    realizar, como su nombre indica, tareas administrativas. Podemos tener m&aacute;s 
    servidores, que llamaremos <em>administrados</em> (<em>managed</em>). De este 
    tipo de servidor podemos tener tantos como queramos. </p>
<p>Vamos a empezar a crear nuestro primer dominio. Vamos a llamarlo <em>MiDominio</em> 
    y contendr&aacute; dos servidores alojados en la misma m&aacute;quina: <em>Servidor1</em> 
    y <em>Servidor2</em>. El servidor 1 ser&aacute; el de administraci&oacute;n. 
    Utilizaremos un asistente que incorpora Weblogic para crear el dominio y los 
    servidores. Ejecutamos Bea products -&gt; Tools -&gt; Configuration Wizard dentro del men&uacute;
    de programas.</p>
<p>Nos aparecer&aacute; la ventana que se muestra en la siguiente figura, en 
    la que podemos optar por crear una nueva configuraci&oacute;n o extender (a&ntilde;adir 
    nuevas caracter&iacute;sticas) a una existente. Vamos a seleccionar crear 
    una nueva configuraci&oacute;n. Pulsamos en el bot&oacute;n <em>Next.</em>
</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/12-2004.jpg" width="780"></p>
<p>Ahora debemos seleccionar si queremos instalar un dominio con diferentes opciones, como puede ser hacer uso de una plantilla. Nos interesa la opci&oacute;n 
    seleccionada.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/13-2004.jpg" width="780"></p>
<p>En la siguiente pantalla debemos configurar un usuario de administraci&oacute;n. Vamos a 
	darle como nombre <em>system</em> y como contrase&ntilde;a <em>weblogic</em>.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/23-2004.jpg" width="780"></p>
<p>Como ya comentamos, existen dos modos principales de trabajo: modo desarrollo 
	y modo producci&oacute;n. Para cada modo existen una serie de caracter&iacute;sticas 
	que est&aacute;n habilitadas o no. Nosotros vamos a trabajar siempre en modo 
	desarrollo. Podemos seleccionar la versi&oacute;n de Java que m&aacute;s nos 
	convenga. Por defecto vamos a utilizar siempre la versi&oacute;n de Java que 
	incorpora WebLogic.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/24-2004.jpg" width="780"></p>
<p>Pulsamos <em>Next</em> y nos deja elegir entre definir un dominio sencillo (con las opciones por defecto) o definir nuestra propia configuraci&oacute;n. 
    Elegimos <em>Yes</em> para comprobar las opciones disponibles. 
    Pulsamos <em>Next</em>.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/14-2004.jpg" width="780"></p>
<p>En la siguiente pantalla se nos pide que definamos el servidor de administraci&oacute;n. 
    Tenemos que definir el nombre del servidor (debe ser &uacute;nico en el dominio), 
    en qu&eacute; direcci&oacute;n (IP &oacute; DNS) estar&aacute; escuchando 
    el servidor y los puertos de escucha (por defecto se suele dar el 7001 y el 
    7002 para el puerto seguro).</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/16-2004.jpg" width="780"></p>
<p>Al pinchar en <em>Next</em> nos aparece la ventana mostrada a continuaci&oacute;n 
    donde podemos definir nuevos servidores. Los botones <em>Add </em>y <em>Delete</em> 
    sirven para a&ntilde;adir nuevos servidores o eliminarlos. Para cada nuevo 
    servidor debemos definir las mismas opciones que dimos al servidor de administraci&oacute;n. 
    Un punto importante es que el puerto de escucha debe ser distinto para cada 
    servidor que se ejecute en la misma m&aacute;quina.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/17-2004.jpg" width="780"></p>
<p>La siguiente pantalla nos permite definir un cluster. Veremos esta opci&oacute;n 
    m&aacute;s adelante, de momento pasamos de pantalla.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/18-2004.jpg" width="780"></p>
<p>En esta se nos permite definir una m&aacute;quina. Tambi&eacute;n lo dejamos 
      para m&aacute;s adelante.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/20-2004.jpg" width="780"></p>
<p>Esta ventana nos muestra la informaci&oacute;n introducida (servidores, m&aacute;quinas, 
	etc.) previamente. </p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/25-2004.jpg" width="780"></p>
<p>En esta pantalla nos pide que demos el nombre del dominio y el directorio
	donde queremos que se instale. Se va a llamar <em>prueba1.</em>
</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/25b-2004.jpg" width="780"></p>
<p>Iniciamos la creaci&oacute;n del dominio y cuando finalice nos tiene que 
    aparecer una ventana como la siguiente. Pinchamos en <em>Done</em> y hemos 
    terminado de definir el dominio.</p>
<p>
<img alt="" content-width="11cm" src="imagenes/instalacion/26-2004.jpg" width="780"></p>
<p>Una vez creado el dominio la estructura de directorios creada es la siguiente:</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/27-2007.jpg"></p>
<p>Dentro del directorio <em>servers</em> tenemos un directorio por cada servidor creado, donde se guardan datos espec&iacute;ficos 
    del servidor (por ejemplo el fichero log). Estos directorios se crean cuando 
    se pongan en marcha los servidores. El fichero <em>config.xml</em> (dentro del directorio <em>config</em> contiene 
    los datos del dominio (nombre de los servidores, m&aacute;quinas, dominio, 
    etc., nombre de las aplicaciones y su configuraci&oacute;n, etc.). El fichero <em>startWebLogic.cmd</em> sirve
     para arrancar los servidores. El fichero <em>startManagedWebLogic_readme.txt</em> contiene instrucciones de c&oacute;mo arrancar los
    servidores administrados.</p>
<a name="N102A3"></a><a name="Arranque+y+configuraci%C3%B3n"></a>
<h3 class="underlined_5">Arranque y configuraci&oacute;n</h3>
<p>El proceso anterior nos ha creado un nuevo submen&uacute; en el men&uacute; <em>Bea products</em>.
  El nuevo men&uacute; se llama <em>Users projects</em> y contendr&aacute; los dominios que vayamos
  creando. Nos tiene que aparecer el dominio Prueba1 y las opciones que nos aparecen
  en la siguiente imagen.</p>
<p>
<img alt="" content-width="10cm" src="imagenes/instalacion/271-2007.jpg"></p>
<p>Para poner en marcha el servidor de administraci&oacute;n debemos ejecutar 
  la opci&oacute;n correspondiente. Nos aparecer&aacute; un terminal y tenemos que esperar hasta
  que nos aparezca el mensaje:</p>
<p>
<em>&lt;Server started in RUNNING mode&gt;</em>
</p>
<p>Para arrancar un servidor administrado, tenemos que abrir una terminal y ejecutar:</p>
<p>
<em>C:\bea\user_projects\domains\prueba1\bin\startManagedWebLogic.cmd 
  Servidor2 http://localhost:7001</em>
</p>
<p>donde Servidor2 es el nombre del servidor administrado y la siguiente direcci&oacute;n
  es la de escucha del servidor de administraci&oacute;n.</p>
<p>El servidor de administraci&oacute;n nos facilita una aplicaci&oacute;n que 
    permite administrar nuestro dominio. Es la consola de administraci&oacute;n 
    (<em>Console</em>). Con la consola podemos configurar los atributos de los 
    distintos recursos, hacer despliegues de aplicaciones, monitorizar el uso 
    de recursos, ver mensajes de log y poner en marcha o parar los distintos servidores 
    de nuestro dominio. La consola se gestiona con un navegador en la siguiente 
    direcci&oacute;n: <em>http://direcci&oacute;n-de-escucha:7001/console</em> o
    bien ejecutamos la opci&oacute;n del men&uacute; de nuestro dominio que arranca la consola. 
    Nos aparecer&aacute; una p&aacute;gina donde se nos solicita el usuario y 
    la contrase&ntilde;a. Una vez introducida nos aparecer&aacute; la siguiente 
    p&aacute;gina.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/28-2004.jpg"></p>
<p>Vamos a ver las distintas partes que nos aparecen en la consola de administraci&oacute;n. Lo primero es el <em>Change Center</em>.</p>
<p>
<img alt="Change Center" content-width="5cm" src="imagenes/instalacion/29-2005.jpg"></p>
<p>Si activamos la opci&oacute;n <em>Lock and Edit</em> se nos va a permitir hacer cambios en nuestro dominio. Si la activamos y modificamos alguna opci&oacute;n, nos tiene que aparecer una ventana como la siguiente:</p>
<p>
<img alt="" content-width="5cm" src="imagenes/instalacion/30-2005.jpg"></p>
<p>Ahora podemos aplicar los cambios hechos hasta el momento o deshacer estos cambios. Este control act&uacute;a como un <em>commit</em> en una base de datos: hasta que no se le da a aceptar no se aplican los cambios parciales. Hay cambios que se aplican directamente y otros para los que es necesario reiniciar el servidor. Estos &uacute;ltimos aparecen con el siguiente s&iacute;mbolo:</p>
<p>
<img alt="" content-width="0.5cm" src="imagenes/instalacion/31-2005.jpg"></p>
<p>Lo siguiente que nos aparece (en la parte izquierda de la ventana) es la estructura del dominio. Con estas opciones podemos acceder, crear, eliminar y configurar a los distintos elementos y servicios en nuestro dominio. Las primeras opciones nos permiten configurar los elementos del dominio (servidores, m&aacute;quinas, cluster, etc.). A continuaci&oacute;n podemos realizar despliegues de aplicaciones, aplicaciones web, EJBs, etc. Despu&eacute;s los servicios configurables (JDBC, JMS, Virtual Hosts, etc.). Por &uacute;ltimo, aparecen opciones de seguridad, interoperatibilidad y diagn&oacute;stico, que iremos viendo conforme necesitemos.</p>
<p>
<img alt="" content-width="5cm" src="imagenes/instalacion/32-2005.jpg"></p>
<p>M&aacute;s abajo tenemos una ayuda <em>on-line</em>. Podemos minimizar esta opci&oacute;n con el bot&oacute;n en su parte superior derecha.</p>
<p>
<img alt="" content-width="5cm" src="imagenes/instalacion/33-2005.jpg"></p>
<p>Siguiendo hacia abajo, se nos muestra el estado del sistema.</p>
<p>
<img alt="" content-width="5cm" src="imagenes/instalacion/34-2005.jpg"></p>
<p>En la siguiente columna (la parte de la derecha m&aacute;s amplia) tenemos toda la informaci&oacute;n de dominio y podemos ir accediendo a sus distintos elementos. La barra superior (ver siguiente figura) nos muestra datos del dominio, y distintas opciones que podemos seleccionar:</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/35-2005.jpg"></p>
<p>Las opciones son bastante triviales. Vamos a ver la de <em>preferences</em>. Al pinchar esta opci&oacute;n nos aparece la siguiente ventana:</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/36-2007.jpg"></p>
<p>Las opciones que nos interesan son: <em>Show Inline Help</em> que nos muestra informaci&oacute;n de cada campo y cada ventana y <em>File Browser Start</em> que nos dice el directorio que nos aparecer&aacute; por defecto cuando pinchemos en una opci&oacute;n para seleccionar un fichero.</p>
<p>Vamos a ir viendo las distintas opciones en el apartado de configuraci&oacute;n del dominio. Pinchamos en <em>Prueba1</em> y nos aparecer&aacute; lo siguiente:</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/37-2005.jpg"></p>
<ul>
	
<li>La habilitaci&oacute;n del puerto de administraci&oacute;n, si marcada, 
		permite que todos los elementos del dominio se comuniquen con el servidor 
		de administraci&oacute;n mediante una conexi&oacute;n segura. Adem&aacute;s 
		podemos configurar un puerto adicional (no puede ser el seguro del servidor 
		de administraci&oacute;n) para dichas comunicaciones. Esta opci&oacute;n 
		permite que podamos arrancar un servidor en modo <em>standby</em> en el cual 
		el servidor no escucha las peticiones que le llegan a su puerto, pero se 
		permite una comunicaci&oacute;n con el servidor de administraci&oacute;n. 
		Tambi&eacute;n permite separar las peticiones de aplicaci&oacute;n (llegan 
		de las aplicaciones que usan el sistema) de las peticiones de administraci&oacute;n 
		(generadas por o hacia el servidor de administraci&oacute;n). De esta manera 
		una petici&oacute;n del servidor de administraci&oacute;n puede ser atendida 
		sin tener que esperar su turno dentro de las peticiones de aplicaci&oacute;n. 
		Si activamos esta opci&oacute;n debemos asignarle un puerto de comunicaci&oacute;n. 
		Al activar la opci&oacute;n, la consola s&oacute;lo responde por https://direcci&oacute;n:puerto-asignado/console</li>
	
<li>La opci&oacute;n siguiente nos permite especificar si trabajamos en modo 
		producci&oacute;n. La activaci&oacute;n de esta opci&oacute;n implica que 
		ciertas caracter&iacute;sticas est&aacute;n activas y otras no.</li>
	
<li>Si activamos la &uacute;ltima opci&oacute;n para que un cluster responda 
		a una aplicaci&oacute;n todos sus servidores tienen que estar funcionando 
		a la vez.</li>

</ul>
<p>Si pinchamos en la opci&oacute;n <em>Advanced</em> se nos mostrar&aacute;n algunas opciones avanzadas. Algunas de ellas son: </p>
<ul>
	
<li>Habilitar la consola. En modo producci&oacute;n suele ser habitual deshabilitar 
		la consola, para que no pueda ser accedida desde el exterior. </li>
	
<li>La siguiente opci&oacute;n nos permite dar un nombre distinto a la aplicaci&oacute;n 
		de la consola. Si, por ejemplo, damos el nombre <em>miconsola</em>, para 
		acceder a la consola tendr&iacute;amos que teclear http://direcci&oacute;n:puerto/miconsola.</li>

</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/38-2005.jpg"></p>
<p>En la solapa de <em>Logging</em> (el resto de opciones las veremos conforme las 
    necesitemos) podemos configurar el fichero log del dominio. El fichero log almacena 
    toda la informaci&oacute;n y mensajes del dominio. Las opciones son las siguientes:</p>
<ul>
    
<li>Podemos cambiar el nombre del fichero log. </li>
    
<li>La siguiente opci&oacute;n permite especificar el tipo de rotaci&oacute;n. 
      Las opciones a elegir son por tama&ntilde;o o por tiempo. La rotaci&oacute;n 
      permite que el fichero log no vaya creciendo indefinidamente. Si elegimos 
      por tama&ntilde;o, se coger&aacute; el valor del par&aacute;metro <em>Maximum 
      File Size</em> y, cuando el fichero de log alcance ese tama&ntilde;o, crear&aacute; 
      un nuevo fichero de log, renombrando el anterior. Si, por ejemplo, el nombre 
      del fichero de log es <em>midominio.log</em> y hemos seleccionado una rotaci&oacute;n 
      por tama&ntilde;o y 500k de tama&ntilde;o m&iacute;nimo, cuando el fichero 
      alcance ese tama&ntilde;o el sistema cambiar&aacute; el nombre del fichero 
      por <em>midominio.0</em> y crear&aacute; uno nuevo, <em>midominio.log</em>, 
      donde se seguir&aacute; almacenando la salida del sistema. Cuando se vuelva 
      a superar ese l&iacute;mite se le dar&aacute; el nombre <em>midominio.1</em> 
      y as&iacute; sucesivamente. El otro tipo de rotaci&oacute;n, de tiempo, 
      act&uacute;a de manera similar, pero especificando un tiempo de rotaci&oacute;n. 
      Cuando el reloj del sistema llega a esa hora se produce el cambio de fichero. 
      En esta opci&oacute;n, podemos especificar cada cuantas horas se produce 
      el cambio, cambiando el valor de <em>Rotation Interval</em>. </li>
    
<li>La pen&uacute;ltima opci&oacute;n permite limitar el n&uacute;mero de 
      ficheros a almacenar. Si la activamos toma el valor de la siguiente opci&oacute;n 
      <em>Files to Retain </em>y, cuando el contador de fichero alcance ese 
      valor, empieza desde cero sobreescribiendo el primero.</li>
  
</ul>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/39-2005.jpg"></p>
<p>La opci&oacute;n <em>Log Filters</em> permite crear filtros para la informaci&oacute;n que se mostrar&iacute;a en el fichero log. No entramos en c&oacute;mo crear estos filtros, pero una opci&oacute;n interesante y que nos aparecer&aacute; en otras pantallas es <em>Customize this table</em>. Sin pinchamos en esta opci&oacute;n, nos aparecer&aacute; algo similar a lo mostrado en la siguiente figura y nos permite indicar el orden de visualizaci&oacute;n de los elementos en la ventana, el n&uacute;mero total de elementos a mostrar y varias opciones m&aacute;s.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/40-2005.jpg"></p>
<p>Cuando seleccionamos la solapa <em>Monitoring</em> nos aparece la informaci&oacute;n mostrada 
en la siguiente figura. Dispondremos de la informaci&oacute;n por separado de cada servidor
as&iacute; como el estado de los servicios en cada servidor. Tambi&eacute;n tenemos una opci&oacute;n para ver el estado de los servidores en nuestro dominio y los clusters creados</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/41-2005.jpg"></p>
<p>La solapa de control permite controlar (parar, poner en marcha, etc.) los 
      servidores del dominio. </p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/42-2005.jpg"></p>
<p>La &uacute;ltima solapa, <em>Notes</em>, nos permite introducir notas asociadas 
a la configuraci&oacute;n actual. Esto es com&uacute;n en la mayor&iacute;a 
de opciones de configuraci&oacute;n. Tienen un car&aacute;cter informativo.</p>
<p>
<img alt="" content-width="14cm" src="imagenes/instalacion/46-2005.jpg"></p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
