<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Ejercicios de la sesi&oacute;n XML 4</title>
                
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" href="../../../../apuntes.css" type="text/css">
</head>
 <body>
<h1>XML y Bases de Datos</h1>
<p><b>1.</b> Vamos a utilizar la base de datos <code>catalog</code> (www.rvg.ua.es:1521:j2eebd), 
  que contiene dos tablas: <code>categories</code>, y <code>category_products</code>, 
  con los siguientes campos:</p>
<ul>
  <li><code>Tabla categories</code>: categid (c&oacute;digo de la categor&iacute;a), 
    categname (nombre de la categor&iacute;a), categdesc (descripci&oacute;n <code>de 
    la categor&iacute;a) </code></li>
  <li><code>Tabla category_products:</code> productid (identificador del producto), 
    categid (c&oacute;digo de la categor&iacute;a), prodname (nombre del producto), 
    procdesc (descripci&oacute;n del producto). </li>
</ul>
<p>Utilizando la utilidad XSU, crear las clases correspondientes para realizar 
  las siguientes operaciones en la base de datos anterior:</p>
<ul>
  <li>Dado un nombre de categor&iacute;a, que se pasa como parámetro de entrada, 
    obtener un fichero XML con la lista de productos de dicha categor&iacute;a.</li>
  <li>Dado un fichero XML de entrada, con cinco productos, insertarlos en la base 
    de datos, de forma que si su identificador de categor&iacute;a es nuevo, se 
    a&ntilde;ada dicho identificador en la tabla de categor&iacute;as. </li>
  <li>Dado un nombre de categor&iacute;a, que se pasa como par&aacute;metro de 
    entrada, actualizar la descripci&oacute;n de los productos de la base de datos 
    con esa categor&iacute;a, a&ntilde;adiendo el texto: &quot;consumir antes 
    de fin de mes&quot;.</li>
</ul>
<p><br>
</p>
<p><b>2.</b> Utilizando la base de datos anterior, pero en la que hay los siguientes 
  campos adicional es: </p>
<ul>
  <li><code>en la tabla categories:</code> campo <code>prodschema</code> (documento 
    XML con el formato de los datos de la categor&iacute;a)</li>
  <li><code>en la tabla category_products</code>: campo <code>prodxml</code> (documento 
    XML con los datos del producto) </li>
</ul>
<p>Implementar las clases correspondientes para realizar las siguientes operaciones 
  en dicha base de datos:</p>
<ul>
  <li>Dado un nombre de categor&iacute;a, que se pasa como parámetro de entrada, 
    obtener un fichero con un listado de los campos <code>prodxml</code> de todos 
    productos de dicha categor&iacute;a.</li>
  <li>Dado un fichero XML de entrada con los datos correspondientes al campo <code>prodxml</code> 
    de un producto, un nombre de producto, una descripci&oacute;n y un identificador 
    de categor&iacute;a y de producto, a&ntilde;adir dichos datos a la tabla de 
    categor&iacute;as de productos. Si el identificador de categor&iacute;a ya 
    existe, a&ntilde;adirlo en la tabla de categor&iacute;as.</li>
  <li>Dado un porcentaje de descuento, que se pasa como par&aacute;metro de entrada, 
    actualizar el precio de los productos de la base de datos cuyo precio despu&eacute;s 
    del descuento sea superior o igual a 7.</li>
</ul>
<p></p>
</body>
</html>
