<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Sesi&oacute;n 1 de ejercicios EJB - Introducci&oacute;n a los enterprise beans</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Componentes EJB" src="images/baner_j2ee_der.gif" title="Componentes EJB"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Componentes EJB</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Componentes EJB">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_1.1.2', 'skin/')" id="menu_1.1.2Title" class="menutitle">Teor&iacute;a</div>
<div id="menu_1.1.2" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-apuntes.html" title="Introducci&oacute;n a los Enterprise Beans">Sesi&oacute;n 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html" title="Seguridad">Sesi&oacute;n 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html" title="Transacciones">Sesi&oacute;n 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html" title="EJB 3.0">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html" title="JPA">Sesi&oacute;n 8</a>
</div>
<div class="menuitem">
<a href="roadmap.html" title="Roadmap EJB">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.3', 'skin/')" id="menu_selected_1.1.3Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Ejercicios</div>
<div id="menu_selected_1.1.3" class="selectedmenuitemgroup" style="display: block;">
<div class="menupage">
<div class="menupagetitle">Sesi&oacute;n 1</div>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html" title="Beans de sesi&oacute;n con estado">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html" title="Seguridad">Sesi&oacute;n 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html" title="Transacciones">Sesi&oacute;n 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html" title="EJB 3.0">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html" title="JPA">Sesi&oacute;n 8</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion01-ejercicios.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Sesi&oacute;n 1 de ejercicios EJB - Introducci&oacute;n a los enterprise beans</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Descarga+de+los+ejemplos">Descarga de los ejemplos</a>
</li>
<li>
<a href="#Creaci%C3%B3n+del+dominio+WebLogic">Creaci&oacute;n del dominio WebLogic</a>
</li>
<li>
<a href="#Despliegue+del+enterprise+bean+SaludoBean">Despliegue del enterprise bean SaludoBean</a>
</li>
<li>
<a href="#Prueba+del+bean+con+un+cliente">Prueba del bean con un cliente</a>
<ul class="minitoc">
<li>
<a href="#Conexi%C3%B3n+con+un+servidor+situado+en+un+host+distinto">Conexi&oacute;n con un servidor situado en un host distinto</a>
</li>
<li>
<a href="#Comprobaci%C3%B3n+la+latencia+de+la+respuesta">Comprobaci&oacute;n la latencia de la respuesta</a>
</li>
</ul>
</li>
<li>
<a href="#Despliegue+del+EAR+con+el+bean+y+una+aplicaci%C3%B3n+web">Despliegue del EAR con el bean y una aplicaci&oacute;n web</a>
</li>
</ul>
</div>


<p>Los ejercicios de esta sesi&oacute;n van a centrarse en el despliegue y uso de los enterprise beans. Vamos a trabajar con un sencillo ejemplo de bean de sesi&oacute;n sin estado, el bean <span class="codefrag">SaludoBean</span>, al que vamos acceder desde un cliente remoto (una aplicaci&oacute;n Java) y desde una aplicaci&oacute;n Web situada en la misma unidad de despliegue.</p>


<p>Gu&iacute;a r&aacute;pida del ejercicio (detallamos cada paso m&aacute;s adelante):</p>


<ul>

<li>Descargar el fichero <span class="codefrag">ZIP</span> con los ejemplo de esta sesi&oacute;n de ejercicios.</li>

<li>Crear el dominio <span class="codefrag">ejb</span> de WebLogic.</li>

<li>Desplegar en el dominio el bean <span class="codefrag">ejb-saludo.jar</span>, que contiene el EJB <span class="codefrag">SaludoBean</span>.</li>

<li>Crear en Eclipse el proyecto <span class="codefrag">ejb-cliente-saludo</span> y comprobar distintas formas de llamar al bean.</li>

<li>Eliminar el EJB del servidor y desplegar el paquete <span class="codefrag">ejb-saludoWebEAR.ear</span> que contiene una aplicaci&oacute;n web y un EJB; probar el cliente Java y la aplicaci&oacute;n web.</li>

</ul>


<a name="N10039"></a><a name="Descarga+de+los+ejemplos"></a>
<h2 class="underlined_10">Descarga de los ejemplos</h2>
<div class="section">
<p>El fichero ZIP con los ejemplos contiene los siguientes ficheros:</p>
<ul>

<li>El fichero EJB JAR <span class="codefrag">ejb-saludo.jar</span> que contiene el enterprise bean ejb-saludo</li>

<li>El fichero EAR <span class="codefrag">ejb-saludoWebEAR.ear</span> que contiene un m&oacute;dulo WAR (la aplicaci&oacute;n web <span class="codefrag">ejb-saludoWar.war</span>) y el EJB <span class="codefrag">SaludoBean</span>
</li>

<li>El directorio <span class="codefrag">jars</span> que contiene los ficheros JAR necesarios para implementar un programa que llame el bean</li>

</ul>
</div>



<a name="N1005D"></a><a name="Creaci%C3%B3n+del+dominio+WebLogic"></a>
<h2 class="underlined_10">Creaci&oacute;n del dominio WebLogic</h2>
<div class="section">
<p>Crea un dominio WebLogic vac&iacute;o con el nombre <span class="codefrag">ejb</span> en el que probar los ejemplos. Para ello, selecciona en el men&uacute; Inicio de Windows la opci&oacute;n: </p>
<pre class="code">BEA Products &gt; Tools &gt; Configuration Wizard</pre>
<p>Y sigue los siguientes pasos:</p>
<p>1. Acepta la opci&oacute;n por defecto <em>Create a new WebLogic domain</em> y pasa a la siguiente pantalla.</p>
<p>2. Deja sin activar la opci&oacute;n para que el dominio se configure para que soporte el WebLogic Workshop (se instalar&iacute;an en el servidor de aplicaciones las librer&iacute;as que usan por defecto los proyectos creados con el WebLogic Workshop) y pasa a la siguiente pantalla.</p>
<p>3. Debes dar un login y contrase&ntilde;a para el usuario de administraci&oacute;n del servidor de aplicaciones. Por ejemplo, deja el usuario que est&aacute; por defecto ("weblogic") y escribe como contrase&ntilde;a la misma palabra ("weblogic"). Recuerda este usuario y contrase&ntilde;a, porque lo necesitar&aacute;s para administrar el servidor. </p>
<p>4. La siguiente pantalla te preguntar&aacute; por el modo del servidor, desarrollo o producci&oacute;n, as&iacute; como por el Java SDK que queremos usar. Acepta el modo que aparece por defecto, y escoge el Java SDK de Sun que hay instalado en la m&aacute;quina.</p>
<p>5. La siguiente pantalla te permite configurar distintas opciones del servidor. Pasa a la siguiente pantalla sin configurar nada.</p>
<p>6. La &uacute;ltima pantalla te pide el nombre del dominio y el directorio donde se instala. Escribe como nombre "ejb" y acepta el directorio por defecto de instalaci&oacute;n (<span class="codefrag">C:\bea\user_projects\domains</span>).</p>
<p>7. Pulsa "Create" y aparecer&aacute; una &uacute;ltima ventana de resumen con las caracter&iacute;sticas de la nueva configuraci&oacute;n. Pulsa "Done" y el asistente se cerrar&aacute;.</p>
<p> Una vez que se ha creado el nuevo dominio, lanza el servidor de aplicaciones con esa nueva configuraci&oacute;n vac&iacute;a. Para ello escoge en el men&uacute; Inicio de Windows la opci&oacute;n:</p>
<pre class="code">BEA Products &gt; User Projects &gt; ejb &gt; Start Admin Server ...</pre>
<p>Deja el terminal abierto porque ah&iacute; vas a poder ver todos los mensajes que genere el servidor de aplicaciones y todo lo que escriban los beans por la salida est&aacute;ndar.</p>
<p>7. Por &uacute;ltimo, lanza la consola de administraci&oacute;n. Para ello, escoge en el men&uacute; Inicio de Windows la opci&oacute;n:</p>
<pre class="code">BEA Products &gt; User Projects &gt; ejb &gt; Admin Server Console</pre>
<p>Se abre un navegador que se conecta a la URL <em>http://localhost:7001/console</em>. Deber&aacute;s ver la consola de administraci&oacute;n del WebLogic y deber&aacute;s poder entrar en ella con el usuario "weblogic" y la contrase&ntilde;a "weblogic". Despu&eacute;s de hacerlo ya deber&aacute; aparecer la siguiente pantalla:</p>
<p>

<img alt="" content-width="14cm" src="imagenes/ejercicios01/img1.png">
</p>
</div>


<a name="N100AB"></a><a name="Despliegue+del+enterprise+bean+SaludoBean"></a>
<h2 class="underlined_10">Despliegue del enterprise bean SaludoBean</h2>
<div class="section">
<p>Vamos ahora a ver, paso a paso, c&oacute;mo desplegar un enterprise bean ya creado y empaquetado en un fichero EJB JAR. Existen distintas herramientas y distintas configuraciones para realizar este despliegue. Por ejemplo, es posible usar la herramienta <em>ant</em> y algunas tareas ant proporcionadas por el servidor de aplicaciones. Vamos a escoger la forma m&aacute;s visual (y menos automatizable) realizar el despliegue utilizando la consola de administraci&oacute;n.</p>
<p>1. Descarga el fichero <span class="codefrag">sesion01-ejercicios.zip</span> y descompr&iacute;melo. Vamos a desplegar en esta primera parte de los ejercicios el fichero <span class="codefrag">ejb-saludo.jar</span>, que es un fichero EJB JAR que contiene el enterprise bean SaludoBean. Tambi&eacute;n vamos a usar el directorio <span class="codefrag">ejb-cliente-saludo</span> que es un proyecto eclipse que contiene un cliente Java que se realiza peticiones al bean SaludoBean.</p>
<p>2. Vamos a desplegar el bean en el servidor de aplicaciones utilizando la consola del sistema. Para ello, escoge la opci&oacute;n <em>Deployments</em> en la pantalla principal de administraci&oacute;n. Aparecer&aacute; la siguiente pantalla, mostrando que no hay ning&uacute;n despliegue en el dominio:</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img2.png">
</p>
<p>Pincha el bot&oacute;n <em>Lock &amp; Edit</em> (panel superior izquierdo) y se activar&aacute;n los botones para instalar despliegues. Pincha en el bot&oacute;n <em>Install</em> y aparecer&aacute; el asistente de instalaci&oacute;n de aplicaciones.</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img3.png">
</p>
<p>3. Selecciona el camino donde se encuentra el directorio <span class="codefrag">sesion1-bean</span>, en el directorio de trabajo de Eclipse y escoge el directorio como muestra la siguiente figura.</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img4.png">
</p>
<p>Pulsando en <em>Next</em> el asistente pregunta si queremos desplegar el bean como una aplicaci&oacute;n o como una biblioteca. Seleccionamos la primera opci&oacute;n (est&aacute; por defecto) y pulsamos de nuevo <em>Next</em>.</p>
<p>En la siguiente pantalla podemos escoger un nombre para el despliegue, deja el que est&aacute; por defecto. Tambi&eacute;n podemos seleccionar la pol&iacute;tica de seguridad que vamos a seguir, si la descrita en el fichero descriptor de despliegue o la propia del servidor de aplicaciones. Tambi&eacute;n nos permite modificar la pol&iacute;tica de seguridad del descriptor de despliegue. Deja la opci&oacute;n por defecto. Por &uacute;ltimo, podemos especificar la ubicaci&oacute;n de los ficheros fuente. Deja tambi&eacute;n la que viene por defecto y pulsa <em>Next</em>.</p>
<p>Aparece la &uacute;ltima pantalla con un resumen y la opci&oacute;n <em>Finish</em> para terminar el despliegue. Tambi&eacute;n aparecer&aacute; la opci&oacute;n <em>Additional configuration</em> en donde especificamos si queremos realizar configuraciones adicionales en el despliegue o lo dejamos para despu&eacute;s. Selecciona la opci&oacute;n <em>No,  I will review the configuration later.</em>. Pulsa <em>Finish</em> y aparecer&aacute; la siguiente pantalla</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img5.png">
</p>
<p>Pulsa <em>Activate Changes</em> (panel superior izquierdo) para que se actualicen todos los cambios que has introducido. </p>
<p>Lo &uacute;ltimo que falta por hacer es poner en marcha el bean. Selecciona el m&oacute;dulo de despliegue <em>sesion1-bean</em> (en la figura aparecen sus contenidos, el bean <em>SaludoBean</em>). Pulsa el bot&oacute;n <em>Start</em> y la opci&oacute;n <em>Servicing all request</em> para que comience a funcionar el bean. </p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img6.png">
</p>
<p>Conf&iacute;rmalo pulsando <em>yes</em> en la siguiente pantalla y aparecer&aacute; la &uacute;ltima pantalla mostrando el bean en estado de activo.</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img7.png">
</p>
<p>Con esto se terminar el ejercicio. Hemos instalado en el servidor de aplicaciones un enterprise bean con el nombre de <span class="codefrag">SaludoBean</span>. En el ejercicio siguiente probaremos un cliente java que se conecta con &eacute;l.</p>
</div>


<a name="N10148"></a><a name="Prueba+del+bean+con+un+cliente"></a>
<h2 class="underlined_10">Prueba del bean con un cliente</h2>
<div class="section">
<p>Una vez desplegado el bean <span class="codefrag">SaludoBean</span> en el servidor de aplicaciones, vamos a probar a utilizar sus servicios desde un programa Java.</p>
<p>El bean est&aacute; especificado por la siguiente interfaz (<span class="codefrag">es.ua.jtech.ejb.beans.Saludo</span>):</p>
<pre class="code">package es.ua.jtech.ejb.beans;

import javax.ejb.EJBObject;
import java.rmi.RemoteException;

public interface Saludo extends EJBObject {
	public String saluda() throws RemoteException;
	public SaludoTO getSaludo(int numDatos) throws RemoteException;
}</pre>
<p>Vemos que el cliente del bean puede usar dos m&eacute;todos remotos: el m&eacute;todo <span class="codefrag">Saluda</span> que devuelve un String y el m&eacute;todo <span class="codefrag">getSaludo</span> al que se le pasa un <span class="codefrag">int</span> y que devuelve un <span class="codefrag">SaludoTO</span>. Vamos a probar a llamar a estos m&eacute;todos. Para ello debemos escribir un programa Java que realice los siguientes pasos: </p>
<ol>

<li>Obtener el contexto JNDI</li>

<li>Obtener el objeto <em>Home</em> del bean <span class="codefrag">SaludoBean</span>
</li>

<li>Crear un bean <span class="codefrag">Saludo</span> llamando al m&eacute;todo <span class="codefrag">create </span> del objeto <em>Home</em>
</li>

<li>Llamar al m&eacute;todo deseado de la interfaz <span class="codefrag">Saludo</span>
</li>

</ol>
<p>El programa para acceder al bean es el siguiente:</p>
<pre class="code">package es.ua.jtech.ejb.clientes;

import java.io.IOException;
import java.util.Date;
import java.util.List;
import java.util.Properties;
import javax.naming.Context;
import javax.naming.InitialContext;
import javax.rmi.PortableRemoteObject;

import es.ua.jtech.ejb.beans.Saludo;
import es.ua.jtech.ejb.beans.SaludoHome;
import es.ua.jtech.ejb.beans.SaludoTO;

public class ClienteSaludo {

 public static void main(String[] args) {
    try {
       System.out.println("Fecha actual: " + (new Date()).toString());
       Context jndiContext = getInitialContext(); 
       Object obj = jndiContext.lookup("SaludoBean");
       SaludoHome home = (SaludoHome) narrow(obj, SaludoHome.class);
       obj = home.create(); 
       Saludo saludo = (Saludo) narrow(obj, Saludo.class);
         
       System.out.println("Voy a llamar al bean");
       String beanSaludo = saludo.saluda();
       System.out.println("El bean saludo dice: " + beanSaludo);
       System.out.println("Ya he llamado al bean");
    } catch (Exception e) {
        e.printStackTrace();
    }
 }

/* M&eacute;todos privados */
}</pre>
<p>Los m&eacute;todos privados son <span class="codefrag">getInitialContext()</span> y <span class="codefrag">narrow()</span> y se explican a continuaci&oacute;n.</p>
<p>Obtenci&oacute;n del contexto JNDI:</p>
<pre class="code">private static Context getInitialContext()
   throws javax.naming.NamingException, IOException {
   Properties p = new Properties();
   p.put(Context.INITIAL_CONTEXT_FACTORY,
           "weblogic.jndi.WLInitialContextFactory");
   p.put(Context.PROVIDER_URL, "t3://localhost:7001");
   return new InitialContext(p);}</pre>
<p>Los objetos que recibimos del servidor de aplicaciones (el objeto <em>Home</em> y el objeto que implementa la interfaz <span class="codefrag">Saludo</span>) son objetos remotos RMI serializados con el est&aacute;ndar CORBA. Para convertirlos en objetos Java hay que hacer un tipo especial de <em>casting</em> definido en el m&eacute;todo privado  <span class="codefrag">narrow</span>:</p>
<pre class="code">private static Object narrow(Object obj, Class clase) {
   return PortableRemoteObject.narrow(obj, clase);
}</pre>
<p>En concreto, en el ejercicio debes hacer lo siguiente:</p>
<ul>

<li>Crea un proyecto Java llamado <span class="codefrag">ejb-cliente-saludo</span>
</li>

<li>Incluye en el proyecto las librer&iacute;as <span class="codefrag">wlclient.jar</span> (librer&iacute;a de WebLogic que contiene las clases relacionadas con la obtenci&oacute;n del contexto JNDI) y <span class="codefrag">ejb-saludo-clientjar.jar</span> (que contiene las interfaces del bean) que se encuentran en el directorio <span class="codefrag">jars</span> del fichero ZIP de la sesi&oacute;n</li>

<li>Escribe el programa <span class="codefrag">es.ua.jtech.ejb.clientes.ClienteSaludo</span>
</li>

<li>Ejecuta el programa</li>

</ul>
<p>Si todo ha funcionado correctamente, el cliente se conectar&aacute; con el bean y escribir&aacute; en la salida est&aacute;ndar unos mensajes como:</p>
<pre class="code">Fecha actual: ...
Voy a llamar al bean
El bean saludo dice: Cuanto tiempo sin verte
Ya he llamado al bean</pre>
<p>Prueba a ejecutar el programa varias veces para comprobar que aparecen mensajes distintos.</p>
<a name="N101DE"></a><a name="Conexi%C3%B3n+con+un+servidor+situado+en+un+host+distinto"></a>
<h3 class="underlined_5">Conexi&oacute;n con un servidor situado en un host distinto</h3>
<p>En este ejercicio comprobaremos una de las caracter&iacute;sticas fundamentales de los beans: su naturaleza distribuida y concurrente.</p>
<p>1. Escoged una m&aacute;quina del laboratorio en el que alguno de los compa&ntilde;eros haya instalado el servidor de aplicaciones y el bean.</p>
<p>2. Modificad el c&oacute;digo del cliente para que se conecte con ese servidor.</p>
<p>3. Ejecutad varios clientes para comprobar que el servidor de aplicaciones responde a todas las peticiones.</p>
<a name="N101F1"></a><a name="Comprobaci%C3%B3n+la+latencia+de+la+respuesta"></a>
<h3 class="underlined_5">Comprobaci&oacute;n la latencia de la respuesta</h3>
<p>Vuelve a cambiar el c&oacute;digo para que el cliente se conecte con tu servidor de aplicaciones. Vamos ahora a probar el otro m&eacute;todo remoto, en el que se va a obtener una lista de enteros que debe serializarse y transportarse por la red. Vamos a comprobar que la respuesta tardar&aacute; m&aacute;s o menos tiempo dependiendo del tama&ntilde;o de la lista.</p>
<p>En concreto, el otro m&eacute;todo remoto que proporciona la interfaz <span class="codefrag">Saludo</span> es el m&eacute;todo <span class="codefrag">getSaludo</span> que devuelve un <span class="codefrag">SaludoTO</span>. Este objeto es un <em>transfer object</em> que contiene un saludo (de tipo <span class="codefrag">String</span>), una lista de enteros (de tipo <em>List</em>) y la fecha de creaci&oacute;n del bean (de tipo <span class="codefrag">java.util.Date</span>). </p>
<p>En el m&eacute;todo <span class="codefrag">getSaludo</span> hay que especificar el n&uacute;mero de enteros que van a crearse en el <span class="codefrag">SaludoTO</span>. Estos enteros se guardan en el <em>transfer object</em> en forma de <em>ArrayList</em>. El <em>transfer object</em> se crea en el servidor de aplicaciones y despu&eacute;s se serializa y se transmite al cliente como resultado de la llamada al m&eacute;todo. Esta transmisi&oacute;n durar&aacute; m&aacute;s o menos dependiendo del n&uacute;mero de enteros que se haya definido.</p>
<p>El siguiente fragmento de c&oacute;digo es un ejemplo de c&oacute;mo llamar a este m&eacute;todo:</p>
<pre class="code">// Creo una lista de 100 enteros
SaludoTO saludoTO = saludo.getSaludo(100);
System.out.println("Datos obtenidos:");
System.out.println("Mensaje: " + saludoTO.getMensaje());
System.out.println("Fecha creaci&oacute;n enterprise bean: " + saludoTO.getFecha().toString());
List datos = saludoTO.getDatos();		
System.out.println("Los datos tienen " + datos.size() + " elementos");
System.out.println("Fecha actual: " + (new Date()).toString());</pre>
<p>Prueba el ejemplo, creando distintos tama&ntilde;os de listas para comprobar la latencia de la red.</p>
</div>


<a name="N10230"></a><a name="Despliegue+del+EAR+con+el+bean+y+una+aplicaci%C3%B3n+web"></a>
<h2 class="underlined_10">Despliegue del EAR con el bean y una aplicaci&oacute;n web</h2>
<div class="section">
<p>Por &uacute;ltimo, vamos a desplegar un EAR en el que se incluye el mismo enterprise bean que antes (el bean <span class="codefrag">SaludoBean</span>) y adem&aacute;s una aplicaci&oacute;n web que accede al bean de modo local. Veremos la conexi&oacute;n remota al bean sigue funcionando y que la latencia de la conexi&oacute;n que realiza la aplicaci&oacute;n web es much&iacute;simo menor.</p>
<p>1. En primer lugar, vamos a desinstalar el EJB JAR del servidor de aplicaciones. Abre la pantalla de la consola en el navegador, pulsa en <em>Deployments</em> y det&eacute;n el EJB pinchando su casilla y la opci&oacute;n <em>Force Stop Now</em> del men&uacute; desplegable <em>Stop</em>:</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img8.png">
</p>
<p>Conf&iacute;rmalo en la siguiente pantalla.</p>
<p>2. Pulsa en el bot&oacute;n <em>Lock &amp; Edit</em> y ahora podr&aacute;s pinchar en la casilla del bean y en el bot&oacute;n <em>Delete</em>:</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img9.png">
</p>
<p>Conf&iacute;rmalo en la siguiente pantalla que aparece y pulsa en el bot&oacute;n verde <em>Activate Changes</em> en el panel superior izquierdo para activar el borrado del bean.</p>
<p>

<img alt="" content-width="4cm" src="imagenes/ejercicios01/img10.png">
</p>
<p>3. Despliega ahora el fichero <span class="codefrag">ejb-saludoWebEAR.ear</span> y act&iacute;valo  siguiendo los mismos pasos que antes. Aparecer&aacute; la siguiente pantalla:</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img11.png">
</p>
<p>4. Comprueba el contenido del fichero EAR. Ver&aacute;s que est&aacute; formado por el m&oacute;dulo <span class="codefrag">ejb-saludo.jar</span> que contiene el EJB <span class="codefrag">SaludoBean</span> y la aplicaci&oacute;n web <span class="codefrag">ejb-saludoWar</span>:</p>
<p>

<img alt="" content-width="13cm" src="imagenes/ejercicios01/img12.png">
</p>
<p>5. Prueba a ejecutar el programa cliente, pidiendo un <span class="codefrag">SaludoTO</span> con 100.000 enteros. Un <span class="codefrag">int</span> de Java se codifica con 4 bytes, por lo que 100.000 enteros representan 390 KB que se transmitir&aacute;n de forma remota del servidor de aplicaciones al cliente.</p>
<p>6. Abre la URL donde reside la p&aacute;gina JSP que se comunica con el bean: <span class="codefrag">http://localhost:7001/</span> 
</p>
<p>

<img alt="" content-width="7cm" src="imagenes/ejercicios01/img13.png">
</p>
<p>Prueba a recargar la p&aacute;gina y ver&aacute;s que la latencia es muy peque&ntilde;a.</p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
