<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Seguridad</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario J2EE"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Componentes EJB" src="images/baner_j2ee_der.gif" title="Componentes EJB"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Componentes EJB</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Componentes EJB">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html" title="Introducci&oacute;n a los Enterprise Beans">Sesi&oacute;n 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html" title="Seguridad">Sesi&oacute;n 5</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesi&oacute;n 6</div>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html" title="EJB 3.0">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html" title="JPA">Sesi&oacute;n 8</a>
</div>
<div class="menuitem">
<a href="roadmap.html" title="Roadmap EJB">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html" title="Introducci&oacute;n a los Enterprise Beans">Sesi&oacute;n 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html" title="Beans de sesi&oacute;n">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html" title="Beans de sesi&oacute;n con estado">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html" title="Seguridad">Sesi&oacute;n 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html" title="Transacciones">Sesi&oacute;n 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html" title="EJB 3.0">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html" title="JPA">Sesi&oacute;n 8</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion06-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Seguridad</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n+a+la+seguridad+en+EJBs">Introducci&oacute;n a la seguridad en EJBs</a>
</li>
<li>
<a href="#Control+de+acceso+basado+en+roles">Control de acceso basado en roles</a>
<ul class="minitoc">
<li>
<a href="#Definici%C3%B3n+de+roles">Definici&oacute;n de roles</a>
</li>
<li>
<a href="#Asignaci%C3%B3n+de+usuarios+a+roles">Asignaci&oacute;n de usuarios a roles</a>
</li>
</ul>
</li>
<li>
<a href="#M%C3%A9todos+no-chequeados">M&eacute;todos no-chequeados</a>
</li>
<li>
<a href="#La+identidad+de+seguridad+runAs">La identidad de seguridad runAs</a>
</li>
<li>
<a href="#Gesti%C3%B3n+de+seguridad+programativa+en+el+EJB">Gesti&oacute;n de seguridad programativa en el EJB</a>
</li>
<li>
<a href="#Anotaciones+EJBGen+Weblogic+para+seguridad">Anotaciones EJBGen Weblogic para seguridad</a>
<ul class="minitoc">
<li>
<a href="#Definici%C3%B3n+de+roles-N1018F">Definici&oacute;n de roles</a>
</li>
<li>
<a href="#Asignaci%C3%B3n+de+usuarios+a+roles-N101A9">Asignaci&oacute;n de usuarios a roles</a>
</li>
</ul>
</li>
</ul>
</div>



<a name="N1000C"></a><a name="Introducci%C3%B3n+a+la+seguridad+en+EJBs"></a>
<h2 class="underlined_10">Introducci&oacute;n a la seguridad en EJBs</h2>
<div class="section">
<p>Los servidores Enterprise JavaBeans pueden soportar tres tipos
de seguridad: autentificaci&oacute;n, comunicaci&oacute;n segura y control de
acceso. En el m&oacute;dulo de seguridad se ha hecho hincapi&eacute; en los dos
primeros tipos de servicios usando las APIs que proporciona Java.
En este apartado veremos qu&eacute; mecanismos define la especificaci&oacute;n
EJB para el control de acceso a los EJBs. Revisemos brevemente cada
uno de los tipos de seguridad.</p>
<ul>

<li>
<p>
<strong>Autentificaci&oacute;n</strong>
</p>

<p>Dicho sencillamente, la autentificaci&oacute;n valida la identidad del
usuario. La forma m&aacute;s com&uacute;n de autentificaci&oacute;n es una simple
ventana de login que pide un nombre de usuario y una contrase&ntilde;a.
Una vez que los usuarios han pasado a trav&eacute;s del sistema de
autentificaci&oacute;n, pueden usar el sistema libremente, hasta el nivel
que les permita el control de acceso. La autentificaci&oacute;n se puede
basar tambi&eacute;n en tarjetas de identificaci&oacute;n, certificados y en
otros tipos de identificaci&oacute;n.</p>

</li>


<li>
<p>
<strong>Comunicaci&oacute;n segura</strong>
</p>

<p>Los canales de comunicaci&oacute;n entre un cliente y un servidor son
un elemento muy importante en la seguridad del sistema. Un canal de
comunicaci&oacute;n puede hacerse seguro mediante aislamiento f&iacute;sico (por
ejemplo, via una conexi&oacute;n de red dedicada) o por medio de la
encriptaci&oacute;n de la comunicaci&oacute;n entre el cliente y el servidor. El
aislamiento f&iacute;sico es caro, limita las posibilidades del sistema y
es casi imposible en Internet, por lo que lo m&aacute;s usual es la
encriptaci&oacute;n. Cuando la comunicaci&oacute;n se asegura mediante la
encriptaci&oacute;n, los mensajes se codifican de forma que no puedean ser
le&iacute;dos ni manipulados por individuos no autorizados. Esto se suele
consigue mediante el intercambio de claves criptogr&aacute;ficas entre el
cliente y el servidor. Las claves permiten al receptor del mensaje
decodificarlo y leerlo.</p>

</li>

<li>
<p>
<strong>Control de acceso</strong>
</p>

<p>El control de acceso (tambi&eacute;n conocido como autorizaci&oacute;n) aplica
pol&iacute;ticas de seguridad que regulan lo que un usuario espec&iacute;fico
puede y no puede hacer en el sistema. El control de acceso asegura
que los usuarios accedan s&oacute;lo a aquellos recursos a los que se les
ha dado permiso. El control de acceso puede restringir el acceso de
un usuario a subistemas, datos, y objetos de negocio. Por ejemplo,
a algunos usuarios se les puede dar permiso de modificar
informaci&oacute;n, mientras que otros s&oacute;lo tienen permiso de
visualizarla.</p>

</li>

</ul>
<p>La mayor&iacute;a de los servidores EJB soportan la comunicaci&oacute;n segura
a trav&eacute;s del protocolo SSL (Secure Socket Layer) y proporcionan
alg&uacute;n mecanismo de autentificaci&oacute;n, pero la especificaci&oacute;n
Enterprise JavaBeans s&oacute;lo especifica el control de acceso a los
EJBs.</p>
<p>Aunque la autentificaci&oacute;n no se especifica en EJB, a menudo se
consigue usando el API JNDI. Un cliente que usa JNDI puede
proporcionar informaci&oacute;n de autentificaci&oacute;n usando este API para
acceder a los recursos del servidor. Esta informaci&oacute;n se suele
pasar cuando el cliente intenta iniciar una conexi&oacute;n JNDI con el
servidor EJB. El siguiente c&oacute;digo muestra c&oacute;mo se a&ntilde;aden la
contrase&ntilde;a y el nombre de usuario a las propiedades de la conexi&oacute;n
que se usan para obtener una conexi&oacute;n JNDI con el servidor EJB:</p>
<pre class="code">
properties.put(Context.SECURITY_PRINCIPAL, userName );
properties.put(Context.SECURITY_CREDENTIALS, userPassword);

javax.naming.Context jndiContext = new
             javax.naming.InitialContext(properties);
Object ref= jndiContext.lookup("AccountEJB");
AccountHome accountHome = (AccountHome)
        PortableRemoteObject.narrow(ref, AccountHomeRemote.class);
</pre>
<p>La arquitectura EJB especifica que todas las apliaciones clientes que acceden a un
sistema EJB deben estar asociadas con una identidad de seguridad. La
identidad de seguridad representa el cliente o bien como un usuario o
bien como un rol. Un usuaro podr&iacute;a ser una persona, una credencial de
seguridad, un computador o incluso una tarjeta
inteligente. Normalmente, el usuario es una persona a la que se le
asigna una identidad cuando entra en el sistema. Un rol especifica una
categor&iacute;a de acceso a la que pueden pertenecer distintos usuarios. Por
ejemplo, el rol "<span class="codefrag">ReadOnly</span>" definir&iacute;a una categor&iacute;a en la
que s&oacute;lo se permite el acceso a operaciones de lectura de datos.</p>
<p>Normalmente el servidor EJB permite definir grupos de usarios a
los que se les va a asignar las mismas restricciones de seguridad.
&iquest;Cu&aacute;l es la diferencia entre roles y grupos? La diferencia
fundamental es que los roles son dependientes de la aplicaci&oacute;n que
se despliega, mientras que los grupos son dependientes de la
organizaci&oacute;n. Al desplegar una aplicaci&oacute;n es necesario realizar una
asignaci&oacute;n de roles a usuarios o grupos de usuarios. Esta
separaci&oacute;n entre roles y usuarios permite hacer la aplicaci&oacute;n
portable e independiente de la organizaci&oacute;n en la que se
despliega.</p>
<p>Cuando un cliente remoto se autentifica en el sistema EJB, se le
asocia una identidad de seguridad que dura el tiempo que est&aacute;
activa la sesi&oacute;n. Esta identidad se encuentra en una base de datos
o directorio espec&iacute;fico de la plataforma EJB. Esta base de datos o
directorio es responsable de almacenar las indentidades
individuales, su pertenencia a grupos y las asignaciones de roles a
grupos e individuos.</p>
<p>Una vez que se le ha asociado una identidad de seguridad a un
cliente remoto, est&aacute; listo para usar los beans. El servidor EJB
realiza un seguimiento de cada cliente y de su identidad. Cuando un
cliente invoca un m&eacute;todo de un EJB, el servidor EJB pasa
impl&iacute;citamente la identidad del cliente junto con la invocaci&oacute;n al
m&eacute;todo. Cuando el objeto EJB o el EJB home recibe la invocaci&oacute;n
debe chequear la identidad para asegurarse de que ese cliente puede
usar ese m&eacute;todo.</p>
</div>


<a name="N1004D"></a><a name="Control+de+acceso+basado+en+roles"></a>
<h2 class="underlined_10">Control de acceso basado en roles</h2>
<div class="section">
<p>En la arquitectura Enterprise JavaBeans, la identidad de seguridad se representa
por un objeto <span class="codefrag">java.security.Principal</span>. Este objeto act&uacute;a
como representante de usuarios, grupos, organizaciones, tarjetas
inteligentes, etc. frente a la arquitectura de control de acceso de
los EJB.</p>
<p>Los descriptores del despliegue incluyen elementos que declaran a
qu&eacute; roles l&oacute;gicos se permite el acceso a los m&eacute;todos de los enterprise
beans. Estos roles se consideran l&oacute;gicos porque no reflejan
directamente usuarios, grupos o cualquier otra identidad de seguridad
en un entorno operacional espec&iacute;fico. Los roles se hacen corresponder
con grupos de usuarios o usuarios del mundo real cuando el bean se
despliega. Esto permite que el bean sea portable ya que cada vez que
el bean se despliega en un nuevo sistema, los roles se asignan a
usuarios y grupos espec&iacute;ficos de ese entorno operacional.</p>
<a name="N1005C"></a><a name="Definici%C3%B3n+de+roles"></a>
<h3 class="underlined_5">Definici&oacute;n de roles</h3>
<p>He aqu&iacute; una porci&oacute;n de un fichero de despliegue de un EJB que
define dos roles de seguridad, <span class="codefrag">ReadOnly</span> y
<span class="codefrag">Administrator</span>:</p>
<pre class="code">
&lt;security-role&gt;
    &lt;description&gt;
       A este rol se le permite ejecutar cualquier m&eacute;todo del 
       bean y leer y escribir cualquier dato del bean.
    &lt;/description&gt;
    &lt;role-name&gt;
        Administrator
    &lt;/role-name&gt;
&lt;/security-role&gt;

&lt;security-role&gt;
    &lt;description&gt;
        A este rol se le permite localizar y leer informaci&oacute;n del bean.
        A este rol no se le permite modificar los datos del bean.
    &lt;/description&gt;
    &lt;role-name&gt;
        ReadOnly
    &lt;/role-name&gt;
&lt;/security-role&gt;
</pre>
<p>Los nombres de los roles en este descriptor no son nombres
reservados o especiales con significados predefinidos; son
simplemente nombres l&oacute;gicos escogidos por el ensamblador del
bean.</p>
<p>Una vez que se declaran los roles, pueden asociarse con m&eacute;todos en
los beans. El elemento <span class="codefrag">&lt;method-permission&gt;</span> es en el
que definimos a qu&eacute; m&eacute;todos puede acceder cada uno de los roles.</p>
<pre class="code">
&lt;method-permission&gt;
    &lt;role-name&gt;Administrator&lt;/role-name&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CustomerEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;*&lt;/method-name&gt;
    &lt;/method&gt;
&lt;/method-permission&gt;
&lt;method-permission&gt;
    &lt;role-name&gt;ReadOnly&lt;/role-name&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CustomerEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;getName&lt;/method-name&gt;
    &lt;/method&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CustomerEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;getAddress&lt;/method-name&gt;
    &lt;/method&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CustomerEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;findByPrimaryKey&lt;/method-name&gt;
    &lt;/method&gt;
&lt;/method-permission&gt;</pre>
<p>En el primer <span class="codefrag">method-permission</span> el rol
<span class="codefrag">Administrator</span> se asocia con todos los m&eacute;todos del EJB
CustomerEJB. En el segundo, se limita el acceso del rol
<span class="codefrag">ReadOnly</span> s&oacute;lo a tres m&eacute;todos: <span class="codefrag">getName()</span>,
<span class="codefrag">getAddress()</span> y <span class="codefrag">findByPrimaryKey()</span>. Cualquier
intento de un rol <span class="codefrag">ReadOnly</span> de acceder a un m&eacute;todo que no
sea &eacute;stos resultar&aacute; en una excepci&oacute;n.</p>
<a name="N10095"></a><a name="Asignaci%C3%B3n+de+usuarios+a+roles"></a>
<h3 class="underlined_5">Asignaci&oacute;n de usuarios a roles</h3>
<p>Hasta ahora hemos comentado que el acceso a los m&eacute;todos se restringe mediante roles, para no definir usuarios concretos en la aplicaci&oacute;n. Pero en alg&uacute;n momento hay que definir los usuarios y grupos (<em>principals</em>) asociados a los roles, ya que la autentificaci&oacute;n en Java se realiza en base a ellos.</p>
<p>En la arquitectura EJB se promueve una separaci&oacute;n de papeles, en la que unas tareas son realizadas por los desarrolladores y otras por los que se encargan de desplegar la aplicaci&oacute;n. En el caso de la seguridad, el desarr desarrollador del bean es el que debe de preocuparse de definir los roles y restringir el acceso a los m&eacute;todos, mientras que la persona que hace el despliegue se ocupa de asignar los roles a <em>principals</em>.</p>
<p>La forma de relacionar <em>principals</em> con roles es mediante el descriptor de despliegue propio del servidor de aplicaciones. En el servidor de aplicaciones BEA WebLogic Server esto se declara en el fichero "<strong>weblogic-ejb-jar.xml</strong>", mediante el elemento <span class="codefrag">security-role-assignment</span>. Por ejemplo, en el siguiente c&oacute;digo se asocian los <em>principals</em> "weblogic" y "admin" con el rol "administrador" y los <em>principals</em> "dgl", y "admin" al rol "bibliotecario" (un <em>principal</em> puede tener m&aacute;s de un rol, como es el caso de "admin"). Hacemos notar tambi&eacute;n que un principal puede ser un usuario o un grupo, como el segundo caso, en el que se utiliza el nombre de grupo "Bibliotecario". Los <em>principals</em> se definen en la consola de administraci&oacute;n de WebLogic.</p>
<pre class="code">&lt;security-role-assignment&gt;
   &lt;role-name&gt;administrador&lt;/role-name&gt;
   &lt;principal-name&gt;admin&lt;/principal-name&gt;
   &lt;principal-name&gt;weblogic&lt;/principal-name&gt;
&lt;/security-role-assignment&gt;

&lt;security-role-assignment&gt;
   &lt;role-name&gt;bibliotecario&lt;/role-name&gt;
   &lt;principal-name&gt;dgl&lt;/principal-name&gt;
   &lt;principal-name&gt;admin&lt;/principal-name&gt;
   &lt;principal-name&gt;Bibliotecario&lt;/principal-name&gt;
&lt;/security-role-assignment&gt;
</pre>
<p>Una vez que el bean se despliega y se pone en marcha, el contenedor se encarga de comprobar que los usuarios acceden &uacute;nicamente a aquellos m&eacute;todos a los que tienen permisos. Esto se consigue propagando la identidad de seguridad, el objeto <span class="codefrag">Principal</span>, en cada invocaci&oacute;n del cliente al bean.  Cuando el cliente invoca un m&eacute;todo de un bean, el objeto <span class="codefrag">Principal</span> del cliente se chequea para comprobar si el rol asociado tiene los privilegios necesarios.</p>
<p>Si un bean intenta acceder a cualquier otro bean mientras que est&aacute; sirviendo a un cliente, pasar&aacute; al segundo bean la identidad del
cliente para que se realiza un control de acceso en este segundo bean. De esta manera, el <span class="codefrag">Principal</span> del cliente se propaga de un bean al siguiente, asegurando que se controla el acceso acceda o no directamente al EJB.</p>
</div>


<a name="N100D4"></a><a name="M%C3%A9todos+no-chequeados"></a>
<h2 class="underlined_10">M&eacute;todos no-chequeados</h2>
<div class="section">
<p>Es posible definir un conjunto de m&eacute;todos como 
<span class="codefrag">unchecked</span>, lo que significa que los permisos de seguridad
no se chequean. Un m&eacute;todo no chequeado puede invocarse por
cualquier cliente, sin importancia de el rol que ese cliente est&eacute;
usando. A continuaci&oacute;n hay un ejemplo de declaraci&oacute;n de m&eacute;todos
no-chequeados:</p>
<pre class="code">&lt;method-permission&gt;
    &lt;unchecked/&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CabinEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;*&lt;/method-name&gt;
    &lt;/method&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CustomerEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;findByPrimaryKey&lt;/method-name&gt;
    &lt;/method&gt;
&lt;/method-permission&gt;
&lt;method-permission&gt;
    &lt;role-name&gt;administrator&lt;/role-name&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CabinEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;*&lt;/method-name&gt;
    &lt;/method&gt;
&lt;/method-permission&gt;</pre>
<p>Esta declaraci&oacute;n nos dice que todos los m&eacute;todos del EJB
<span class="codefrag">Cabin</span>, junto con el m&eacute;todo
<span class="codefrag">findByPrimaryKey()</span> del EJB <span class="codefrag">Customer</span>, son
no-chequeados. Un segundo elemento le da al administrador permiso para
acceder a todos los m&eacute;todos del EJB Cabin. El permiso no-chequeado
siempre tiene prioridad sobre cualquier otro permiso.</p>
</div>


<a name="N100F1"></a><a name="La+identidad+de+seguridad+runAs"></a>
<h2 class="underlined_10">La identidad de seguridad runAs</h2>
<div class="section">
<p>Mientras que los elementos <span class="codefrag">method-permission</span>
especifican qu&eacute; roles tienen acceso a qu&eacute; m&eacute;todos del bean, el
elemento <span class="codefrag">security-identity</span> especifica bajo qu&eacute; rol se ejecuta el EJB, usando el elemento <span class="codefrag">runAs</span>. En
otras palabras, el objeto rol que se define en <span class="codefrag">runAs</span> se
usa como la identidad del enterprise bean cuando &eacute;ste intenta invocar
m&eacute;todos en otros beans. Esta identidad no tiene por qu&eacute; ser la misma
que la identidad que accede al bean por primera vez.</p>
<p>Por ejemplo, los siguientes elementos del descriptor de despliegue
declaran que el m&eacute;todo <span class="codefrag">create()</span> s&oacute;lo puede accederse por
el rol <span class="codefrag">JimSmith</span> y que el EJB <span class="codefrag">Cabin</span> siempre se va ejecutar con una identidad <span class="codefrag">Administrator</span>.</p>
<pre class="code">&lt;enterprise-beans&gt;
...
    &lt;entity&gt;
        &lt;ejb-name&gt;CabinEJB&lt;/ejb-name&gt;
        ...
        &lt;security-identity&gt;
            &lt;run-as&gt;
               &lt;role-name&gt;Administrator&lt;/role-name&gt;
            &lt;/run-as&gt;
        &lt;/security-identity&gt;
        ...
    &lt;/entity&gt;
...
&lt;/enterprise-beans&gt;
&lt;assembly-descriptor&gt;
&lt;security-role&gt;
    &lt;role-name&gt;Administrator&lt;/role-name&gt;
&lt;/security-role
&lt;security-role&gt;
    &lt;role-name&gt;JimSmith&lt;/role-name&gt;
&lt;/security-role&gt;
...
&lt;method-permission&gt;
    &lt;role-name&gt;JimSmith&lt;/role-name&gt;
    &lt;method&gt;
        &lt;ejb-name&gt;CabinEJB&lt;/ejb-name&gt;
        &lt;method-name&gt;create&lt;/method-name&gt;
    &lt;/method&gt;
&lt;/method-permission&gt;
...
&lt;/assembly-descriptor&gt;</pre>
<p>Esta clase de configuraci&oacute;n es &uacute;til cuando el enterprise bean o los
recursos accedidos en el cuerpo del m&eacute;todo requieren un rol distinto
del que ha sido usado para obtener acceso al m&eacute;todo. Por ejemplo, el
m&eacute;todo <span class="codefrag">create()</span> podr&iacute;a llamar a un m&eacute;todo en el
enterprise bean X que requiera la identidad de seguridad de
<span class="codefrag">Administrador</span>.</p>
<p>Podemos entender la secuencia de cambio de identidades de la
siguiente forma:</p>
<ol>

<li>El cliente invoca un m&eacute;todo del bean con una identidad 
<span class="codefrag">Id1</span>. </li>

<li>El bean comprueba si la identidad <span class="codefrag">Id1</span> tiene permiso
para ejecutar el m&eacute;todo. La tiene.</li>

<li>El bean consulta el elemento 
<span class="codefrag">security-identity</span> y cambia la identidad a la
que indica ese elemento. Supongamos que es la identidad 
<span class="codefrag">Id2</span>.</li>

<li>El bean realiza las llamadas dentro del m&eacute;todo con la identidad 
<span class="codefrag">Id2</span>.</li>

</ol>
<p>Es obligado resaltar que hay que usar con precauci&oacute;n esta funcionalidad, ya que con ella podemos atribuir cualquier rol a cualquier usuario.</p>
<p>Una limitaci&oacute;n de la funcionalidad es que es obligado definir un &uacute;nico rol para todos los m&eacute;todos.</p>
</div>


<a name="N1014A"></a><a name="Gesti%C3%B3n+de+seguridad+programativa+en+el+EJB"></a>
<h2 class="underlined_10">Gesti&oacute;n de seguridad programativa en el EJB</h2>
<div class="section">
<p>En el c&oacute;digo del EJB es posible comprobar qu&eacute; usuario o grupo ha realizado la llamada al EJB y si tiene un determinado rol asociado. Para ello se usan los siguientes m&eacute;todos del <span class="codefrag">SessionContext</span>:</p>
<ul>

<li>
<span class="codefrag">Principal getCallerPrincipal()</span>: devuelve el objeto <span class="codefrag">Principal</span> asociado al usuario o grupo que ha llamado al m&eacute;todo.</li>

<li>
<span class="codefrag">Boolean isCallerInRole(String rol)</span>: devuelve <span class="codefrag">true</span> o <span class="codefrag">false</span> dependiendo de si el usuario o grupo que ha llamado al m&eacute;todo pertenece al rol que se le pasa como par&aacute;metro.</li>

</ul>
<p>El objeto <span class="codefrag">SessionContext</span> se obtiene declarando el m&eacute;todo <span class="codefrag">setSessionContext(SessionContext ctx)</span> del ciclo de vida del EJB y guardando el contexto en una variable de instancia del EJB. El contenedor EJB llamar&aacute; a este m&eacute;todo en el momento de creaci&oacute;n del enterprise bean.</p>
<p>Un ejemplo de c&oacute;digo en el que se utilizan estos m&eacute;todos:</p>
<pre class="code">public class MiBean implements SessionBean {
<strong>   SessionContext ctx = null;

   public void setSessionContext(SessionContext ctx) {
      this.ctx = ctx;
   }</strong>

   ...

   public void miMetodo() {
      System.out.println(<strong>ctx.getCallerPrincipal().getName()</strong>);
      if (<strong>ctx.isCallerInRole("administrador")</strong>) {
         //c&oacute;digo ejecutado por administradores
         System.out.println("Me llama un administrador");
      }
      if (<strong>ctx.isCallerInRole("bibliotecario")</strong>){
         //c&oacute;digo ejecutado por bibliotecarios
         System.out.println("Me llama un bibliotecario");
      }
   }
   ...</pre>
</div>


<a name="N10189"></a><a name="Anotaciones+EJBGen+Weblogic+para+seguridad"></a>
<h2 class="underlined_10">Anotaciones EJBGen Weblogic para seguridad</h2>
<div class="section">
<a name="N1018F"></a><a name="Definici%C3%B3n+de+roles-N1018F"></a>
<h3 class="underlined_5">Definici&oacute;n de roles</h3>
<p>El atributo <span class="codefrag">roles</span> de las anotaciones <span class="codefrag">@LocalMethod()</span> y <span class="codefrag">@RemoteMethod</span> permite definir una lista de roles separados por comas que est&aacute;n autorizados a invocar el m&eacute;todo.</p>
<p>Por ejemplo, el siguiente m&eacute;todo s&oacute;lo est&aacute; autorizado para los roles "admin" y "bibliotecario":</p>
<pre class="code">   @RemoteMethod(
      roles = "admin, bibliotecario")
   public void addUsuario(String login) {
      // c&oacute;digo
  }</pre>
<a name="N101A9"></a><a name="Asignaci%C3%B3n+de+usuarios+a+roles-N101A9"></a>
<h3 class="underlined_5">Asignaci&oacute;n de usuarios a roles</h3>
<p>Para definir los usuarios o grupos asociados a los roles hay que utilizar la anotaci&oacute;n <span class="codefrag">@RoleMappings</span> en la clase del bean que define un array de elementos <span class="codefrag">@RoleMapping</span>. Cada <span class="codefrag">@RoleMapping</span> define una lista de usuarios o grupos y un nombre de rol. A continuaci&oacute;n vemos el mismo ejemplo que comentamos previamente, utilizando anotaciones:</p>
<pre class="code">@RoleMappings(
      {@RoleMapping(principals = "weblogic, admin", roleName = "administrador"),
       @RoleMapping(principals = "dgl, admin, Bibliotecario", roleName = "bibliotecario")})
public class UsuarioBean extends GenericSessionBean implements SessionBean {
   ...
</pre>
</div>


<p class="pageBreakAfter"></p>


</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
