<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><html><head>  <title>Introducci&oacute;n a CVS</title>  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">  <meta name="Author" content="Miguel">  <link rel="stylesheet" href="apuntes.css" type="text/css"></head><body><h1>Gu&iacute;a de laboratorio</h1><p>Presentamos en este documento informaci&oacute;n &uacute;til para poder seguir   correctamente las pr&aacute;cticas del curso.</p><h2>1. Acceso a los ordenadores del laboratorio </h2><p>Para acceder a los ordenadores del laboratorio se debe introducir como usuario   y contrase&ntilde;a tu NIF. En el caso de que este acceso no funcionara es posible   usar temporalmente el usuario <code>alu</code> y con la contrase&ntilde;a <code>alu</code>.</p><p>El directorio home del usuario se borra cuando cierras la sesi&oacute;n, por   lo que debes tener cuidado de copiar tus ficheros en el disco USB o en el repositorio   CVS del curso J2EE.</p><p></p><h2>2. CD-ROMs y discos USB en Linux</h2><p>Para poder leer un CD-ROM o poder leer/grabar en el l&aacute;piz USB, es necesario   montar el dispositivo en Linux. <br></p><ul>  <li>Para montar un CD, lo introducimos en el lector y tecleamos:<br>    <br>    <code>mount /mnt/cdrom</code><br>    <br>    Con eso, yendo al directorio <code>/mnt/cdrom</code> accederemos al directorio     ra&iacute;z del CD. Una vez hayamos terminado es necesario desmontarlo antes     de extraerlo, para lo cual teclearemos:<br>    <br>    <code>umount /mnt/cdrom<br>    </code> </li>  <li>Para usar el l&aacute;piz USB, tambi&eacute;n hay que montarlo en Linux.     Teclearemos:<br>    <br>    <code>mount /mnt/usb<br>    </code><br>    Y de forma similar al CD-ROM, para desmontarlo y extraerlo despu&eacute;s,     tecleamos:<br>    <br>    <code>umount /mnt/usb</code></li></ul><h2>3. Directorio de trabajo de Eclipse</h2><p>Eclipse es el entorno de programaci&oacute;n que se va a usar en todas las   asignaturas del curso. Eclipse guarda todos los proyectos en un directorio de   trabajo <em></em> que es posible seleccionar. Recomendamos que uses como directorio   de trabajo un directorio del disco USB. Puedes llamarlo eclipse. Primero debes   crearlo en el disco USB:</p><pre>mount /mnt/usb<br>cd /mnt/usb<br>mkdir eclipse</pre><p>Y despu&eacute;s debes seleccionarlo al arrancar Eclipse, como muestra la siguiente   figura:</p><p align="center"><img src="images/workspace.png" width="527" height="245" border="1"></p><p>De esta forma podr&aacute;s usar el mismo directorio de trabajo y trabajar   con los mismos proyectos en cualquier ordenador.</p><h2>4. Uso del repositorio CVS del curso J2EE</h2><p>Se ha insalado en el servidor del curso de especialista un repositorio CVS   para guardar los ejercicios y trabajos que se van a desarrollar a lo largo del   curso. Cada alumno es propietario de un conjunto de m&oacute;dulos (directorios)   del repositorio y all&iacute; se deber&aacute;n guardar los ejercicios para   que sean corregidos por los profesores del curso.</p><h3>Identificador de usuario</h3><p>Cada alumno tiene un identificador de usuario y una contrase&ntilde;a &uacute;nica   en el repositorio CVS. De esta forma s&oacute;lo t&uacute; (y el profesor, para   poder corregir los ejercicios) tienes acceso a tus m&oacute;dulos CVS.</p><p>Para cambiar tu contrase&ntilde;a debes conectarte con ssh al servidor <code>www.j2ee.ua.es</code>   y ejecutar el comando <code>passwd</code>. Supongamos que tu usuario es <code>asimov</code>:</p><pre>localhost$ ssh asimov@www.j2ee.ua.es<br>asimov@www.j2ee.ua.es's password: <em><u>&lt;contrase&ntilde;a antigua&gt;</u></em><br>www.j2ee.ua.es$ passwd <br>Changing password for user asimov.<br>Changing password for asimov<br>(current) UNIX password: <em><u>&lt;contrase&ntilde;a antigua&gt;</u></em><br>New password: <em><u>&lt;nueva contrase&ntilde;a&gt;</u></em><br>Retype new password: <em><u>&lt;nueva contrase&ntilde;a&gt;</u></em><br>passwd: all authentication tokens updated successfully.</pre><p>La nueva contrase&ntilde;a debe ser una buena contrase&ntilde;a UNIX: ser suficientemente   larga y contener caracteres y n&uacute;meros. Si olvidaras la contrase&ntilde;a   puedes enviar un correo al administrador del repositorio (<a href="mailto:malozano@dccia.ua.es">malozano@dccia.ua.es)</a>.</p><h3>Repositorio CVS</h3><p>El repositorio CVS del curso es accesible desde cualquier ordenador conectado   a Internet. Cada alumno tiene disponible un conjunto de m&oacute;dulos (directorios)   en los que puede mantener de forma remota los proyectos en los que est&aacute;   trabajando. En concreto, est&aacute;n disponibles 15 m&oacute;dulos (uno por   cada asignatura del curso) m&aacute;s un m&oacute;dulo miscel&aacute;nea a tu   disposici&oacute;n.</p><p>La tecnolog&iacute;a CVS permite realizar un control de versiones, de forma   que cada vez que se sube un proyecto al repositorio s&oacute;lo se guardan los   cambios realizados con respecto a la versi&oacute;n ya existente. Es posible   recuperar versiones anteriores del proyecto o incluso mantener varias ramas   con versiones paralelas de un mismo proyecto. Si est&aacute;s interesado en   conocer m&aacute;s caracter&iacute;sticas de CVS puedes consultar los siguientes   recursos:</p><p>Los datos del repositorio CVS son los siguientes:</p><pre>Direcci&oacute;n: www.j2ee.ua.es<br>Camino del repositorio: /usr/local/cvs<br>Modo de acceso: extssh</pre><p>Existen m&uacute;ltiples clientes para operar con CVS. Uno de los m&aacute;s   interesantes est&aacute; integrado en Eclipse. A continuaci&oacute;n vamos a   ver de forma detallada c&oacute;mo operar con &eacute;l.</p><h3>C&oacute;mo subir por primera vez un proyecto a un repositorio</h3><p>Cada alumno tiene disponible los siguientes m&oacute;dulos (donde <code>&lt;alu&gt;</code>   es el identificador del usuario del alumno).</p><pre>&lt;alu&gt;/ejb<br>&lt;alu&gt;/integr<br>&lt;alu&gt;/java-hd<br>&lt;alu&gt;/jdbc<br>&lt;alu&gt;/jsp<br>&lt;alu&gt;/mensajes<br>&lt;alu&gt;/misc<br>&lt;alu&gt;/patrones<br>&lt;alu&gt;/proyecto-1<br>&lt;alu&gt;/proyecto-2<br>&lt;alu&gt;/rmi<br>&lt;alu&gt;/seguridad<br>&lt;alu&gt;/serv-aplic<br>&lt;alu&gt;/servlets<br>&lt;alu&gt;/serv-web<br>&lt;alu&gt;/xml</pre><p>Supongamos que queremos subir un proyecto (<em>sesion01</em>) al m&oacute;dulo   <code>java-hd</code> del alumno <code>asimov</code>. En Eclipse los proyectos   se corresponden con directorios. En la vista <em>Navigator</em> tenemos la lista   con todos los proyectos del espacio de trabajo. Supongamos que el proyecto <em>sesion01</em>   contiene los ficheros <code>.project</code> (fichero que est&aacute; en todos   los proyectos Eclipse y que contiene informaci&oacute;n sobre el proyecto) y   <code>prueba.txt</code>:</p><p align="center"><img src="images/persp-resource.png" width="400" height="343" border="1"></p><p>Pinchamos sobre el proyecto <em>sesion01</em> y pulsamos el bot&oacute;n derecho.   Escogemos la opci&oacute;n <em>Team &gt; Share Project...</em></p><p align="center"><img src="images/intro-cvs01.png" width="300" height="330" border="1"></p><p>Aparecer&aacute; una ventana en la que debemos seleccionar <samp>CVS</samp>   como tipo de repositorio:</p><p align="center"><img src="images/intro-cvs02.png" width="300" height="219" border="1"></p><p>Luego hay que proporcionar los datos del repositorio CVS. Estos datos se grabar&aacute;n   en el directorio de trabajo de Eclipse y no tendr&aacute;s que introducirlos   de nuevo. Es recomendable no grabar tu contrase&ntilde;a de usuario si est&aacute;s   en un ordenador p&uacute;blico.</p><p align="center"><img src="images/datos-cvs.png" width="400" height="556" border="1"></p><p>Despu&eacute;s debemos indicar el m&oacute;dulo (directorio) en el que queremos   guardar el proyecto. Ser&aacute; un nuevo m&oacute;dulo dentro del ya existente   <code>asimov/java-hd </code>y lo llamaremos con el mismo nombre del proyecto:   <code>asimov/java-hd/sesion01</code>. Lo hacemos as&iacute; por conveniencia,   ya que podr&iacute;amos darle al m&oacute;dulo CVS un nombre distinto al del   proyecto. Eclipse sube al nuevo directorio CVS el <em>contenido</em> del proyecto   actual (sus ficheros) y no el propio directorio.</p><p align="center"><img src="images/nuevo-modulo.png" width="400" height="555"></p><p>Pulsando el bot&oacute;n <em>Next&gt;</em> aparecer&aacute; la siguiente pantalla   en la que podr&aacute;s revisar qu&eacute; ficheros se van a guardar en el m&oacute;dulo   reci&eacute;n creado. Aparecen con un signo + los ficheros que se van a a&ntilde;adir   al m&oacute;dulo. Pulsando en el icono de <em>commit</em> (marcado en rojo)   se actualizan los ficheros en el repositorio. El comando <em>commit</em> es   un comando CVS con el que se guardan los cambios en el repositorio.</p><p align="center"><img src="images/review-cvs.png" width="400" height="300" border="1"></p><p>Una vez guardados los ficheros en el repositorio, el proyecto quedar&aacute;   enlazado al repositorio CVS. En la vista <em>Navigator</em> aparece el servidor   CVS asociado al proyecto:</p><p align="center"><img src="images/guardado-cvs.png" width="300" height="375" border="1"></p><p>Por &uacute;ltimo podemos explorar el repositorio CVS para comprobar que est&aacute;n   guardados nuestros ficheros. Lo hacemos seleccionando la opci&oacute;n del men&uacute;:   <em>Window &gt; Open Perspective &gt; CVS Repository Exploring</em>. Aparecer&aacute;   una nueva perspectiva (conjunto de vistas) de Eclipse en la que podemos explorar   el repositorio CVS que acabamos de actualizar:</p><p align="center"><img src="images/persp-exploring-CVS.png" width="400" height="343"></p><p>Para cambiar de nuevo a la perspectiva anterior (llamada <em>Resource</em>)   pinchamos el icono marcado en rojo o seleccionamos la opci&oacute;n de men&uacute;:   <em>Window &gt; Open Perspective &gt; Resource</em>.</p><h3>Ciclo de trabajo</h3><p>Cuando estamos trabajando con un proyecto que reside en un repositorio CVS   debemos ser cuidadosos en seguir siempre el mismo ciclo de trabajo, sobre todo   si el repositorio est&aacute; compartido entre varios usuarios o si accedemos   a &eacute;l desde distintos ordenadores.</p><p>Una vez subido por primera vez un proyecto a un repositorio, el ciclo de trabajo   con el proyecto siempre ser&aacute; el mismo:</p><ol>  <li> Actualizar el proyecto local con los cambios del repositorio (update)</li>  <li>Trabajar en el proyecto local</li>  <li>Subir los cambios al repositorio (commit)</li></ol><p>Otra operaci&oacute;n que puede ser necesaria en alg&uacute;n momento es obtener   un proyecto completo de un repositorio.</p><p>Vamos a detallar cada una de estas operaciones, empezando por esta &uacute;ltima.</p><h3>C&oacute;mo obtener un proyecto del repositorio</h3><p>Vamos a obtener el mismo proyecto que acabamos de subir y guardarlo en otro   proyecto de Eclipse. Esto nos va a servir para simular que se est&aacute; accediendo   a un mismo repositorio desde distintos clientes.</p><p>Primero se debe escoger la opci&oacute;n de men&uacute; <em>File &gt; New &gt;   Project...</em> y seleccionamos como wizard <em>Checkout Projects from CVS</em>. </p><p align="center"><img src="images/proyecto-nuevo.png" width="300" height="285" border="1"></p><p>Despu&eacute;s seleccionamos el repostorio y el m&oacute;dulo que queremos   obtener. En nuestro caso, es el m&oacute;dulo <code>asimov/java-hd/sesion01:</code></p><p align="center"><img src="images/obtener-modulo.png" width="300" height="301" border="1"></p><p>Pulsamos <em>Next&gt;</em> y aparece la siguiente ventana en la que podemos   darle nombre al proyecto en el que vamos a descargar el m&oacute;dulo. Lo llamamos   <em>sesion01-bis</em>:</p><p align="center"><img src="images/check-out.png" width="300" height="201" border="1"></p><p>Ahora tendremos dos proyectos conectados al mismo m&oacute;dulo del repositorio.   Recuerda que esta configuraci&oacute;n no es habitual; s&oacute;lo estamos haciendo   una demostraci&oacute;n para comprobar algunas de las caracter&iacute;sticas   de CVS.</p><p align="center"><img src="images/dos-proyectos.png" width="300" height="315" border="1"></p><h3>C&oacute;mo subir al repositorio cambios en el proyecto local</h3><p>Una vez creado o descargado un repositorio en un proyecto haremos modificaciones   en el proyecto local: modificaremos el contenido de alg&uacute;n fichero, crearemos   nuevos ficheros y directorios o borraremos ficheros existentes. Eclipse marca   todos aquellos recursos que se han modificado con un s&iacute;mbolo especial   (&quot;&gt;&quot;). </p><p>Por ejemplo, selecciona el fichero <code>prueba.txt</code> del proyecto <em>sesion01-bis</em>,   modifica su texto y s&aacute;lvalo. A&ntilde;ade tambi&eacute;n un directorio   nuevo con un fichero llamado <code>prueba2.txt</code>. La vista <em>Navigator</em>   de Eclipse debe mostrar lo siguiente:</p><p><img src="images/modificacion-local.png" width="400" height="325" border="1"></p><p>Nota que se han marcado los ficheros que se van a modificar en el repositorio.   Para grabar (<em>commit</em>) los cambios en el repositorio, pincha el proyecto   <em>sesion01-bis</em> y selecciona con el bot&oacute;n derecho del rat&oacute;n   la opci&oacute;n <em>Team &gt; Commit...</em>. Aparecer&aacute; una ventana   preguntando si quieres a&ntilde;adir el nuevo recurso (<code>notas/prueba2.txt</code>).   Debes decir que s&iacute;. Aparecer&aacute; la ventana di&aacute;logo <em>Commit</em>   en la que podr&aacute;s escribir un comentario sobre los cambios que has realizado:</p><p><img src="images/commit.png" width="300" height="183" border="1"></p><p>Una vez que aceptas el <em>commit</em> Eclipse se conecta con el repositorio   y actualiza los cambios. Ver&aacute;s que desaparece el signo &quot;&gt;&quot;   que marcaba las diferencias con el repositorio.</p><p>Puedes comprobar en la perspectiva<em> CVS Repository Exploring</em> que ya   se encuentran los nuevos ficheros en el repositorio. Pinchando en cualquiera   de los ficheros y pulsando el bot&oacute;n derecho podr&aacute;s ver los comandos   que puedes usar sobre un recurso del repositorio. El m&aacute;s com&uacute;n   es <em>Show in Resource History</em>, que muestra las anotaciones de los sucesivos   cambios que has ido guardando:</p><p><img src="images/historia.png" width="400" height="138" border="1"></p><p>Puedes comprobar tambi&eacute;n en la vista <em>CVS Repositories q</em>ue el   directorio notas no lleva una etiqueta con su n&uacute;mero de versi&oacute;n.   Esto se debe a que CVS no trata los directorios como recursos.</p><h2>C&oacute;mo actualizar el proyecto local con cambios del repositorio</h2><p>Por &uacute;ltimo, si se ha modificado el repositorio y queremos actualizar   el proyecto local debemos hacer lo siguiente. Seleccionamos el proyecto local   (en este caso, sesion-01) y pulsando el bot&oacute;n derecho escogemos la opci&oacute;n   Team &gt; Update.... </p><p align="center"><img src="images/update-project.png" width="400" height="400" border="1"> </p><p>En la perspectiva de Team Synchronizing podemos comprobar qu&eacute; ficheros   se van a actualizar:</p><p align="center"><img src="images/update.png" width="400" height="270" border="1"></p><p>Pulsamos en el icono de aceptar los cambios y el proyecto quedar&aacute;   actualizado.</p><p>Por &uacute;ltimo, para dejar el m&oacute;dulo limpio y poder usarlo de nuevo   en la asignatura Java y Herramientas de Desarrollo, borramos todos los ficheros   y directorios del proyecto <em>sesion01</em> y hacemos <em>commit</em>. Con   eso se borrar&aacute;n todos los ficheros del m&oacute;dulo <code>asimov/java-hd/sesion01</code>.   Sin embargo, no se borrar&aacute; el m&oacute;dulo; en CVS no se pueden eliminar   modulos (directorios) de forma remota. Se podr&iacute;a hacer &#8220;manualmente&#8221;   entrando con <em>ssh</em> en el servidor y borrando el directorio:</p><pre>localhost$ ssh asimov@www.j2ee.ua.es<br>www.j2ee.ua.es$ rmdir &#8211;rf /usr/local/cvs/asimov/java-hd/sesion01</pre>
<p><strong>NOTA:</strong> CVS no funciona correctamente en sistemas de ficheros 
  FAT. Para poder crear proyectos en el disco USB tendremos que formatearlo con 
  un sistema de ficheros NTFS o EXT2/3. Para crear un sistema de ficheros EXT2 
  de Linux en el disco USB haremos lo siguiente:</p>
<pre>mkfs.ext2 -b 4096 /dev/sda1</pre>
<p>Para hacer esto necesitaremos tener permisos de root. Podremos acceder al contenido 
  del disco desde Windows utilizando el driver <em>ext2fsd</em> o la aplicaci&oacute;n 
  <em>explore2fs</em>.</p>
<p>Si no deseamos formatear el disco USB, una segunda opci&oacute;n es trabajar 
  con los proyectos en el disco duro. Una vez hayamos finalizado, empaquetaremos 
  los proyectos en un fichero TAR y copiaremos este fichero a nuestro disco USB.</p>
</body></html>