<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Spring</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario en Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Proyecto de Integracion" src="images/baner_j2ee_der.gif" title="Proyecto de Integracion"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Proyecto de Integraci&oacute;n</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Proyecto de Integraci&oacute;n</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Proyecto de Integraci&oacute;n">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html" title="Sesi&oacute;n 1: Caso de estudio">Sesi&oacute;n 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html" title="Sesi&oacute;n 2: DAO con JDBC">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html" title="Sesi&oacute;n 3: Aplicaci&oacute;n web con servlets">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html" title="Sesi&oacute;n 4: Aplicaci&oacute;n web con servlets y JSPs">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion0506-apuntes.html" title="Sesiones 5 y 6: Aplicaci&oacute;n web con Struts">Sesi&oacute;n 5-6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html" title="Sesi&oacute;n 7: Aplicaci&oacute;n web con Hibernate">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html" title="Sesi&oacute;n 8: Proyecto web">Sesi&oacute;n 8</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesi&oacute;n 9</div>
</div>
<div class="menuitem">
<a href="sesion10-apuntes.html" title="Sesi&oacute;n 10: Servidores de aplicaciones">Sesi&oacute;n 10</a>
</div>
<div class="menuitem">
<a href="sesion11-apuntes.html" title="Sesi&oacute;n 11: Componentes EJB">Sesi&oacute;n 11</a>
</div>
<div class="menuitem">
<a href="sesion12-apuntes.html" title="Sesi&oacute;n 12: Mensajes: JMS">Sesi&oacute;n 12</a>
</div>
<div class="menuitem">
<a href="sesion13-apuntes.html" title="Sesi&oacute;n 13: Servicios Web">Sesi&oacute;n 13</a>
</div>
<div class="menuitem">
<a href="sesion14-apuntes.html" title="Sesi&oacute;n 14: Proyecto Enterprise">Sesi&oacute;n 14</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion09-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Spring</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n">Introducci&oacute;n</a>
</li>
<li>
<a href="#Configuraci%C3%B3n+y+preparaci%C3%B3n+del+proyecto">Configuraci&oacute;n y preparaci&oacute;n del proyecto</a>
</li>
<li>
<a href="#Conversi%C3%B3n+de+las+capas+de+negocio+y+acceso+a+datos+a+Spring">Conversi&oacute;n de las capas de negocio y acceso a datos a Spring</a>
</li>
<li>
<a href="#Combinaci%C3%B3n+de+Struts+con+Spring">Combinaci&oacute;n de Struts con Spring</a>
</li>
<li>
<a href="#Transaccionalidad+declarativa">Transaccionalidad declarativa</a>
</li>
<li>
<a href="#Acceso+remoto+%28OPCIONAL%29">Acceso remoto (OPCIONAL)</a>
</li>
<li>
<a href="#Entrega">Entrega</a>
</li>
</ul>
</div>


<a name="N1000C"></a><a name="Introducci%C3%B3n"></a>
<h2 class="underlined_10">Introducci&oacute;n</h2>
<div class="section">
<p>El objetivo de esta sesi&oacute;n de integraci&oacute;n es introducir Spring en nuestro proyecto. Para poder
aprovecharnos de las ventajas que nos da el <em>framework</em>, tendremos que refactorizar una
peque&ntilde;a parte del c&oacute;digo.</p>
<p>Como el proyecto de integraci&oacute;n en el futuro usar&aacute; EJBs y otras tecnolog&iacute;as 
alternativas a Spring, <strong>crearemos una rama</strong> del mismo. Lo mejor es crear esta rama a partir del proyecto web tal y como lo teng&aacute;is ahora,
si es que est&aacute; en un estado consistente o bien que tom&eacute;is la plantilla que se os dej&oacute; en el proyecto web
(con una implementaci&oacute;n parcial).Necesitar&eacute;is las clases de la capa de negocio.</p>
<div class="frame warning">
<div class="label">Aviso</div>
<div class="content"> Si no os ha dado tiempo
a implementar la capa de negocio, bastar&aacute; por el momento con que simplemente "hagan de puente"
con los DAO: es decir, una llamada a un m&eacute;todo de la capa de negocio llama
directamente al DAO sin chequear nada ni nada de l&oacute;gica de negocio.</div>
</div>
<p>Modificaremos los dos proyectos, por lo que habr&aacute; que hacer una rama
para cada uno. Recordad que, para crear la nueva rama:</p>
<ul>
  
<li>Desde el men&uacute; de contexto de los proyectos, seleccionamos <strong>Team &gt; Branch</strong>.</li>
  
<li>El nombre de la nueva rama ser&aacute;: "b09-integracion-Spring".</li>
  
<li>Introducir el nombre de la versi&oacute;n del proyecto: "v08-integracion-web</li>
  
<li>Marcar la casilla <em>Start working in the branch immediately</em>.</li>
  
<li>Pulsar <strong>OK</strong>.</li>

</ul>
<p>Nuestros objetivos al introducir Spring van a ser los siguientes:</p>
<ul>

<li>Hacer uso del contenedor de beans para instanciar los objetos de la aplicaci&oacute;n, en lugar de usar las
factor&iacute;as de objetos codificadas en Java que us&aacute;bamos hasta el momento.</li>

<li>Hacer accesibles los beans gestionados por Spring a las acciones de Struts</li>

<li>A&ntilde;adir transaccionalidad declarativa a las operaciones que as&iacute; lo requieran, eliminando la necesidad
de controlar las transacciones en el c&oacute;digo Java.</li>

<li>
<strong>De manera opcional</strong>, hacer accesible alg&uacute;n m&eacute;todo de negocio de la aplicaci&oacute;n a clientes 
remotos.</li>

</ul>
</div>

<a name="N10054"></a><a name="Configuraci%C3%B3n+y+preparaci%C3%B3n+del+proyecto"></a>
<h2 class="underlined_10">Configuraci&oacute;n y preparaci&oacute;n del proyecto</h2>
<div class="section">
<p>B&aacute;sicamente, necesitamos instalar las librer&iacute;as de spring (contenidas en <span class="codefrag">spring.jar</span>) y configurar
y arrancar el contenedor de beans. Hay que tener en cuenta que las capas gestionadas por Spring (negocio y datos, ya que
la vista est&aacute; gestionada por Struts) est&aacute;n en el proyecto com&uacute;n. Por tanto, tanto el propio Spring como la 
configuraci&oacute;n de los beans deber&iacute;an residir en el com&uacute;n. Sin embargo, el uso del contenedor de beans se har&aacute; en el 
proyecto web, por lo que el c&oacute;digo que cree y acceda al contenedor debe residir en el web.</p>
<p>Por tanto debemos seguir estos pasos:</p>
<ol>

<li>Copiar el archivo <span class="codefrag">spring.jar</span> a la carpeta <span class="codefrag">/lib</span> del proyecto com&uacute;n</li>

<li>Como el API de Spring tambi&eacute;n es necesario en el proyecto web, en las propiedades de &eacute;ste, bajo la opci&oacute;n
<span class="codefrag">J2EE dependencies</span>, a&ntilde;adir el <span class="codefrag">spring.jar</span> contenido en el proyecto com&uacute;n. As&iacute; nos aseguramos de
que tanto se referencie al compilar el web como se copie en el <span class="codefrag">/WEB-INF/lib</span> durante el despliegue.</li>

<li>El XML con la configuraci&oacute;n de los beans (archivo <span class="codefrag">beans.xml</span>) deber&iacute;a ir en el <span class="codefrag">resources</span> del proyecto com&uacute;n, pero
tambi&eacute;n es necesario tenerlo en el proyecto web ya que all&iacute; es donde se va a instanciar el contenedor. Desgraciadamente, 
al referenciar un proyecto desde otro en Eclipse no copia los archivos individuales, sino que los mete en un .JAR,
donde Spring no podr&aacute; encontrar el XML con la configuraci&oacute;n de los beans. Lo m&aacute;s sencillo si no se usa Ant (aunque no lo mejor
desde el punto de vista de la automatizaci&oacute;n) es copiar el mismo archivo en el <span class="codefrag">resources</span> tanto
del proyecto com&uacute;n como del web.</li>

<li>Para poder editar de manera m&aacute;s c&oacute;moda los archivos de configuraci&oacute;n de beans, es recomendable
activar el plugin de Spring para eclipse en los proyectos. Para ello, recordad que:
<ul>

<li>Pulsando sobre la carpeta del proyecto con el bot&oacute;n derecho, hay que elegir
la opci&oacute;n <span class="codefrag">Add spring project nature</span>
</li>

<li>En las propiedades del proyecto, en el apartado <span class="codefrag">Spring</span>, a&ntilde;adir
como nuevo <span class="codefrag">config file</span> el XML creado. As&iacute; se activar&aacute; el chequeo de sintaxis
y el autocompletado.</li>

</ul>


</li>

<li>En el <span class="codefrag">web.xml</span> del proyecto web, a&ntilde;adimos el <em>listener</em> que cargar&aacute; el contenedor de beans
y lo har&aacute; accesible a las acciones de Struts. Justo detr&aacute;s de la etiqueta <span class="codefrag">display-name</span>, y antes
de los <span class="codefrag">servlet</span>, pondremos:
<pre class="code">

&lt;!-- arranque del contenedor de Spring --&gt;
&lt;context-param&gt;
  &lt;param-name&gt;contextConfigLocation&lt;/param-name&gt;
  &lt;param-value&gt;/WEB-INF/classes/beans.xml&lt;/param-value&gt;
&lt;/context-param&gt;

&lt;listener&gt;
  &lt;listener-class&gt;
    	org.springframework.web.context.ContextLoaderListener
  &lt;/listener-class&gt;
&lt;/listener&gt;

</pre>

</li>

</ol>
</div>


<a name="N100AF"></a><a name="Conversi%C3%B3n+de+las+capas+de+negocio+y+acceso+a+datos+a+Spring"></a>
<h2 class="underlined_10">Conversi&oacute;n de las capas de negocio y acceso a datos a Spring</h2>
<div class="section">
<p>En el c&oacute;digo actual, cada clase es responsable de instanciar los otros objetos de la aplicaci&oacute;n que necesita para
trabajar. Vamos a liberar a las clases de sus responsabilidades pas&aacute;ndoselas al contenedor de Spring. De este modo,
nos evitamos tener que codificar las factor&iacute;as de objetos. Si queremos cambiar una implementaci&oacute;n concreta de una interfaz por
otra, lo haremos en el XML de configuraci&oacute;n de Spring sin necesidad de recompilar una sola l&iacute;nea de c&oacute;digo.</p>
<p>Pasos a seguir:</p>
<ol>

<li>En el c&oacute;digo Java de las clases, cuando se necesite una referencia a otro objeto de negocio o datos, suponer
que va a ser gestionada por Spring. En nuestro caso, esto nos lleva a sustituir por ejemplo
en <span class="codefrag">UsuarioBO</span> el c&oacute;digo del estilo:
<pre class="code">
FactoriaDAOs fd = FactoriaDAOs.getInstance();
IUsuarioDAO iu = fd.getUsuarioDAO();
</pre>

<p>por algo como:</p>

<pre class="code">
private IUsuarioDAO iu;

public void setIu(UsuarioDAO iu) {
	this.iu = iu;
}
</pre>

</li>

<li>En el fichero de configuraci&oacute;n de beans (archivo <span class="codefrag">beans.xml</span>
de la carpeta <span class="codefrag">resources</span> en ambos proyectos), por cada objeto de negocio
o acceso a datos, tendremos que definir un bean. Cuando un objeto dependa de otros
tendremos que poner estas dependencias como propiedades del bean si queremos
que Spring las gestione. Siguiendo con el ejemplo anterior, la configuraci&oacute;n
tendr&iacute;a algo como:
<pre class="code">

&lt;bean id="usuarioBO" class="es.ua.jtech.proyint.bo.usuario.UsuarioBO"&gt;
	&lt;property name="iu"&gt;
		&lt;ref bean="usuarioDAO"/&gt;	
	&lt;/property&gt;
&lt;/bean&gt;

&lt;!-- &iexcl;&iexcl;faltar&iacute;a la configuraci&oacute;n de UsuarioDAO!! --&gt;

</pre>

</li>

<li>A partir de este momento, las clases <span class="codefrag">FactoriaXXX</span> ya no son
necesarias y podemos eliminarlas de nuestra aplicaci&oacute;n.</li>

</ol>
<p>
Podr&iacute;amos aprovechar las factor&iacute;as de objetos que ya tenemos codificadas en Java
si por las razones que fueran prefiri&eacute;ramos usarlas en lugar de poner la clase
concreta en el fichero de configuraci&oacute;n. En lugar de poner el atributo <span class="codefrag">class</span>
con la clase concreta del bean bastar&aacute; decirle a Spring que hay que obtenerlo
de una factor&iacute;a (atributo <span class="codefrag">factory-bean</span>) llamando a un cierto
m&eacute;todo (atributo <span class="codefrag">factory-method</span>). En nuestro ejemplo:</p>
<pre class="code">

&lt;bean id="usuarioBO" factory-bean="factoriaBOs" factory-method="getUsuarioBO"&gt;
	&lt;property name="iu"&gt;
		&lt;ref bean="usuarioDAO"/&gt;	
	&lt;/property&gt;
&lt;/bean&gt;

&lt;!-- &iexcl;&iexcl;faltar&iacute;a la configuraci&oacute;n de UsuarioDAO!! --&gt;

</pre>
<p>Pod&eacute;is obtener un gr&aacute;fico con los beans creados y sus dependencias
 con el plugin de Spring para eclipse si abr&iacute;s la
vista llamada <span class="codefrag">"Spring beans"</span> y puls&aacute;is con el bot&oacute;n derecho sobre
el fichero de configuraci&oacute;n, eligiendo la opci&oacute;n <span class="codefrag">"Show graph"</span> en el
men&uacute; contextual.</p>
<p>Es fundamental comprobar que todo funciona correctamente. Aunque para ello habr&iacute;a que cambiar
todos los test de cactus para que ahora accedan a los objetos de negocio y datos llamando al contenedor
de beans no ser&iacute;a realista intentar hacer esto en la sesi&oacute;n por cuestiones de tiempo. Por ello, bastar&aacute;
con hacer al menos un test que obtenga el bean <span class="codefrag">usuarioBO</span> y llame a alg&uacute;n m&eacute;todo de negocio (con
esto indirectamente comprobamos la capa de acceso a datos).</p>
</div>

<p class="pageBreakAfter"></p>

<a name="N10107"></a><a name="Combinaci%C3%B3n+de+Struts+con+Spring"></a>
<h2 class="underlined_10">Combinaci&oacute;n de Struts con Spring</h2>
<div class="section">
<p>Ser&iacute;a demasiado laborioso refactorizar la capa de presentaci&oacute;n entera para usar Spring MVC, y probablemente
no estar&iacute;a justificado, ya que con Struts se han resuelto razonablemente bien
todos los requerimientos de la aplicaci&oacute;n a este nivel.	Por tanto, optamos por
combinar la capa de presentaci&oacute;n en Struts con el resto de capas en Spring.</p>
<p>Las acciones de Struts necesitan acceder a los beans de Spring a trav&eacute;s del contenedor. Una primera
posibilidad es usar c&oacute;digo como el que sigue para instanciar los beans. Por ejemplo, en la acci&oacute;n de login
podr&iacute;amos hacer:</p>
<pre class="code">
public class AccionLogin extends Action {

	private static Log logger = LogFactory.getLog(AccionLogin.class.getName());

	@Override
	public ActionForward execute(ActionMapping mapping, ActionForm form,
			HttpServletRequest request, HttpServletResponse res)
			throws Exception {

		ActionMessages errors = new ActionMessages();
		HttpSession sesion = request.getSession(true);
		String forward = "";

		LoginForm aForm = (LoginForm) form;
		<strong>	
		ServletContext sc = getServlet().getServletContext();
		WebApplicationContext wac = WebApplicationContextUtils.getWebApplicationContext(sc);
		IUsuarioBO iu = (IUsuarioBO) wac.getBean("usuarioBO");
		</strong>
		try {
			UsuarioTO usuario = iu.autenticaUsuario(aForm.getLogin(), aForm.getPassword());
			...
</pre>
<p>Pero el c&oacute;digo anterior, adem&aacute;s de no ser muy elegante, introduce en nuestras acciones de 
Struts una dependencia no deseable del API de Spring. &iquest;Qu&eacute; pasar&iacute;a si quisi&eacute;ramos
cambiar de Spring a otro contenedor que use tambi&eacute;n <em>dependency injection</em> pero no
tenga el mismo API?. Una soluci&oacute;n mejor es usar <em>dependency injection</em> en nuestras acciones
de Struts, para que el c&oacute;digo quede como:</p>
<pre class="code">
public class AccionLogin extends Action {
	private static Log logger = LogFactory.getLog(AccionLogin.class.getName());	
	<strong>
	private IUsuarioBO iu;
		
	public void setIu(IUsuarioBO iu) {
		this.iu = iu;
	}
	</strong>
	@Override
	public ActionForward execute(ActionMapping mapping, ActionForm form,
			HttpServletRequest request, HttpServletResponse res)
			throws Exception {
		ActionMessages errors = new ActionMessages();
		HttpSession sesion = request.getSession(true);
		String forward = "";

		LoginForm aForm = (LoginForm) form;

		try {
			UsuarioTO usuario = iu.autenticaUsuario(aForm.getLogin(), aForm
					.getPassword());
			...
</pre>
<p>Desde luego, hemos tenido que modificar algo el c&oacute;digo con respecto al original, pero
no hay ni rastro del API de Spring. No obstante &iquest;c&oacute;mo es posible que Spring resuelva la
dependencia si esto es una acci&oacute;n de Struts y no un bean de Spring?. La respuesta est&aacute; en que
<strong>necesitamos algo de configuraci&oacute;n adicional para que Spring tome la acci&oacute;n de Struts
como si fuera un bean y le inyecte las dependencias</strong>. Necesitamos:</p>
<ol>

<li>Configurar un plugin de Struts necesario para integrarlo con Spring. Al final de nuestro <span class="codefrag">struts-config.xml</span>, en
la parte donde tenemos colocada ahora la etiqueta <span class="codefrag">plug-in</span> para el <em>validator</em>,
pondremos:
<pre class="code">

&lt;plug-in className="org.springframework.web.struts.ContextLoaderPlugIn"&gt;
	&lt;set-property property="contextConfigLocation" 
				value="/WEB-INF/classes/beans.xml"/&gt;
&lt;/plug-in&gt;

</pre>

<p>Suponiendo que efectivamente nuestro archivo de configuraci&oacute;n de beans se llama <span class="codefrag">beans.xml</span>
y que est&aacute; colocado en <span class="codefrag">resources</span> (es decir, que al compilar, eclipse lo colocar&aacute; en <span class="codefrag">/WEB-INF/classes</span>).</p>

</li>

<li>Sustituir el controlador normal de Struts por otro propio de Spring, que se ocupar&aacute;
de resolver las dependencias pasando al final el control a Struts. En el <span class="codefrag">struts-config.xml</span>,
justo detr&aacute;s de los <span class="codefrag">&lt;action-mappings/&gt;</span>, pondremos:
<pre class="code">
&lt;controller processorClass="org.springframework.web.struts.DelegatingRequestProcessor"/&gt;
</pre>

</li>

<li>Por cada acci&oacute;n de Struts debemos definir un bean de Spring. Esto podr&iacute;amos hacerlo en el mismo
archivo <span class="codefrag">beans.xml</span>, pero desde el punto de vista l&oacute;gico, ya que son beans de la capa
de presentaci&oacute;n, es mejor hacerlo en un XML aparte. Lo haremos en el proyecto web, dentro de la
carpeta <span class="codefrag">resources</span>, en el archivo <span class="codefrag">strutsbeans.xml</span> (por
el momento vac&iacute;o). Para que se carguen
todos los beans cuando se arranque la aplicaci&oacute;n web tendremos que modificar ligeramente el 
<em>listener</em> que pusimos al principio en el <span class="codefrag">web.xml</span>:
<pre class="code">

&lt;!-- arranque del contenedor de Spring --&gt;
&lt;context-param&gt;
  &lt;param-name&gt;contextConfigLocation&lt;/param-name&gt;
  &lt;param-value&gt;/WEB-INF/classes/beans.xml<strong>,/WEB-INF/classes/strutsbeans.xml</strong>&lt;/param-value&gt;
&lt;/context-param&gt;

&lt;listener&gt;
  &lt;listener-class&gt;
    	org.springframework.web.context.ContextLoaderListener
  &lt;/listener-class&gt;
&lt;/listener&gt;

</pre>

<div class="frame note">
<div class="label">Nota</div>
<div class="content">
Antes de ponernos a editar el <span class="codefrag">strutsbeans.xml</span> conviene que le digamos
al plugin Spring de eclipse que tambi&eacute;n es un fichero de configuraci&oacute;n de beans. Para ello,
en las propiedades del proyecto web, dentro del apartado <span class="codefrag">Spring</span>, a&ntilde;adiremos
este como nuevo archivo dentro de la solapa <span class="codefrag">"Config files"</span>. Adem&aacute;s,
para poder referirnos desde un archivo a los beans contenidos en el otro,
en la solapa <span class="codefrag">"Config sets"</span> crearemos un <em>set</em> nuevo 
(con el nombre que queramos) en el que marcaremos tanto <span class="codefrag">beans.xml</span> como
<span class="codefrag">strutsbeans.xml</span>

</div>
</div>

</li>

<li>Ahora ya podemos definir en <span class="codefrag">strutsbeans.xml</span> un bean por acci&oacute;n. A cada bean
hay que darle un <span class="codefrag">name</span> que coincidir&aacute; con el <span class="codefrag">path</span> que tiene la acci&oacute;n
en el <span class="codefrag">struts-config.xml</span>. La <span class="codefrag">class</span> del bean ser&aacute; el <span class="codefrag">type</span>
que viene en el <span class="codefrag">struts-config.xml</span>. Es decir, que si en el <span class="codefrag">struts-config.xml</span>
tenemos:
<pre class="code">

&lt;action <strong>path="/accionLogin"
	type="es.ua.jtech.proyint.presentacion.acciones.loginlogout.AccionLogin"</strong>
	name="loginForm" scope="request" input="/index.jsp"&gt;
	&lt;forward name="admin" path="/accionListarUsuarios.do" /&gt;
	&lt;forward name="biblio" path="/accionListarTodosLibros.do" /&gt;
	&lt;forward name="socio" path="/jsp/socio/index.jsp" /&gt;
&lt;/action&gt;

</pre>

<p>Necesitaremos este bean en <span class="codefrag">strutsbeans.xml</span>
</p>

<pre class="code">

&lt;bean <strong>name="/accionLogin" 
   class="es.ua.jtech.proyint.presentacion.acciones.loginlogout.AccionLogin"&gt;</strong>
   &lt;property name="iu"&gt;
	  &lt;ref bean="usuarioBO"/&gt;
   &lt;/property&gt;
&lt;/bean&gt;

</pre>

<p>N&oacute;tese que la propiedad del bean se pone para que Spring resuelva autom&aacute;ticamente la dependencia.</p>

<p>
N&oacute;tese que al hacer esto, lo que estamos consiguiendo en realidad es que a la petici&oacute;n "accionLogin.do"
responda Spring en lugar de Struts, que se encargar&aacute; de instanciar la acci&oacute;n de Struts de la clase
necesaria, inyectarle las dependencias y finalmente pasar el control a Struts.
</p>

<div class="frame note">
<div class="label">Nota</div>
<div class="content">Esta no es la &uacute;nica posibilidad que existe para que una acci&oacute;n de Struts tenga acceso
a los beans de Spring con inyecci&oacute;n de dependencias. Tambi&eacute;n podemos hacer que nuestra acci&oacute;n
de Struts herede de una clase propia de Spring, pero esto implica cambios en el c&oacute;digo fuente
y sobre todo dependencia del API de Spring.</div>
</div>

</li>

</ol>
</div>

<a name="N101C5"></a><a name="Transaccionalidad+declarativa"></a>
<h2 class="underlined_10">Transaccionalidad declarativa</h2>
<div class="section">
<p>Codificar los m&eacute;todos ser&aacute; m&aacute;s sencillo si dejamos que Spring se ocupe de gestionar las 
transacciones y hacer <em>rollback</em> en caso necesario. En nuestro caso, los m&eacute;todos m&aacute;s claramente
candidatos a beneficiarse de esto son los que se ocupan de realizar un pr&eacute;stamo y/o una reserva.</p>
<p>Se propone <strong>hacer transaccional como m&iacute;nimo el proceso de reserva de un libro</strong>
con la anotaci&oacute;n <span class="codefrag">@Transactional</span>. Para ello habr&aacute; que hacer los siguientes cambios en el
c&oacute;digo Java:</p>
<ul>

<li>Elegir el nivel al que queremos hacer la transacci&oacute;n. Se puede hacer en negocio, si es que
tenemos implementado <span class="codefrag">LibroBO</span> o bien en el DAO. Lo &uacute;nico que
hay que tener en cuenta es que el m&eacute;todo que deseamos hacer transaccional
debe ser <span class="codefrag">public</span>.</li>

<li>Sustituir en el DAO los m&eacute;todos que ahora obtienen y cierran la conexi&oacute;n por los que proporciona
Spring a trav&eacute;s de <span class="codefrag">DataSourceUtils</span>.</li>

<li>Eliminar el c&oacute;digo que gestiona manualmente la transacci&oacute;n, es decir quitar el
<span class="codefrag">conn.setAutoCommit(false)</span> y el <span class="codefrag">conn.rollback()</span>
que se llama cuando se genera una <span class="codefrag">SQLException</span>
</li>

<li>Para que sea m&aacute;s f&aacute;cil comprobar que se hace el rollback, cambiar
el orden de las operaciones para que primero se cambie el estado del usuario
y luego se inserte el registro en la tabla de operaciones. As&iacute; ser&aacute; sencillo hacer
que la transacci&oacute;n falle haciendo una reserva de un usuario correcto pero de
un isbn inexistente. </li>

</ul>
<p>Por supuesto, tambi&eacute;n habr&aacute; que introducir las modificaciones
necesarias para activar las transacciones declarativas en el archivo
<span class="codefrag">beans.xml</span>. </p>
<p>Finalmente, comprobar que la transaccionalidad funciona y que
 efectivamente se deshace el cambio de estado del usuario si hay una DAOException.</p>
</div>

<a name="N10204"></a><a name="Acceso+remoto+%28OPCIONAL%29"></a>
<h2 class="underlined_10">Acceso remoto (OPCIONAL)</h2>
<div class="section">
<p>De manera opcional, se propone <strong>hacer accesible a clientes remotos el m&eacute;todo para listar
todos los libros de <span class="codefrag">LibroBO</span></strong> (o de <span class="codefrag">LibroDAO</span>, si es que
todav&iacute;a no tienes terminada la capa de negocio).</p>
<p>Para ello necesitar&aacute;s definir un nuevo interfaz que solo tenga esta operaci&oacute;n, hacer
que tu clase implemente <strong>tambi&eacute;n</strong> esta interfaz y configurar
adecuadamente el bean en el XML, haciendo que corresponda con esta clase y con
el nuevo interfaz (para que de forma remota solo sea visible el m&eacute;todo de listar
libros y no el resto).</p>
<div class="frame note">
<div class="label">Nota</div>
<div class="content">
Hacer accesible el DAO como bean remoto solo es aceptable como soluci&oacute;n
pr&aacute;ctica para no obligarte a implementar el objeto <span class="codefrag">LibroBO</span> si
no lo tienes hecho, pero no es la mejor soluci&oacute;n si queremos que un tercero
acceda a nuestros m&eacute;todos, ya que siempre deber&iacute;a pasar por la capa de negocio. La 
excepci&oacute;n ser&iacute;a una aplicaci&oacute;n distribuida en la que la capa de negocio estuviera
en una m&aacute;quina y la de acceso a datos en otra distinta.&iexcl;Pero precisamente
para este tipo de aplicaciones es para las que son indicados los EJBs!
</div>
</div>
</div>

<a name="N10222"></a><a name="Entrega"></a>
<h2 class="underlined_10">Entrega</h2>
<div class="section">
<p>Como hab&eacute;is visto, en este proyecto no se han creado nuevas clases, solo
se han refactorizado las existentes, borrado las que no se necesitaban y creado
ficheros de configuraci&oacute;n.</p>
<ul>

<li>Habr&aacute; 2 ficheros de definici&oacute;n de beans: strutsbeans.xml y beans.xml. De
este &uacute;ltimo habr&aacute; una copia tambi&eacute;n en el proyecto com&uacute;n.</li>

<li>Las clases <span class="codefrag">FactoriaFuenteDatos</span>, <span class="codefrag">FactoriaBOs</span>
y <span class="codefrag">FactoriaDAOs</span> no son necesarias con Spring.</li>

<li>Todas las acciones de Struts deben obtener los BOs o los DAOs que necesiten
a trav&eacute;s de Spring</li>

<li>Todos los BOs deben obtener los DAOs o los otros BOs que necesiten a trav&eacute;s
de Spring</li>

<li>Todos los DAOs deben obtener el datasource a trav&eacute;s de Spring</li>

</ul>
</div>


</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
