<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Mensajes: JMS</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="J2EE" src="images/baner_j2ee_izq.gif" title="Curso Especialista Universitario en Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Proyecto de Integracion" src="images/baner_j2ee_der.gif" title="Proyecto de Integracion"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="../index.html">M&oacute;dulos</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Proyecto de Integraci&oacute;n</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Proyecto de Integraci&oacute;n</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Proyecto de Integraci&oacute;n">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="sesion01-apuntes.html" title="Sesi&oacute;n 1: Caso de estudio">Sesi&oacute;n 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html" title="Sesi&oacute;n 2: DAO con JDBC">Sesi&oacute;n 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html" title="Sesi&oacute;n 3: Aplicaci&oacute;n web con servlets">Sesi&oacute;n 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html" title="Sesi&oacute;n 4: Aplicaci&oacute;n web con servlets y JSPs">Sesi&oacute;n 4</a>
</div>
<div class="menuitem">
<a href="sesion0506-apuntes.html" title="Sesiones 5 y 6: Aplicaci&oacute;n web con Struts">Sesi&oacute;n 5-6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html" title="Sesi&oacute;n 7: Aplicaci&oacute;n web con Hibernate">Sesi&oacute;n 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html" title="Sesi&oacute;n 8: Proyecto web">Sesi&oacute;n 8</a>
</div>
<div class="menuitem">
<a href="sesion09-apuntes.html" title="Sesi&oacute;n 9: Spring">Sesi&oacute;n 9</a>
</div>
<div class="menuitem">
<a href="sesion10-apuntes.html" title="Sesi&oacute;n 10: Servidores de aplicaciones">Sesi&oacute;n 10</a>
</div>
<div class="menuitem">
<a href="sesion11-apuntes.html" title="Sesi&oacute;n 11: Componentes EJB">Sesi&oacute;n 11</a>
</div>
<div class="menupage">
<div class="menupagetitle">Sesi&oacute;n 12</div>
</div>
<div class="menuitem">
<a href="sesion13-apuntes.html" title="Sesi&oacute;n 13: Servicios Web">Sesi&oacute;n 13</a>
</div>
<div class="menuitem">
<a href="sesion14-apuntes.html" title="Sesi&oacute;n 14: Proyecto Enterprise">Sesi&oacute;n 14</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion12-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Mensajes: JMS</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n">Introducci&oacute;n</a>
</li>
<li>
<a href="#Actualizaci%C3%B3n+del+dominio+para+soporte+de+JMS">Actualizaci&oacute;n del dominio para soporte de JMS</a>
</li>
<li>
<a href="#Desarrollo%3A+recomendaciones+generales">Desarrollo: recomendaciones generales</a>
</li>
<li>
<a href="#Desarrollo+en+el+MDB">Desarrollo en el MDB</a>
</li>
<li>
<a href="#Desarrollo+en+el+cliente+JMS">Desarrollo en el cliente JMS</a>
</li>
<li>
<a href="#A+Entregar">A Entregar</a>
</li>
</ul>
</div>


<a name="N1000C"></a><a name="Introducci%C3%B3n"></a>
<h2 class="underlined_10">Introducci&oacute;n</h2>
<div class="section">
<p>El objetivo de esta sesi&oacute;n es aportar una nueva funcionalidad. Se trata de que una biblioteca externa, representada por un 
cliente JMS, realice un pr&eacute;stamo a la nuestra, a trav&eacute;s de un MDB (Bean de Mensajes). La biblioteca externa indica el 
ISBN del libro a pedir prestado y nuestra biblioteca, realiza el pr&eacute;stamo y le env&iacute;a la ficha completa del libro (ISBN, 
Titulo, Autor, y N&uacute;mero de P&aacute;ginas). A grandes rasgos, el protocolo de comunicaci&oacute;n y l&oacute;gica de negocio son los siguientes:</p>
<p>1. El cliente publicar&aacute; su mensaje de texto con el ISBN en el t&oacute;pico <span class="codefrag">remotas</span> y quedar&aacute; a la espera de la recepci&oacute;n de la ficha del libro en la cola <span class="codefrag">respuesta</span>.</p>
<p>2. El MDB escuchar&aacute; el t&oacute;pico <span class="codefrag">remotas</span>. A la recepci&oacute;n del mensaje realizar&aacute; el pr&eacute;stamo a trav&eacute;s de una <span class="codefrag">OperacionLocal</span>, esto es del EJB <span class="codefrag">OperacionBean</span>. Despu&eacute;s, MDB se las arreglar&aacute; para obtener los datos 
completos del libro, construir&aacute; un <span class="codefrag">MapMessage</span> y lo enviar&aacute; a la cola <span class="codefrag">respuesta</span>.</p>
<p>3. El cliente recibir&aacute; de la cola <span class="codefrag">respuesta</span> los datos completos del libro y los mostrar&aacute; en pantalla.</p>
</div>


<a name="N10037"></a><a name="Actualizaci%C3%B3n+del+dominio+para+soporte+de+JMS"></a>
<h2 class="underlined_10">Actualizaci&oacute;n del dominio para soporte de JMS</h2>
<div class="section">
<p>Como ya vimos en uno de los ejericicios del m&oacute;dulo de JMS, lo primero es configurar adecuadamente nuestro dominio
<span class="codefrag">proy-int</span>. Por eso lo arrancaremos y entraremos en la consola de administraci&oacute;n. Los pasos a seguir son :</p>
<p>1. <strong>Crear servidor JMS.</strong> En <em>Services</em>-&amp; <em>Messaging</em> clickear <strong>JMS Servers</strong>. Como la tabla estar&aacute; vac&iacute;a, entonces <em>Lock and Edit</em> y a&ntilde;adir una nueva entrada a la tabla. En 
el nombre, poned <em>JMSserver</em>. Clickear en <em>Next</em> y poner como <strong>target</strong> a <em>AdminServer</em> (el nombre que le habeis dado a vuestro servidor de administraci&oacute;n). Clickear en <em>Finish</em> y luego gabar y activar cambios. Os deber&aacute; aparecer:</p>
<p>
	
<img alt="Creaci&oacute;n del servidor JMS" content-width="12cm" src="imagenes/s12/JMSServer.gif" width="600">
</p>
<p>2. <strong>Crear el m&oacute;dulo JMS.</strong> En <em>Services</em>-&amp; <em>Messaging</em> clickear <strong>JMS Modules</strong>. La tabla correspondiente estar&aacute; vac&iacute;a. Procediendo de manera similar al paso anterior, deberemos 
darle el nombre de <em>biblioteca</em> y clickeando <em>Next</em> darle como <strong>Target</strong> el 
<em>AdminServer</em>. Una vez activados los cambios tendremos:</p>
<p>
	
<img alt="Creaci&oacute;n del m&oacute;dulo JMS" content-width="12cm" src="imagenes/s12/JMSModule.gif" width="600">
</p>
<p>3. <strong>Subdeployments del m&oacute;dulo JMS</strong>. Teniendo en cuenta que vamos a tener que administrar un t&oacute;pico y una cola, en realidad los recursos JMS administrados ser&aacute;n 4 teniendo en cuenta las factor&iacute;as de conexi&oacute;n. Por ello, antes de crear estos recursos, clickearemos en el m&oacute;dulo <em>biblioteca</em>, que acabamos de crear, el tab <strong>Subdeployments</strong>.</p>
<p>Para albergar las factor&iacute;as de conexi&oacute;n crearemos los siguientes:</p>
<ul>
    
<li>
<em>exampleTopic</em> para la <span class="codefrag">es.ua.jtech.proy-int.TopicConnectionFactory</span>
</li>
    
<li>
<em>exampleQueue</em> para <span class="codefrag">es.ua.jtech.proy-int.QueueConnectionFactory</span>
</li>

</ul>
<p>Estas factor&iacute;as se crear&aacute;n <strong>m&aacute;s tarde</strong> y es entonces cuando se asociar&aacute;n a sus subdeployments.</p>
<p>Por otro albergar el t&oacute;pico y la cola (que tambi&eacute;n se crear&aacute;n m&aacute;s tarde):</p>
<ul>
    
<li>
<em>topic</em> para el  <span class="codefrag">remotas</span>
</li>
    
<li>
<em>queue</em> para la <span class="codefrag">respuesta</span>
</li>

</ul>
<p>Cuando se crea un subdeployment solamente se pregunta el <em>Target</em>. Asociad los subdeployments de las factor&iacute;as a 
<em>AdminServer</em> y los de las colas a <em>JMSserver</em>. Tras activar cambios tendremos una tabla como la siguiente:</p>
<p>
	
<img alt="Subdeployments necesarios" content-width="12cm" src="imagenes/s12/Subdeployments.gif" width="600">
</p>
<p>donde, como vemos, los recursos nombrados todav&iacute;a no est&aacute;n asociados.</p>
<p>4. <strong>Creaci&oacute;n de los recursos administrados</strong>. Lo siguiente es clickear en <em>biblioteca</em> para crear los 
4 recursos administrados. Cuando se crea uno de estos recursos te preguntan si es cola, t&oacute;pico, factor&iacute;a de conexi&oacute;n. Se elige la 
opci&oacute;n adecuada en cada caso y luego te preguntan el nombre JNDI. Finalmente preguntan el <strong>Subdeployment</strong> y el 
<strong>Target</strong> ya aparece impl&iacute;cito. Poned lo que aparece en esta tabla, que deber&aacute; ser el resultado final:</p>
<p>
	
<img alt="Recursos JMS necesarios" content-width="12cm" src="imagenes/s12/Resources.gif" width="600">
</p>
<p>Activad cambios. Si creais estos recursos antes del subdeployment os dar&aacute; error. Si todo va bien, el el tab de Subdeployments 
veremos la asociaci&oacute;n de recursos:</p>
<p>
	
<img alt="Recursos JMS necesarios" content-width="12cm" src="imagenes/s12/Subdeployments2.gif" width="600">
</p>
</div>


<a name="N10108"></a><a name="Desarrollo%3A+recomendaciones+generales"></a>
<h2 class="underlined_10">Desarrollo: recomendaciones generales</h2>
<div class="section">
<p>Para desarrollar el cliente y el MDB es aconsejable que tomeis como punto de partida el c&oacute;digo java del ejemplo visto en la Sesion 3 del m&oacute;dulo de JMS correspondiente a la secci&oacute;n Message-Driven Beans.</p>
<p> En el proyecto, el cliente, que renombrareis como <span class="codefrag">ClienteBiblioteca.java</span> se ubicar&aacute; en <span class="codefrag">proy-int-cliente</span> junto con el <span class="codefrag">ClienteOperacion.java</span> desarrollado en la parte EJB. Como nuestro cliente usa funcionalidades de JMS habr&aacute; que incluir <span class="codefrag">weblogic.jar</span> en el Build Path del <span class="codefrag">proy-int-cliente</span>.</p>
<p>En cuanto al MDB, lo ubicareis en <span class="codefrag">proy-int-ejb</span> en el package <span class="codefrag">es.ua.jtech.proyint.beans</span>, junto 
con, p.e. <span class="codefrag">OperacionBean.java</span>
</p>
<p>Con estas recomendaciones b&aacute;sicas podeis empezar a trabajar ya que el cliente env&iacute;a un mensaje de texto y el MDB lo recoge e imprime (mirad la impresi&oacute;n en la ventana donde est&aacute; corriendo el servidor). Este primer paso implica especificar al menos el nombre JNDI de la factor&iacute;a para el t&oacute;pico <span class="codefrag">remotas</span> y el propio t&oacute;pico tanto en el cliente como en el MDB. As&iacute; que una primera indicaci&oacute;n de que todo marcha bien es pedirle al usuario un ISBN desde teclado, construir el mensaje de texto y ver que el cliente lo envia y el MDB lo recibe y lo imprime. </p>
</div>


<a name="N10135"></a><a name="Desarrollo+en+el+MDB"></a>
<h2 class="underlined_10">Desarrollo en el MDB</h2>
<div class="section">
<p>El MDB que tomamos como punto de partida, <span class="codefrag">MessageTraderBean.java</span> (renombradlo a <span class="codefrag">BeanMensajes.java</span>) hace poca cosa, se limita en su m&eacute;todo <span class="codefrag">onMessage()</span> a recibir e imprimir un mensaje de texto. Pero sabemos que desde ese m&eacute;todo puede implementar m&aacute;s l&oacute;gica de negocio. Concretamente lo primero que le vamos a pedir es que realice el prestamo.</p>
<div class="frame warning">
<div class="label">Cuidado</div>
<div class="content">
Tal como est&aacute; preparada la aplicaci&oacute;n solamente los profesores o socios pueden realizar prestamos. Lo m&aacute;s inmediato para solventar 
este problema es definir antes un usuario fict&iacute;cio que realice esta operaci&oacute;n de pr&eacute;stamo interbibliotecario y que tenga uno de los dos roles anterior (p.e. un profesor). Por ejemplo yo he creado el usuario <em>sco</em> con el rol de profesor. 
</div>
</div>
<p>Teniendo el cuenta la advertencia anterior, para realizar el pr&eacute;stamo, primero habr&aacute; que obtener el EJB</p>
<pre class="code">
// Primero obtener el EJB 
    OperacionLocal operacionEJB;
     try {
        Context jndiContext = new InitialContext();
        OperacionLocalHome home = (OperacionLocalHome) 
              jndiContext.lookup("OperacionBeanLocal");
        operacionEJB = (OperacionLocal) home.create();
     } catch (Exception e) {
        throw new RuntimeException("Error al obtener el EJB", e);
     }
</pre>
<p>y luego realizar la operaci&oacute;n de prestamo llamando al m&eacute;todo <span class="codefrag">operacionEJB.realizaPrestamo()</span> con el nombre del usuario fict&iacute;cio y el isbn. Esta operaci&oacute;n devuelve un <span class="codefrag">String</span> que codifica un identificador de operaci&oacute;n (ved en la herramienta de administraci&oacute;n de SQL que la tabla de operaciones ha sido actualizada convenientemente).</p>
<p>El siguiente paso es conseguir los datos del libro. La l&oacute;gica de negocio implementada por <span class="codefrag">OperacionBean</span> no contempla acceder a los datos del libro por lo que una soluci&oacute;n sencilla es usar c&oacute;digo de operaci&oacute;n, ya que ese EJB si tiene la funcionalidad <span class="codefrag">listadoPrestamos()</span> que devuelve una lista de <span class="codefrag">OperacionTO</span>. All&iacute; podeis acceder a la 
operaci&oacute;n identificada por vuestro c&oacute;digo y de ah&iacute; podeis sacar un objeto <span class="codefrag">LibroTO</span> correspondiente a ese c&oacute;digo.</p>
<p>Lo siguiente es crear el contexto para la cola <span class="codefrag">respuesta</span> y todos los objetos JMS necesarios, hasta llegar a un 
<span class="codefrag">QueueSender</span>, para enviar un mensaje MAP. Para construir dicho mensaje  estableceremos las propiedades y sus valores, sacados del objeto <span class="codefrag">LibroTO</span>. Algo as&iacute; como:</p>
<pre class="code">
MapMessage msg_r = (MapMessage) qsession.createMapMessage(); 
       msg_r.setStringProperty("isbn", r_isbn); 
       msg_r.setStringProperty("titulo", r_titulo);
       msg_r.setStringProperty("autor", r_autor);
       msg_r.setIntProperty("numpaginas", r_numpaginas); 
</pre>
<p>despu&eacute;s solo resta enviar el mensaje y cerrar los objetos JMS.</p>
</div>


<a name="N10181"></a><a name="Desarrollo+en+el+cliente+JMS"></a>
<h2 class="underlined_10">Desarrollo en el cliente JMS</h2>
<div class="section">
<p>Es aconsejable que desde el m&eacute;todo <span class="codefrag">main</span> se llame a un m&eacute;todo distinto para enviar y para recibir. Dentro  de cada uno de estos m&eacute;todos se encapsula la funcionalidad de env&iacute;o o recepci&oacute;n (crear los objetos JMS, etc). El de env&iacute;o ya est&aacute; pr&aacute;cticamente codificado. En cuanto al de recepci&oacute;n, de nuevo hay que tener en cuenta que se trata de un mensaje MAP del que extraeremos los valores de las propiedades una vez recibido el mensaje por el <span class="codefrag">QueueReceiver</span> correspondiente:</p>
<pre class="code">
//Mensaje MAP recibido. Extraemos las propiedades
      MapMessage resp = (MapMessage) receiver.receive(); 
      String isbn = resp.getStringProperty("isbn");
      String titulo = resp.getStringProperty("titulo");
      String autor = resp.getStringProperty("autor");
      int numpaginas = resp.getIntProperty("numpaginas");
</pre>
</div>


<a name="N10195"></a><a name="A+Entregar"></a>
<h2 class="underlined_10">A Entregar</h2>
<div class="section">
<p>Tal como hemos especificado al principio hay que entregar el espacio de trabajo del proyecto de integraci&oacute;n conteniendo el cliente y el MDB. Adem&aacute;s hay que entregar el  fichero <span class="codefrag">config.xml</span> del dominio.</p>
<p>El trabajo a realizar se debe efectuar durante la sesi&oacute;n actual, por lo cual no deber&iacute;a ser necesario emplear tiempo extra. De todos modos, el <strong>plazo final</strong> de entrega ser&aacute; 2 d&iacute;as antes de la pr&oacute;xima sesi&oacute;n de integraci&oacute;n.</p>
</div>

<p class="pageBreakAfter"></p>

</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2006-2007 Depto. CCIA</div>
</div>
</body>
</html>
